Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x5f5 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5aca): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x2420): ../AZURE_RTOS/App/app_azure_rtos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0xa53): D:/Dropbox (FLOWMEET)/flowmeet/id/equipos/fmc-320a/desarrollo/firmware/test/dhs_azure/01_stop_mode/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 7	(unsigned)
    <2c>   DW_AT_name        : (indirect string, offset: 0x25ca): unsigned int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 5	(signed)
    <33>   DW_AT_name        : int
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5de1): long long int
 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8
    <40>   DW_AT_encoding    : 4	(float)
    <41>   DW_AT_name        : (indirect string, offset: 0x39c): long double
 <1><45>: Abbrev Number: 2 (DW_TAG_base_type)
    <46>   DW_AT_byte_size   : 1
    <47>   DW_AT_encoding    : 6	(signed char)
    <48>   DW_AT_name        : (indirect string, offset: 0x9bb): signed char
 <1><4c>: Abbrev Number: 2 (DW_TAG_base_type)
    <4d>   DW_AT_byte_size   : 1
    <4e>   DW_AT_encoding    : 8	(unsigned char)
    <4f>   DW_AT_name        : (indirect string, offset: 0x3aa7): unsigned char
 <1><53>: Abbrev Number: 2 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 2
    <55>   DW_AT_encoding    : 5	(signed)
    <56>   DW_AT_name        : (indirect string, offset: 0xb3d): short int
 <1><5a>: Abbrev Number: 2 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 2
    <5c>   DW_AT_encoding    : 7	(unsigned)
    <5d>   DW_AT_name        : (indirect string, offset: 0x7aae): short unsigned int
 <1><61>: Abbrev Number: 2 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : (indirect string, offset: 0x7ec3): long int
 <1><68>: Abbrev Number: 2 (DW_TAG_base_type)
    <69>   DW_AT_byte_size   : 4
    <6a>   DW_AT_encoding    : 7	(unsigned)
    <6b>   DW_AT_name        : (indirect string, offset: 0x1c9f): long unsigned int
 <1><6f>: Abbrev Number: 2 (DW_TAG_base_type)
    <70>   DW_AT_byte_size   : 8
    <71>   DW_AT_encoding    : 7	(unsigned)
    <72>   DW_AT_name        : (indirect string, offset: 0x2155): long long unsigned int
 <1><76>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <77>   DW_AT_byte_size   : 4
 <1><78>: Abbrev Number: 2 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 1
    <7a>   DW_AT_encoding    : 8	(unsigned char)
    <7b>   DW_AT_name        : (indirect string, offset: 0x9c2): char
 <1><7f>: Abbrev Number: 5 (DW_TAG_typedef)
    <80>   DW_AT_name        : (indirect string, offset: 0xa0ba): CHAR
    <84>   DW_AT_decl_file   : 2
    <85>   DW_AT_decl_line   : 103
    <86>   DW_AT_decl_column : 49
    <87>   DW_AT_type        : <0x78>
 <1><8b>: Abbrev Number: 5 (DW_TAG_typedef)
    <8c>   DW_AT_name        : (indirect string, offset: 0xa0b9): UCHAR
    <90>   DW_AT_decl_file   : 2
    <91>   DW_AT_decl_line   : 104
    <92>   DW_AT_decl_column : 49
    <93>   DW_AT_type        : <0x4c>
 <1><97>: Abbrev Number: 5 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indirect string, offset: 0x6ddd): UINT
    <9c>   DW_AT_decl_file   : 2
    <9d>   DW_AT_decl_line   : 106
    <9e>   DW_AT_decl_column : 49
    <9f>   DW_AT_type        : <0x29>
 <1><a3>: Abbrev Number: 5 (DW_TAG_typedef)
    <a4>   DW_AT_name        : (indirect string, offset: 0x40dc): ULONG
    <a8>   DW_AT_decl_file   : 2
    <a9>   DW_AT_decl_line   : 108
    <aa>   DW_AT_decl_column : 49
    <ab>   DW_AT_type        : <0x68>
 <1><af>: Abbrev Number: 6 (DW_TAG_structure_type)
    <b0>   DW_AT_name        : (indirect string, offset: 0x3a2b): TX_TIMER_INTERNAL_STRUCT
    <b4>   DW_AT_byte_size   : 28
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 271
    <b8>   DW_AT_decl_column : 16
    <b9>   DW_AT_sibling     : <0x120>
 <2><bd>: Abbrev Number: 7 (DW_TAG_member)
    <be>   DW_AT_name        : (indirect string, offset: 0x5cf3): tx_timer_internal_remaining_ticks
    <c2>   DW_AT_decl_file   : 3
    <c3>   DW_AT_decl_line   : 275
    <c5>   DW_AT_decl_column : 25
    <c6>   DW_AT_type        : <0xa3>
    <ca>   DW_AT_data_member_location: 0
 <2><cb>: Abbrev Number: 7 (DW_TAG_member)
    <cc>   DW_AT_name        : (indirect string, offset: 0xa8f7): tx_timer_internal_re_initialize_ticks
    <d0>   DW_AT_decl_file   : 3
    <d1>   DW_AT_decl_line   : 276
    <d3>   DW_AT_decl_column : 25
    <d4>   DW_AT_type        : <0xa3>
    <d8>   DW_AT_data_member_location: 4
 <2><d9>: Abbrev Number: 7 (DW_TAG_member)
    <da>   DW_AT_name        : (indirect string, offset: 0x6441): tx_timer_internal_timeout_function
    <de>   DW_AT_decl_file   : 3
    <df>   DW_AT_decl_line   : 279
    <e1>   DW_AT_decl_column : 27
    <e2>   DW_AT_type        : <0x12b>
    <e6>   DW_AT_data_member_location: 8
 <2><e7>: Abbrev Number: 7 (DW_TAG_member)
    <e8>   DW_AT_name        : (indirect string, offset: 0x969a): tx_timer_internal_timeout_param
    <ec>   DW_AT_decl_file   : 3
    <ed>   DW_AT_decl_line   : 280
    <ef>   DW_AT_decl_column : 25
    <f0>   DW_AT_type        : <0xa3>
    <f4>   DW_AT_data_member_location: 12
 <2><f5>: Abbrev Number: 7 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x1067): tx_timer_internal_active_next
    <fa>   DW_AT_decl_file   : 3
    <fb>   DW_AT_decl_line   : 286
    <fd>   DW_AT_decl_column : 26
    <fe>   DW_AT_type        : <0x131>
    <102>   DW_AT_data_member_location: 16
 <2><103>: Abbrev Number: 7 (DW_TAG_member)
    <104>   DW_AT_name        : (indirect string, offset: 0xa4cf): tx_timer_internal_active_previous
    <108>   DW_AT_decl_file   : 3
    <109>   DW_AT_decl_line   : 287
    <10b>   DW_AT_decl_column : 26
    <10c>   DW_AT_type        : <0x131>
    <110>   DW_AT_data_member_location: 20
 <2><111>: Abbrev Number: 7 (DW_TAG_member)
    <112>   DW_AT_name        : (indirect string, offset: 0x5408): tx_timer_internal_list_head
    <116>   DW_AT_decl_file   : 3
    <117>   DW_AT_decl_line   : 291
    <119>   DW_AT_decl_column : 27
    <11a>   DW_AT_type        : <0x137>
    <11e>   DW_AT_data_member_location: 24
 <2><11f>: Abbrev Number: 0
 <1><120>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <121>   DW_AT_prototyped  : 1
    <121>   DW_AT_sibling     : <0x12b>
 <2><125>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <126>   DW_AT_type        : <0xa3>
 <2><12a>: Abbrev Number: 0
 <1><12b>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <12c>   DW_AT_byte_size   : 4
    <12d>   DW_AT_type        : <0x120>
 <1><131>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <132>   DW_AT_byte_size   : 4
    <133>   DW_AT_type        : <0xaf>
 <1><137>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <138>   DW_AT_byte_size   : 4
    <139>   DW_AT_type        : <0x131>
 <1><13d>: Abbrev Number: 11 (DW_TAG_typedef)
    <13e>   DW_AT_name        : (indirect string, offset: 0x8ea3): TX_TIMER_INTERNAL
    <142>   DW_AT_decl_file   : 3
    <143>   DW_AT_decl_line   : 296
    <145>   DW_AT_decl_column : 3
    <146>   DW_AT_type        : <0xaf>
 <1><14a>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <14b>   DW_AT_byte_size   : 4
    <14c>   DW_AT_type        : <0x7f>
 <1><150>: Abbrev Number: 6 (DW_TAG_structure_type)
    <151>   DW_AT_name        : (indirect string, offset: 0x7596): TX_THREAD_STRUCT
    <155>   DW_AT_byte_size   : 176
    <156>   DW_AT_decl_file   : 3
    <157>   DW_AT_decl_line   : 355
    <159>   DW_AT_decl_column : 16
    <15a>   DW_AT_sibling     : <0x373>
 <2><15e>: Abbrev Number: 7 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x4022): tx_thread_id
    <163>   DW_AT_decl_file   : 3
    <164>   DW_AT_decl_line   : 362
    <166>   DW_AT_decl_column : 25
    <167>   DW_AT_type        : <0xa3>
    <16b>   DW_AT_data_member_location: 0
 <2><16c>: Abbrev Number: 7 (DW_TAG_member)
    <16d>   DW_AT_name        : (indirect string, offset: 0x7517): tx_thread_run_count
    <171>   DW_AT_decl_file   : 3
    <172>   DW_AT_decl_line   : 363
    <174>   DW_AT_decl_column : 25
    <175>   DW_AT_type        : <0xa3>
    <179>   DW_AT_data_member_location: 4
 <2><17a>: Abbrev Number: 7 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x2b9f): tx_thread_stack_ptr
    <17f>   DW_AT_decl_file   : 3
    <180>   DW_AT_decl_line   : 364
    <182>   DW_AT_decl_column : 26
    <183>   DW_AT_type        : <0x76>
    <187>   DW_AT_data_member_location: 8
 <2><188>: Abbrev Number: 7 (DW_TAG_member)
    <189>   DW_AT_name        : (indirect string, offset: 0x6fb8): tx_thread_stack_start
    <18d>   DW_AT_decl_file   : 3
    <18e>   DW_AT_decl_line   : 365
    <190>   DW_AT_decl_column : 26
    <191>   DW_AT_type        : <0x76>
    <195>   DW_AT_data_member_location: 12
 <2><196>: Abbrev Number: 7 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x91a0): tx_thread_stack_end
    <19b>   DW_AT_decl_file   : 3
    <19c>   DW_AT_decl_line   : 366
    <19e>   DW_AT_decl_column : 26
    <19f>   DW_AT_type        : <0x76>
    <1a3>   DW_AT_data_member_location: 16
 <2><1a4>: Abbrev Number: 7 (DW_TAG_member)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x9242): tx_thread_stack_size
    <1a9>   DW_AT_decl_file   : 3
    <1aa>   DW_AT_decl_line   : 367
    <1ac>   DW_AT_decl_column : 25
    <1ad>   DW_AT_type        : <0xa3>
    <1b1>   DW_AT_data_member_location: 20
 <2><1b2>: Abbrev Number: 7 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xe3cf3): tx_thread_time_slice
    <1b7>   DW_AT_decl_file   : 3
    <1b8>   DW_AT_decl_line   : 368
    <1ba>   DW_AT_decl_column : 25
    <1bb>   DW_AT_type        : <0xa3>
    <1bf>   DW_AT_data_member_location: 24
 <2><1c0>: Abbrev Number: 7 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3cb5): tx_thread_new_time_slice
    <1c5>   DW_AT_decl_file   : 3
    <1c6>   DW_AT_decl_line   : 369
    <1c8>   DW_AT_decl_column : 25
    <1c9>   DW_AT_type        : <0xa3>
    <1cd>   DW_AT_data_member_location: 28
 <2><1ce>: Abbrev Number: 7 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x6c1d): tx_thread_ready_next
    <1d3>   DW_AT_decl_file   : 3
    <1d4>   DW_AT_decl_line   : 373
    <1d6>   DW_AT_decl_column : 26
    <1d7>   DW_AT_type        : <0x373>
    <1db>   DW_AT_data_member_location: 32
 <2><1dc>: Abbrev Number: 7 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0xb06): tx_thread_ready_previous
    <1e1>   DW_AT_decl_file   : 3
    <1e2>   DW_AT_decl_line   : 374
    <1e4>   DW_AT_decl_column : 26
    <1e5>   DW_AT_type        : <0x373>
    <1e9>   DW_AT_data_member_location: 36
 <2><1ea>: Abbrev Number: 7 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x7cd1): tx_thread_name
    <1ef>   DW_AT_decl_file   : 3
    <1f0>   DW_AT_decl_line   : 382
    <1f2>   DW_AT_decl_column : 26
    <1f3>   DW_AT_type        : <0x14a>
    <1f7>   DW_AT_data_member_location: 40
 <2><1f8>: Abbrev Number: 7 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x384d): tx_thread_priority
    <1fd>   DW_AT_decl_file   : 3
    <1fe>   DW_AT_decl_line   : 383
    <200>   DW_AT_decl_column : 25
    <201>   DW_AT_type        : <0x97>
    <205>   DW_AT_data_member_location: 44
 <2><206>: Abbrev Number: 7 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0x119a): tx_thread_state
    <20b>   DW_AT_decl_file   : 3
    <20c>   DW_AT_decl_line   : 384
    <20e>   DW_AT_decl_column : 25
    <20f>   DW_AT_type        : <0x97>
    <213>   DW_AT_data_member_location: 48
 <2><214>: Abbrev Number: 7 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x97be): tx_thread_delayed_suspend
    <219>   DW_AT_decl_file   : 3
    <21a>   DW_AT_decl_line   : 385
    <21c>   DW_AT_decl_column : 25
    <21d>   DW_AT_type        : <0x97>
    <221>   DW_AT_data_member_location: 52
 <2><222>: Abbrev Number: 7 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x66c5): tx_thread_suspending
    <227>   DW_AT_decl_file   : 3
    <228>   DW_AT_decl_line   : 386
    <22a>   DW_AT_decl_column : 25
    <22b>   DW_AT_type        : <0x97>
    <22f>   DW_AT_data_member_location: 56
 <2><230>: Abbrev Number: 7 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x2675): tx_thread_preempt_threshold
    <235>   DW_AT_decl_file   : 3
    <236>   DW_AT_decl_line   : 387
    <238>   DW_AT_decl_column : 25
    <239>   DW_AT_type        : <0x97>
    <23d>   DW_AT_data_member_location: 60
 <2><23e>: Abbrev Number: 7 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x5154): tx_thread_schedule_hook
    <243>   DW_AT_decl_file   : 3
    <244>   DW_AT_decl_line   : 392
    <246>   DW_AT_decl_column : 27
    <247>   DW_AT_type        : <0x389>
    <24b>   DW_AT_data_member_location: 64
 <2><24c>: Abbrev Number: 7 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0x364): tx_thread_entry
    <251>   DW_AT_decl_file   : 3
    <252>   DW_AT_decl_line   : 400
    <254>   DW_AT_decl_column : 27
    <255>   DW_AT_type        : <0x12b>
    <259>   DW_AT_data_member_location: 68
 <2><25a>: Abbrev Number: 7 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xdbc): tx_thread_entry_parameter
    <25f>   DW_AT_decl_file   : 3
    <260>   DW_AT_decl_line   : 401
    <262>   DW_AT_decl_column : 25
    <263>   DW_AT_type        : <0xa3>
    <267>   DW_AT_data_member_location: 72
 <2><268>: Abbrev Number: 7 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x3a1b): tx_thread_timer
    <26d>   DW_AT_decl_file   : 3
    <26e>   DW_AT_decl_line   : 405
    <270>   DW_AT_decl_column : 25
    <271>   DW_AT_type        : <0x13d>
    <275>   DW_AT_data_member_location: 76
 <2><276>: Abbrev Number: 7 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x718f): tx_thread_suspend_cleanup
    <27b>   DW_AT_decl_file   : 3
    <27c>   DW_AT_decl_line   : 411
    <27e>   DW_AT_decl_column : 27
    <27f>   DW_AT_type        : <0x389>
    <283>   DW_AT_data_member_location: 104
 <2><284>: Abbrev Number: 7 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0x7039): tx_thread_suspend_control_block
    <289>   DW_AT_decl_file   : 3
    <28a>   DW_AT_decl_line   : 412
    <28c>   DW_AT_decl_column : 26
    <28d>   DW_AT_type        : <0x76>
    <291>   DW_AT_data_member_location: 108
 <2><292>: Abbrev Number: 7 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x6c04): tx_thread_suspended_next
    <297>   DW_AT_decl_file   : 3
    <298>   DW_AT_decl_line   : 414
    <29a>   DW_AT_decl_column : 26
    <29b>   DW_AT_type        : <0x373>
    <29f>   DW_AT_data_member_location: 112
 <2><2a0>: Abbrev Number: 7 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x41b3): tx_thread_suspended_previous
    <2a5>   DW_AT_decl_file   : 3
    <2a6>   DW_AT_decl_line   : 415
    <2a8>   DW_AT_decl_column : 26
    <2a9>   DW_AT_type        : <0x373>
    <2ad>   DW_AT_data_member_location: 116
 <2><2ae>: Abbrev Number: 7 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0x76b7): tx_thread_suspend_info
    <2b3>   DW_AT_decl_file   : 3
    <2b4>   DW_AT_decl_line   : 416
    <2b6>   DW_AT_decl_column : 25
    <2b7>   DW_AT_type        : <0xa3>
    <2bb>   DW_AT_data_member_location: 120
 <2><2bc>: Abbrev Number: 7 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x7e66): tx_thread_additional_suspend_info
    <2c1>   DW_AT_decl_file   : 3
    <2c2>   DW_AT_decl_line   : 417
    <2c4>   DW_AT_decl_column : 26
    <2c5>   DW_AT_type        : <0x76>
    <2c9>   DW_AT_data_member_location: 124
 <2><2ca>: Abbrev Number: 7 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x22be): tx_thread_suspend_option
    <2cf>   DW_AT_decl_file   : 3
    <2d0>   DW_AT_decl_line   : 418
    <2d2>   DW_AT_decl_column : 25
    <2d3>   DW_AT_type        : <0x97>
    <2d7>   DW_AT_data_member_location: 128
 <2><2d8>: Abbrev Number: 7 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x2056): tx_thread_suspend_status
    <2dd>   DW_AT_decl_file   : 3
    <2de>   DW_AT_decl_line   : 419
    <2e0>   DW_AT_decl_column : 25
    <2e1>   DW_AT_type        : <0x97>
    <2e5>   DW_AT_data_member_location: 132
 <2><2e6>: Abbrev Number: 7 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0xb47): tx_thread_created_next
    <2eb>   DW_AT_decl_file   : 3
    <2ec>   DW_AT_decl_line   : 428
    <2ee>   DW_AT_decl_column : 26
    <2ef>   DW_AT_type        : <0x373>
    <2f3>   DW_AT_data_member_location: 136
 <2><2f4>: Abbrev Number: 7 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x38e4): tx_thread_created_previous
    <2f9>   DW_AT_decl_file   : 3
    <2fa>   DW_AT_decl_line   : 429
    <2fc>   DW_AT_decl_column : 26
    <2fd>   DW_AT_type        : <0x373>
    <301>   DW_AT_data_member_location: 140
 <2><302>: Abbrev Number: 7 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0x1862): tx_thread_filex_ptr
    <307>   DW_AT_decl_file   : 3
    <308>   DW_AT_decl_line   : 437
    <30a>   DW_AT_decl_column : 26
    <30b>   DW_AT_type        : <0x76>
    <30f>   DW_AT_data_member_location: 144
 <2><310>: Abbrev Number: 7 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x36c8): tx_thread_user_priority
    <315>   DW_AT_decl_file   : 3
    <316>   DW_AT_decl_line   : 443
    <318>   DW_AT_decl_column : 25
    <319>   DW_AT_type        : <0x97>
    <31d>   DW_AT_data_member_location: 148
 <2><31e>: Abbrev Number: 7 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0xfd): tx_thread_user_preempt_threshold
    <323>   DW_AT_decl_file   : 3
    <324>   DW_AT_decl_line   : 444
    <326>   DW_AT_decl_column : 25
    <327>   DW_AT_type        : <0x97>
    <32b>   DW_AT_data_member_location: 152
 <2><32c>: Abbrev Number: 7 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x6066): tx_thread_inherit_priority
    <331>   DW_AT_decl_file   : 3
    <332>   DW_AT_decl_line   : 445
    <334>   DW_AT_decl_column : 25
    <335>   DW_AT_type        : <0x97>
    <339>   DW_AT_data_member_location: 156
 <2><33a>: Abbrev Number: 7 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x1751): tx_thread_owned_mutex_count
    <33f>   DW_AT_decl_file   : 3
    <340>   DW_AT_decl_line   : 448
    <342>   DW_AT_decl_column : 25
    <343>   DW_AT_type        : <0x97>
    <347>   DW_AT_data_member_location: 160
 <2><348>: Abbrev Number: 7 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x53bd): tx_thread_owned_mutex_list
    <34d>   DW_AT_decl_file   : 3
    <34e>   DW_AT_decl_line   : 450
    <350>   DW_AT_decl_column : 26
    <351>   DW_AT_type        : <0x454>
    <355>   DW_AT_data_member_location: 164
 <2><356>: Abbrev Number: 7 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x2443): tx_thread_stack_highest_ptr
    <35b>   DW_AT_decl_file   : 3
    <35c>   DW_AT_decl_line   : 490
    <35e>   DW_AT_decl_column : 26
    <35f>   DW_AT_type        : <0x76>
    <363>   DW_AT_data_member_location: 168
 <2><364>: Abbrev Number: 7 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0x14fc): tx_thread_suspension_sequence
    <369>   DW_AT_decl_file   : 3
    <36a>   DW_AT_decl_line   : 517
    <36c>   DW_AT_decl_column : 25
    <36d>   DW_AT_type        : <0xa3>
    <371>   DW_AT_data_member_location: 172
 <2><372>: Abbrev Number: 0
 <1><373>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <374>   DW_AT_byte_size   : 4
    <375>   DW_AT_type        : <0x150>
 <1><379>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <37a>   DW_AT_prototyped  : 1
    <37a>   DW_AT_sibling     : <0x389>
 <2><37e>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <37f>   DW_AT_type        : <0x373>
 <2><383>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <384>   DW_AT_type        : <0xa3>
 <2><388>: Abbrev Number: 0
 <1><389>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <38a>   DW_AT_byte_size   : 4
    <38b>   DW_AT_type        : <0x379>
 <1><38f>: Abbrev Number: 6 (DW_TAG_structure_type)
    <390>   DW_AT_name        : (indirect string, offset: 0x1c3d): TX_MUTEX_STRUCT
    <394>   DW_AT_byte_size   : 52
    <395>   DW_AT_decl_file   : 3
    <396>   DW_AT_decl_line   : 773
    <398>   DW_AT_decl_column : 16
    <399>   DW_AT_sibling     : <0x454>
 <2><39d>: Abbrev Number: 7 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0x4aa4): tx_mutex_id
    <3a2>   DW_AT_decl_file   : 3
    <3a3>   DW_AT_decl_line   : 777
    <3a5>   DW_AT_decl_column : 25
    <3a6>   DW_AT_type        : <0xa3>
    <3aa>   DW_AT_data_member_location: 0
 <2><3ab>: Abbrev Number: 7 (DW_TAG_member)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x71b3): tx_mutex_name
    <3b0>   DW_AT_decl_file   : 3
    <3b1>   DW_AT_decl_line   : 780
    <3b3>   DW_AT_decl_column : 26
    <3b4>   DW_AT_type        : <0x14a>
    <3b8>   DW_AT_data_member_location: 4
 <2><3b9>: Abbrev Number: 7 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0xfc9): tx_mutex_ownership_count
    <3be>   DW_AT_decl_file   : 3
    <3bf>   DW_AT_decl_line   : 783
    <3c1>   DW_AT_decl_column : 25
    <3c2>   DW_AT_type        : <0x97>
    <3c6>   DW_AT_data_member_location: 8
 <2><3c7>: Abbrev Number: 7 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x562e): tx_mutex_owner
    <3cc>   DW_AT_decl_file   : 3
    <3cd>   DW_AT_decl_line   : 787
    <3cf>   DW_AT_decl_column : 26
    <3d0>   DW_AT_type        : <0x545>
    <3d4>   DW_AT_data_member_location: 12
 <2><3d5>: Abbrev Number: 7 (DW_TAG_member)
    <3d6>   DW_AT_name        : (indirect string, offset: 0xa409): tx_mutex_inherit
    <3da>   DW_AT_decl_file   : 3
    <3db>   DW_AT_decl_line   : 791
    <3dd>   DW_AT_decl_column : 25
    <3de>   DW_AT_type        : <0x97>
    <3e2>   DW_AT_data_member_location: 16
 <2><3e3>: Abbrev Number: 7 (DW_TAG_member)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x63ba): tx_mutex_original_priority
    <3e8>   DW_AT_decl_file   : 3
    <3e9>   DW_AT_decl_line   : 794
    <3eb>   DW_AT_decl_column : 25
    <3ec>   DW_AT_type        : <0x97>
    <3f0>   DW_AT_data_member_location: 20
 <2><3f1>: Abbrev Number: 7 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x15eb): tx_mutex_suspension_list
    <3f6>   DW_AT_decl_file   : 3
    <3f7>   DW_AT_decl_line   : 799
    <3f9>   DW_AT_decl_column : 26
    <3fa>   DW_AT_type        : <0x373>
    <3fe>   DW_AT_data_member_location: 24
 <2><3ff>: Abbrev Number: 7 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0x78a8): tx_mutex_suspended_count
    <404>   DW_AT_decl_file   : 3
    <405>   DW_AT_decl_line   : 800
    <407>   DW_AT_decl_column : 25
    <408>   DW_AT_type        : <0x97>
    <40c>   DW_AT_data_member_location: 28
 <2><40d>: Abbrev Number: 7 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x8268): tx_mutex_created_next
    <412>   DW_AT_decl_file   : 3
    <413>   DW_AT_decl_line   : 804
    <415>   DW_AT_decl_column : 26
    <416>   DW_AT_type        : <0x454>
    <41a>   DW_AT_data_member_location: 32
 <2><41b>: Abbrev Number: 7 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0x7ba): tx_mutex_created_previous
    <420>   DW_AT_decl_file   : 3
    <421>   DW_AT_decl_line   : 805
    <423>   DW_AT_decl_column : 26
    <424>   DW_AT_type        : <0x454>
    <428>   DW_AT_data_member_location: 36
 <2><429>: Abbrev Number: 7 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0x21e7): tx_mutex_highest_priority_waiting
    <42e>   DW_AT_decl_file   : 3
    <42f>   DW_AT_decl_line   : 809
    <431>   DW_AT_decl_column : 25
    <432>   DW_AT_type        : <0x97>
    <436>   DW_AT_data_member_location: 40
 <2><437>: Abbrev Number: 7 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0x942e): tx_mutex_owned_next
    <43c>   DW_AT_decl_file   : 3
    <43d>   DW_AT_decl_line   : 813
    <43f>   DW_AT_decl_column : 26
    <440>   DW_AT_type        : <0x454>
    <444>   DW_AT_data_member_location: 44
 <2><445>: Abbrev Number: 7 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0xa22b): tx_mutex_owned_previous
    <44a>   DW_AT_decl_file   : 3
    <44b>   DW_AT_decl_line   : 814
    <44d>   DW_AT_decl_column : 26
    <44e>   DW_AT_type        : <0x454>
    <452>   DW_AT_data_member_location: 48
 <2><453>: Abbrev Number: 0
 <1><454>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <455>   DW_AT_byte_size   : 4
    <456>   DW_AT_type        : <0x38f>
 <1><45a>: Abbrev Number: 11 (DW_TAG_typedef)
    <45b>   DW_AT_name        : (indirect string, offset: 0x6dfd): TX_THREAD
    <45f>   DW_AT_decl_file   : 3
    <460>   DW_AT_decl_line   : 525
    <462>   DW_AT_decl_column : 3
    <463>   DW_AT_type        : <0x150>
 <1><467>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <468>   DW_AT_byte_size   : 4
    <469>   DW_AT_type        : <0x8b>
 <1><46d>: Abbrev Number: 6 (DW_TAG_structure_type)
    <46e>   DW_AT_name        : (indirect string, offset: 0x4857): TX_BYTE_POOL_STRUCT
    <472>   DW_AT_byte_size   : 52
    <473>   DW_AT_decl_file   : 3
    <474>   DW_AT_decl_line   : 608
    <476>   DW_AT_decl_column : 16
    <477>   DW_AT_sibling     : <0x532>
 <2><47b>: Abbrev Number: 7 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0x1741): tx_byte_pool_id
    <480>   DW_AT_decl_file   : 3
    <481>   DW_AT_decl_line   : 612
    <483>   DW_AT_decl_column : 25
    <484>   DW_AT_type        : <0xa3>
    <488>   DW_AT_data_member_location: 0
 <2><489>: Abbrev Number: 7 (DW_TAG_member)
    <48a>   DW_AT_name        : (indirect string, offset: 0x6421): tx_byte_pool_name
    <48e>   DW_AT_decl_file   : 3
    <48f>   DW_AT_decl_line   : 615
    <491>   DW_AT_decl_column : 26
    <492>   DW_AT_type        : <0x14a>
    <496>   DW_AT_data_member_location: 4
 <2><497>: Abbrev Number: 7 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x7d4): tx_byte_pool_available
    <49c>   DW_AT_decl_file   : 3
    <49d>   DW_AT_decl_line   : 618
    <49f>   DW_AT_decl_column : 25
    <4a0>   DW_AT_type        : <0xa3>
    <4a4>   DW_AT_data_member_location: 8
 <2><4a5>: Abbrev Number: 7 (DW_TAG_member)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x7cf3): tx_byte_pool_fragments
    <4aa>   DW_AT_decl_file   : 3
    <4ab>   DW_AT_decl_line   : 621
    <4ad>   DW_AT_decl_column : 25
    <4ae>   DW_AT_type        : <0x97>
    <4b2>   DW_AT_data_member_location: 12
 <2><4b3>: Abbrev Number: 7 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x4204): tx_byte_pool_list
    <4b8>   DW_AT_decl_file   : 3
    <4b9>   DW_AT_decl_line   : 624
    <4bb>   DW_AT_decl_column : 26
    <4bc>   DW_AT_type        : <0x467>
    <4c0>   DW_AT_data_member_location: 16
 <2><4c1>: Abbrev Number: 7 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x6d13): tx_byte_pool_search
    <4c6>   DW_AT_decl_file   : 3
    <4c7>   DW_AT_decl_line   : 628
    <4c9>   DW_AT_decl_column : 26
    <4ca>   DW_AT_type        : <0x467>
    <4ce>   DW_AT_data_member_location: 20
 <2><4cf>: Abbrev Number: 7 (DW_TAG_member)
    <4d0>   DW_AT_name        : (indirect string, offset: 0x7ce0): tx_byte_pool_start
    <4d4>   DW_AT_decl_file   : 3
    <4d5>   DW_AT_decl_line   : 631
    <4d7>   DW_AT_decl_column : 26
    <4d8>   DW_AT_type        : <0x467>
    <4dc>   DW_AT_data_member_location: 24
 <2><4dd>: Abbrev Number: 7 (DW_TAG_member)
    <4de>   DW_AT_name        : (indirect string, offset: 0x15d9): tx_byte_pool_size
    <4e2>   DW_AT_decl_file   : 3
    <4e3>   DW_AT_decl_line   : 634
    <4e5>   DW_AT_decl_column : 25
    <4e6>   DW_AT_type        : <0xa3>
    <4ea>   DW_AT_data_member_location: 28
 <2><4eb>: Abbrev Number: 7 (DW_TAG_member)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x41a0): tx_byte_pool_owner
    <4f0>   DW_AT_decl_file   : 3
    <4f1>   DW_AT_decl_line   : 640
    <4f3>   DW_AT_decl_column : 26
    <4f4>   DW_AT_type        : <0x373>
    <4f8>   DW_AT_data_member_location: 32
 <2><4f9>: Abbrev Number: 7 (DW_TAG_member)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x9183): tx_byte_pool_suspension_list
    <4fe>   DW_AT_decl_file   : 3
    <4ff>   DW_AT_decl_line   : 645
    <501>   DW_AT_decl_column : 26
    <502>   DW_AT_type        : <0x373>
    <506>   DW_AT_data_member_location: 36
 <2><507>: Abbrev Number: 7 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0x7797): tx_byte_pool_suspended_count
    <50c>   DW_AT_decl_file   : 3
    <50d>   DW_AT_decl_line   : 646
    <50f>   DW_AT_decl_column : 25
    <510>   DW_AT_type        : <0x97>
    <514>   DW_AT_data_member_location: 40
 <2><515>: Abbrev Number: 7 (DW_TAG_member)
    <516>   DW_AT_name        : (indirect string, offset: 0x66c): tx_byte_pool_created_next
    <51a>   DW_AT_decl_file   : 3
    <51b>   DW_AT_decl_line   : 650
    <51d>   DW_AT_decl_column : 26
    <51e>   DW_AT_type        : <0x532>
    <522>   DW_AT_data_member_location: 44
 <2><523>: Abbrev Number: 7 (DW_TAG_member)
    <524>   DW_AT_name        : (indirect string, offset: 0x7d0a): tx_byte_pool_created_previous
    <528>   DW_AT_decl_file   : 3
    <529>   DW_AT_decl_line   : 651
    <52b>   DW_AT_decl_column : 26
    <52c>   DW_AT_type        : <0x532>
    <530>   DW_AT_data_member_location: 48
 <2><531>: Abbrev Number: 0
 <1><532>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <533>   DW_AT_byte_size   : 4
    <534>   DW_AT_type        : <0x46d>
 <1><538>: Abbrev Number: 11 (DW_TAG_typedef)
    <539>   DW_AT_name        : (indirect string, offset: 0x30): TX_BYTE_POOL
    <53d>   DW_AT_decl_file   : 3
    <53e>   DW_AT_decl_line   : 682
    <540>   DW_AT_decl_column : 3
    <541>   DW_AT_type        : <0x46d>
 <1><545>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <546>   DW_AT_byte_size   : 4
    <547>   DW_AT_type        : <0x45a>
 <1><54b>: Abbrev Number: 12 (DW_TAG_array_type)
    <54c>   DW_AT_type        : <0x8b>
    <550>   DW_AT_sibling     : <0x55c>
 <2><554>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <555>   DW_AT_type        : <0x29>
    <559>   DW_AT_upper_bound : 1023
 <2><55b>: Abbrev Number: 0
 <1><55c>: Abbrev Number: 14 (DW_TAG_variable)
    <55d>   DW_AT_name        : (indirect string, offset: 0x9dc2): tx_byte_pool_buffer
    <561>   DW_AT_decl_file   : 1
    <562>   DW_AT_decl_line   : 49
    <563>   DW_AT_decl_column : 14
    <564>   DW_AT_type        : <0x54b>
    <568>   DW_AT_location    : 5 byte block: 3 2c 0 0 20 	(DW_OP_addr: 2000002c)
 <1><56e>: Abbrev Number: 14 (DW_TAG_variable)
    <56f>   DW_AT_name        : (indirect string, offset: 0x1f31): tx_app_byte_pool
    <573>   DW_AT_decl_file   : 1
    <574>   DW_AT_decl_line   : 50
    <575>   DW_AT_decl_column : 21
    <576>   DW_AT_type        : <0x538>
    <57a>   DW_AT_location    : 5 byte block: 3 2c 4 0 20 	(DW_OP_addr: 2000042c)
 <1><580>: Abbrev Number: 15 (DW_TAG_subprogram)
    <581>   DW_AT_external    : 1
    <581>   DW_AT_name        : (indirect string, offset: 0x6d60): App_ThreadX_Init
    <585>   DW_AT_decl_file   : 4
    <586>   DW_AT_decl_line   : 52
    <587>   DW_AT_decl_column : 6
    <588>   DW_AT_prototyped  : 1
    <588>   DW_AT_type        : <0x97>
    <58c>   DW_AT_declaration : 1
    <58c>   DW_AT_sibling     : <0x596>
 <2><590>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <591>   DW_AT_type        : <0x76>
 <2><595>: Abbrev Number: 0
 <1><596>: Abbrev Number: 16 (DW_TAG_subprogram)
    <597>   DW_AT_external    : 1
    <597>   DW_AT_name        : (indirect string, offset: 0x6165): _txe_byte_pool_create
    <59b>   DW_AT_decl_file   : 3
    <59c>   DW_AT_decl_line   : 1421
    <59e>   DW_AT_decl_column : 13
    <59f>   DW_AT_prototyped  : 1
    <59f>   DW_AT_type        : <0x97>
    <5a3>   DW_AT_declaration : 1
    <5a3>   DW_AT_sibling     : <0x5c1>
 <2><5a7>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5a8>   DW_AT_type        : <0x5c1>
 <2><5ac>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5ad>   DW_AT_type        : <0x14a>
 <2><5b1>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5b2>   DW_AT_type        : <0x76>
 <2><5b6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5b7>   DW_AT_type        : <0xa3>
 <2><5bb>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5bc>   DW_AT_type        : <0x97>
 <2><5c0>: Abbrev Number: 0
 <1><5c1>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <5c2>   DW_AT_byte_size   : 4
    <5c3>   DW_AT_type        : <0x538>
 <1><5c7>: Abbrev Number: 17 (DW_TAG_subprogram)
    <5c8>   DW_AT_external    : 1
    <5c8>   DW_AT_name        : (indirect string, offset: 0x3fe5): tx_application_define
    <5cc>   DW_AT_decl_file   : 1
    <5cd>   DW_AT_decl_line   : 66
    <5ce>   DW_AT_decl_column : 6
    <5cf>   DW_AT_prototyped  : 1
    <5cf>   DW_AT_low_pc      : 0x800072c
    <5d3>   DW_AT_high_pc     : 0x40
    <5d7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5d9>   DW_AT_GNU_all_tail_call_sites: 1
 <2><5d9>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <5da>   DW_AT_name        : (indirect string, offset: 0x988b): first_unused_memory
    <5de>   DW_AT_decl_file   : 1
    <5df>   DW_AT_decl_line   : 66
    <5e0>   DW_AT_decl_column : 34
    <5e1>   DW_AT_type        : <0x76>
    <5e5>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><5e8>: Abbrev Number: 14 (DW_TAG_variable)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x4234): memory_ptr
    <5ed>   DW_AT_decl_file   : 1
    <5ee>   DW_AT_decl_line   : 72
    <5ef>   DW_AT_decl_column : 9
    <5f0>   DW_AT_type        : <0x76>
    <5f4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><5f7>: Abbrev Number: 0
 <1><5f8>: Abbrev Number: 0
  Compilation Unit @ offset 0x5f9:
   Length:        0xce2 (32-bit)
   Version:       4
   Abbrev Offset: 0x109
   Pointer Size:  4
 <0><604>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <605>   DW_AT_producer    : (indirect string, offset: 0x5aca): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <609>   DW_AT_language    : 12	(ANSI C99)
    <60a>   DW_AT_name        : (indirect string, offset: 0x7654c): ../Core/Src/app_threadx.c
    <60e>   DW_AT_comp_dir    : (indirect string, offset: 0xa53): D:/Dropbox (FLOWMEET)/flowmeet/id/equipos/fmc-320a/desarrollo/firmware/test/dhs_azure/01_stop_mode/Debug
    <612>   DW_AT_ranges      : 0x10
    <616>   DW_AT_low_pc      : 0x0
    <61a>   DW_AT_stmt_list   : 0x5ca
    <61e>   DW_AT_GNU_macros  : 0x20e7
 <1><622>: Abbrev Number: 2 (DW_TAG_base_type)
    <623>   DW_AT_byte_size   : 4
    <624>   DW_AT_encoding    : 7	(unsigned)
    <625>   DW_AT_name        : (indirect string, offset: 0x25ca): unsigned int
 <1><629>: Abbrev Number: 3 (DW_TAG_base_type)
    <62a>   DW_AT_byte_size   : 4
    <62b>   DW_AT_encoding    : 5	(signed)
    <62c>   DW_AT_name        : int
 <1><630>: Abbrev Number: 2 (DW_TAG_base_type)
    <631>   DW_AT_byte_size   : 8
    <632>   DW_AT_encoding    : 5	(signed)
    <633>   DW_AT_name        : (indirect string, offset: 0x5de1): long long int
 <1><637>: Abbrev Number: 2 (DW_TAG_base_type)
    <638>   DW_AT_byte_size   : 8
    <639>   DW_AT_encoding    : 4	(float)
    <63a>   DW_AT_name        : (indirect string, offset: 0x39c): long double
 <1><63e>: Abbrev Number: 2 (DW_TAG_base_type)
    <63f>   DW_AT_byte_size   : 1
    <640>   DW_AT_encoding    : 6	(signed char)
    <641>   DW_AT_name        : (indirect string, offset: 0x9bb): signed char
 <1><645>: Abbrev Number: 4 (DW_TAG_typedef)
    <646>   DW_AT_name        : (indirect string, offset: 0x46173): __uint8_t
    <64a>   DW_AT_decl_file   : 2
    <64b>   DW_AT_decl_line   : 43
    <64c>   DW_AT_decl_column : 24
    <64d>   DW_AT_type        : <0x651>
 <1><651>: Abbrev Number: 2 (DW_TAG_base_type)
    <652>   DW_AT_byte_size   : 1
    <653>   DW_AT_encoding    : 8	(unsigned char)
    <654>   DW_AT_name        : (indirect string, offset: 0x3aa7): unsigned char
 <1><658>: Abbrev Number: 2 (DW_TAG_base_type)
    <659>   DW_AT_byte_size   : 2
    <65a>   DW_AT_encoding    : 5	(signed)
    <65b>   DW_AT_name        : (indirect string, offset: 0xb3d): short int
 <1><65f>: Abbrev Number: 4 (DW_TAG_typedef)
    <660>   DW_AT_name        : (indirect string, offset: 0xb5aac): __uint16_t
    <664>   DW_AT_decl_file   : 2
    <665>   DW_AT_decl_line   : 57
    <666>   DW_AT_decl_column : 25
    <667>   DW_AT_type        : <0x66b>
 <1><66b>: Abbrev Number: 2 (DW_TAG_base_type)
    <66c>   DW_AT_byte_size   : 2
    <66d>   DW_AT_encoding    : 7	(unsigned)
    <66e>   DW_AT_name        : (indirect string, offset: 0x7aae): short unsigned int
 <1><672>: Abbrev Number: 2 (DW_TAG_base_type)
    <673>   DW_AT_byte_size   : 4
    <674>   DW_AT_encoding    : 5	(signed)
    <675>   DW_AT_name        : (indirect string, offset: 0x7ec3): long int
 <1><679>: Abbrev Number: 4 (DW_TAG_typedef)
    <67a>   DW_AT_name        : (indirect string, offset: 0x90594): __uint32_t
    <67e>   DW_AT_decl_file   : 2
    <67f>   DW_AT_decl_line   : 79
    <680>   DW_AT_decl_column : 25
    <681>   DW_AT_type        : <0x685>
 <1><685>: Abbrev Number: 2 (DW_TAG_base_type)
    <686>   DW_AT_byte_size   : 4
    <687>   DW_AT_encoding    : 7	(unsigned)
    <688>   DW_AT_name        : (indirect string, offset: 0x1c9f): long unsigned int
 <1><68c>: Abbrev Number: 2 (DW_TAG_base_type)
    <68d>   DW_AT_byte_size   : 8
    <68e>   DW_AT_encoding    : 7	(unsigned)
    <68f>   DW_AT_name        : (indirect string, offset: 0x2155): long long unsigned int
 <1><693>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <694>   DW_AT_byte_size   : 4
 <1><695>: Abbrev Number: 2 (DW_TAG_base_type)
    <696>   DW_AT_byte_size   : 1
    <697>   DW_AT_encoding    : 8	(unsigned char)
    <698>   DW_AT_name        : (indirect string, offset: 0x9c2): char
 <1><69c>: Abbrev Number: 4 (DW_TAG_typedef)
    <69d>   DW_AT_name        : (indirect string, offset: 0xa0ba): CHAR
    <6a1>   DW_AT_decl_file   : 3
    <6a2>   DW_AT_decl_line   : 103
    <6a3>   DW_AT_decl_column : 49
    <6a4>   DW_AT_type        : <0x695>
 <1><6a8>: Abbrev Number: 4 (DW_TAG_typedef)
    <6a9>   DW_AT_name        : (indirect string, offset: 0xa0b9): UCHAR
    <6ad>   DW_AT_decl_file   : 3
    <6ae>   DW_AT_decl_line   : 104
    <6af>   DW_AT_decl_column : 49
    <6b0>   DW_AT_type        : <0x651>
 <1><6b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <6b5>   DW_AT_name        : (indirect string, offset: 0x6ddd): UINT
    <6b9>   DW_AT_decl_file   : 3
    <6ba>   DW_AT_decl_line   : 106
    <6bb>   DW_AT_decl_column : 49
    <6bc>   DW_AT_type        : <0x622>
 <1><6c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x40dc): ULONG
    <6c5>   DW_AT_decl_file   : 3
    <6c6>   DW_AT_decl_line   : 108
    <6c7>   DW_AT_decl_column : 49
    <6c8>   DW_AT_type        : <0x685>
 <1><6cc>: Abbrev Number: 6 (DW_TAG_structure_type)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x3a2b): TX_TIMER_INTERNAL_STRUCT
    <6d1>   DW_AT_byte_size   : 28
    <6d2>   DW_AT_decl_file   : 4
    <6d3>   DW_AT_decl_line   : 271
    <6d5>   DW_AT_decl_column : 16
    <6d6>   DW_AT_sibling     : <0x73d>
 <2><6da>: Abbrev Number: 7 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0x5cf3): tx_timer_internal_remaining_ticks
    <6df>   DW_AT_decl_file   : 4
    <6e0>   DW_AT_decl_line   : 275
    <6e2>   DW_AT_decl_column : 25
    <6e3>   DW_AT_type        : <0x6c0>
    <6e7>   DW_AT_data_member_location: 0
 <2><6e8>: Abbrev Number: 7 (DW_TAG_member)
    <6e9>   DW_AT_name        : (indirect string, offset: 0xa8f7): tx_timer_internal_re_initialize_ticks
    <6ed>   DW_AT_decl_file   : 4
    <6ee>   DW_AT_decl_line   : 276
    <6f0>   DW_AT_decl_column : 25
    <6f1>   DW_AT_type        : <0x6c0>
    <6f5>   DW_AT_data_member_location: 4
 <2><6f6>: Abbrev Number: 7 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0x6441): tx_timer_internal_timeout_function
    <6fb>   DW_AT_decl_file   : 4
    <6fc>   DW_AT_decl_line   : 279
    <6fe>   DW_AT_decl_column : 27
    <6ff>   DW_AT_type        : <0x748>
    <703>   DW_AT_data_member_location: 8
 <2><704>: Abbrev Number: 7 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0x969a): tx_timer_internal_timeout_param
    <709>   DW_AT_decl_file   : 4
    <70a>   DW_AT_decl_line   : 280
    <70c>   DW_AT_decl_column : 25
    <70d>   DW_AT_type        : <0x6c0>
    <711>   DW_AT_data_member_location: 12
 <2><712>: Abbrev Number: 7 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0x1067): tx_timer_internal_active_next
    <717>   DW_AT_decl_file   : 4
    <718>   DW_AT_decl_line   : 286
    <71a>   DW_AT_decl_column : 26
    <71b>   DW_AT_type        : <0x74e>
    <71f>   DW_AT_data_member_location: 16
 <2><720>: Abbrev Number: 7 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0xa4cf): tx_timer_internal_active_previous
    <725>   DW_AT_decl_file   : 4
    <726>   DW_AT_decl_line   : 287
    <728>   DW_AT_decl_column : 26
    <729>   DW_AT_type        : <0x74e>
    <72d>   DW_AT_data_member_location: 20
 <2><72e>: Abbrev Number: 7 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x5408): tx_timer_internal_list_head
    <733>   DW_AT_decl_file   : 4
    <734>   DW_AT_decl_line   : 291
    <736>   DW_AT_decl_column : 27
    <737>   DW_AT_type        : <0x754>
    <73b>   DW_AT_data_member_location: 24
 <2><73c>: Abbrev Number: 0
 <1><73d>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <73e>   DW_AT_prototyped  : 1
    <73e>   DW_AT_sibling     : <0x748>
 <2><742>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <743>   DW_AT_type        : <0x6c0>
 <2><747>: Abbrev Number: 0
 <1><748>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <749>   DW_AT_byte_size   : 4
    <74a>   DW_AT_type        : <0x73d>
 <1><74e>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <74f>   DW_AT_byte_size   : 4
    <750>   DW_AT_type        : <0x6cc>
 <1><754>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <755>   DW_AT_byte_size   : 4
    <756>   DW_AT_type        : <0x74e>
 <1><75a>: Abbrev Number: 11 (DW_TAG_typedef)
    <75b>   DW_AT_name        : (indirect string, offset: 0x8ea3): TX_TIMER_INTERNAL
    <75f>   DW_AT_decl_file   : 4
    <760>   DW_AT_decl_line   : 296
    <762>   DW_AT_decl_column : 3
    <763>   DW_AT_type        : <0x6cc>
 <1><767>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <768>   DW_AT_byte_size   : 4
    <769>   DW_AT_type        : <0x69c>
 <1><76d>: Abbrev Number: 6 (DW_TAG_structure_type)
    <76e>   DW_AT_name        : (indirect string, offset: 0x7596): TX_THREAD_STRUCT
    <772>   DW_AT_byte_size   : 176
    <773>   DW_AT_decl_file   : 4
    <774>   DW_AT_decl_line   : 355
    <776>   DW_AT_decl_column : 16
    <777>   DW_AT_sibling     : <0x990>
 <2><77b>: Abbrev Number: 7 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0x4022): tx_thread_id
    <780>   DW_AT_decl_file   : 4
    <781>   DW_AT_decl_line   : 362
    <783>   DW_AT_decl_column : 25
    <784>   DW_AT_type        : <0x6c0>
    <788>   DW_AT_data_member_location: 0
 <2><789>: Abbrev Number: 7 (DW_TAG_member)
    <78a>   DW_AT_name        : (indirect string, offset: 0x7517): tx_thread_run_count
    <78e>   DW_AT_decl_file   : 4
    <78f>   DW_AT_decl_line   : 363
    <791>   DW_AT_decl_column : 25
    <792>   DW_AT_type        : <0x6c0>
    <796>   DW_AT_data_member_location: 4
 <2><797>: Abbrev Number: 7 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0x2b9f): tx_thread_stack_ptr
    <79c>   DW_AT_decl_file   : 4
    <79d>   DW_AT_decl_line   : 364
    <79f>   DW_AT_decl_column : 26
    <7a0>   DW_AT_type        : <0x693>
    <7a4>   DW_AT_data_member_location: 8
 <2><7a5>: Abbrev Number: 7 (DW_TAG_member)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x6fb8): tx_thread_stack_start
    <7aa>   DW_AT_decl_file   : 4
    <7ab>   DW_AT_decl_line   : 365
    <7ad>   DW_AT_decl_column : 26
    <7ae>   DW_AT_type        : <0x693>
    <7b2>   DW_AT_data_member_location: 12
 <2><7b3>: Abbrev Number: 7 (DW_TAG_member)
    <7b4>   DW_AT_name        : (indirect string, offset: 0x91a0): tx_thread_stack_end
    <7b8>   DW_AT_decl_file   : 4
    <7b9>   DW_AT_decl_line   : 366
    <7bb>   DW_AT_decl_column : 26
    <7bc>   DW_AT_type        : <0x693>
    <7c0>   DW_AT_data_member_location: 16
 <2><7c1>: Abbrev Number: 7 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x9242): tx_thread_stack_size
    <7c6>   DW_AT_decl_file   : 4
    <7c7>   DW_AT_decl_line   : 367
    <7c9>   DW_AT_decl_column : 25
    <7ca>   DW_AT_type        : <0x6c0>
    <7ce>   DW_AT_data_member_location: 20
 <2><7cf>: Abbrev Number: 7 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0xe3cf3): tx_thread_time_slice
    <7d4>   DW_AT_decl_file   : 4
    <7d5>   DW_AT_decl_line   : 368
    <7d7>   DW_AT_decl_column : 25
    <7d8>   DW_AT_type        : <0x6c0>
    <7dc>   DW_AT_data_member_location: 24
 <2><7dd>: Abbrev Number: 7 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0x3cb5): tx_thread_new_time_slice
    <7e2>   DW_AT_decl_file   : 4
    <7e3>   DW_AT_decl_line   : 369
    <7e5>   DW_AT_decl_column : 25
    <7e6>   DW_AT_type        : <0x6c0>
    <7ea>   DW_AT_data_member_location: 28
 <2><7eb>: Abbrev Number: 7 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x6c1d): tx_thread_ready_next
    <7f0>   DW_AT_decl_file   : 4
    <7f1>   DW_AT_decl_line   : 373
    <7f3>   DW_AT_decl_column : 26
    <7f4>   DW_AT_type        : <0x990>
    <7f8>   DW_AT_data_member_location: 32
 <2><7f9>: Abbrev Number: 7 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xb06): tx_thread_ready_previous
    <7fe>   DW_AT_decl_file   : 4
    <7ff>   DW_AT_decl_line   : 374
    <801>   DW_AT_decl_column : 26
    <802>   DW_AT_type        : <0x990>
    <806>   DW_AT_data_member_location: 36
 <2><807>: Abbrev Number: 7 (DW_TAG_member)
    <808>   DW_AT_name        : (indirect string, offset: 0x7cd1): tx_thread_name
    <80c>   DW_AT_decl_file   : 4
    <80d>   DW_AT_decl_line   : 382
    <80f>   DW_AT_decl_column : 26
    <810>   DW_AT_type        : <0x767>
    <814>   DW_AT_data_member_location: 40
 <2><815>: Abbrev Number: 7 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x384d): tx_thread_priority
    <81a>   DW_AT_decl_file   : 4
    <81b>   DW_AT_decl_line   : 383
    <81d>   DW_AT_decl_column : 25
    <81e>   DW_AT_type        : <0x6b4>
    <822>   DW_AT_data_member_location: 44
 <2><823>: Abbrev Number: 7 (DW_TAG_member)
    <824>   DW_AT_name        : (indirect string, offset: 0x119a): tx_thread_state
    <828>   DW_AT_decl_file   : 4
    <829>   DW_AT_decl_line   : 384
    <82b>   DW_AT_decl_column : 25
    <82c>   DW_AT_type        : <0x6b4>
    <830>   DW_AT_data_member_location: 48
 <2><831>: Abbrev Number: 7 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x97be): tx_thread_delayed_suspend
    <836>   DW_AT_decl_file   : 4
    <837>   DW_AT_decl_line   : 385
    <839>   DW_AT_decl_column : 25
    <83a>   DW_AT_type        : <0x6b4>
    <83e>   DW_AT_data_member_location: 52
 <2><83f>: Abbrev Number: 7 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x66c5): tx_thread_suspending
    <844>   DW_AT_decl_file   : 4
    <845>   DW_AT_decl_line   : 386
    <847>   DW_AT_decl_column : 25
    <848>   DW_AT_type        : <0x6b4>
    <84c>   DW_AT_data_member_location: 56
 <2><84d>: Abbrev Number: 7 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0x2675): tx_thread_preempt_threshold
    <852>   DW_AT_decl_file   : 4
    <853>   DW_AT_decl_line   : 387
    <855>   DW_AT_decl_column : 25
    <856>   DW_AT_type        : <0x6b4>
    <85a>   DW_AT_data_member_location: 60
 <2><85b>: Abbrev Number: 7 (DW_TAG_member)
    <85c>   DW_AT_name        : (indirect string, offset: 0x5154): tx_thread_schedule_hook
    <860>   DW_AT_decl_file   : 4
    <861>   DW_AT_decl_line   : 392
    <863>   DW_AT_decl_column : 27
    <864>   DW_AT_type        : <0x9a6>
    <868>   DW_AT_data_member_location: 64
 <2><869>: Abbrev Number: 7 (DW_TAG_member)
    <86a>   DW_AT_name        : (indirect string, offset: 0x364): tx_thread_entry
    <86e>   DW_AT_decl_file   : 4
    <86f>   DW_AT_decl_line   : 400
    <871>   DW_AT_decl_column : 27
    <872>   DW_AT_type        : <0x748>
    <876>   DW_AT_data_member_location: 68
 <2><877>: Abbrev Number: 7 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0xdbc): tx_thread_entry_parameter
    <87c>   DW_AT_decl_file   : 4
    <87d>   DW_AT_decl_line   : 401
    <87f>   DW_AT_decl_column : 25
    <880>   DW_AT_type        : <0x6c0>
    <884>   DW_AT_data_member_location: 72
 <2><885>: Abbrev Number: 7 (DW_TAG_member)
    <886>   DW_AT_name        : (indirect string, offset: 0x3a1b): tx_thread_timer
    <88a>   DW_AT_decl_file   : 4
    <88b>   DW_AT_decl_line   : 405
    <88d>   DW_AT_decl_column : 25
    <88e>   DW_AT_type        : <0x75a>
    <892>   DW_AT_data_member_location: 76
 <2><893>: Abbrev Number: 7 (DW_TAG_member)
    <894>   DW_AT_name        : (indirect string, offset: 0x718f): tx_thread_suspend_cleanup
    <898>   DW_AT_decl_file   : 4
    <899>   DW_AT_decl_line   : 411
    <89b>   DW_AT_decl_column : 27
    <89c>   DW_AT_type        : <0x9a6>
    <8a0>   DW_AT_data_member_location: 104
 <2><8a1>: Abbrev Number: 7 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x7039): tx_thread_suspend_control_block
    <8a6>   DW_AT_decl_file   : 4
    <8a7>   DW_AT_decl_line   : 412
    <8a9>   DW_AT_decl_column : 26
    <8aa>   DW_AT_type        : <0x693>
    <8ae>   DW_AT_data_member_location: 108
 <2><8af>: Abbrev Number: 7 (DW_TAG_member)
    <8b0>   DW_AT_name        : (indirect string, offset: 0x6c04): tx_thread_suspended_next
    <8b4>   DW_AT_decl_file   : 4
    <8b5>   DW_AT_decl_line   : 414
    <8b7>   DW_AT_decl_column : 26
    <8b8>   DW_AT_type        : <0x990>
    <8bc>   DW_AT_data_member_location: 112
 <2><8bd>: Abbrev Number: 7 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0x41b3): tx_thread_suspended_previous
    <8c2>   DW_AT_decl_file   : 4
    <8c3>   DW_AT_decl_line   : 415
    <8c5>   DW_AT_decl_column : 26
    <8c6>   DW_AT_type        : <0x990>
    <8ca>   DW_AT_data_member_location: 116
 <2><8cb>: Abbrev Number: 7 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x76b7): tx_thread_suspend_info
    <8d0>   DW_AT_decl_file   : 4
    <8d1>   DW_AT_decl_line   : 416
    <8d3>   DW_AT_decl_column : 25
    <8d4>   DW_AT_type        : <0x6c0>
    <8d8>   DW_AT_data_member_location: 120
 <2><8d9>: Abbrev Number: 7 (DW_TAG_member)
    <8da>   DW_AT_name        : (indirect string, offset: 0x7e66): tx_thread_additional_suspend_info
    <8de>   DW_AT_decl_file   : 4
    <8df>   DW_AT_decl_line   : 417
    <8e1>   DW_AT_decl_column : 26
    <8e2>   DW_AT_type        : <0x693>
    <8e6>   DW_AT_data_member_location: 124
 <2><8e7>: Abbrev Number: 7 (DW_TAG_member)
    <8e8>   DW_AT_name        : (indirect string, offset: 0x22be): tx_thread_suspend_option
    <8ec>   DW_AT_decl_file   : 4
    <8ed>   DW_AT_decl_line   : 418
    <8ef>   DW_AT_decl_column : 25
    <8f0>   DW_AT_type        : <0x6b4>
    <8f4>   DW_AT_data_member_location: 128
 <2><8f5>: Abbrev Number: 7 (DW_TAG_member)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x2056): tx_thread_suspend_status
    <8fa>   DW_AT_decl_file   : 4
    <8fb>   DW_AT_decl_line   : 419
    <8fd>   DW_AT_decl_column : 25
    <8fe>   DW_AT_type        : <0x6b4>
    <902>   DW_AT_data_member_location: 132
 <2><903>: Abbrev Number: 7 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0xb47): tx_thread_created_next
    <908>   DW_AT_decl_file   : 4
    <909>   DW_AT_decl_line   : 428
    <90b>   DW_AT_decl_column : 26
    <90c>   DW_AT_type        : <0x990>
    <910>   DW_AT_data_member_location: 136
 <2><911>: Abbrev Number: 7 (DW_TAG_member)
    <912>   DW_AT_name        : (indirect string, offset: 0x38e4): tx_thread_created_previous
    <916>   DW_AT_decl_file   : 4
    <917>   DW_AT_decl_line   : 429
    <919>   DW_AT_decl_column : 26
    <91a>   DW_AT_type        : <0x990>
    <91e>   DW_AT_data_member_location: 140
 <2><91f>: Abbrev Number: 7 (DW_TAG_member)
    <920>   DW_AT_name        : (indirect string, offset: 0x1862): tx_thread_filex_ptr
    <924>   DW_AT_decl_file   : 4
    <925>   DW_AT_decl_line   : 437
    <927>   DW_AT_decl_column : 26
    <928>   DW_AT_type        : <0x693>
    <92c>   DW_AT_data_member_location: 144
 <2><92d>: Abbrev Number: 7 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0x36c8): tx_thread_user_priority
    <932>   DW_AT_decl_file   : 4
    <933>   DW_AT_decl_line   : 443
    <935>   DW_AT_decl_column : 25
    <936>   DW_AT_type        : <0x6b4>
    <93a>   DW_AT_data_member_location: 148
 <2><93b>: Abbrev Number: 7 (DW_TAG_member)
    <93c>   DW_AT_name        : (indirect string, offset: 0xfd): tx_thread_user_preempt_threshold
    <940>   DW_AT_decl_file   : 4
    <941>   DW_AT_decl_line   : 444
    <943>   DW_AT_decl_column : 25
    <944>   DW_AT_type        : <0x6b4>
    <948>   DW_AT_data_member_location: 152
 <2><949>: Abbrev Number: 7 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0x6066): tx_thread_inherit_priority
    <94e>   DW_AT_decl_file   : 4
    <94f>   DW_AT_decl_line   : 445
    <951>   DW_AT_decl_column : 25
    <952>   DW_AT_type        : <0x6b4>
    <956>   DW_AT_data_member_location: 156
 <2><957>: Abbrev Number: 7 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0x1751): tx_thread_owned_mutex_count
    <95c>   DW_AT_decl_file   : 4
    <95d>   DW_AT_decl_line   : 448
    <95f>   DW_AT_decl_column : 25
    <960>   DW_AT_type        : <0x6b4>
    <964>   DW_AT_data_member_location: 160
 <2><965>: Abbrev Number: 7 (DW_TAG_member)
    <966>   DW_AT_name        : (indirect string, offset: 0x53bd): tx_thread_owned_mutex_list
    <96a>   DW_AT_decl_file   : 4
    <96b>   DW_AT_decl_line   : 450
    <96d>   DW_AT_decl_column : 26
    <96e>   DW_AT_type        : <0xa71>
    <972>   DW_AT_data_member_location: 164
 <2><973>: Abbrev Number: 7 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x2443): tx_thread_stack_highest_ptr
    <978>   DW_AT_decl_file   : 4
    <979>   DW_AT_decl_line   : 490
    <97b>   DW_AT_decl_column : 26
    <97c>   DW_AT_type        : <0x693>
    <980>   DW_AT_data_member_location: 168
 <2><981>: Abbrev Number: 7 (DW_TAG_member)
    <982>   DW_AT_name        : (indirect string, offset: 0x14fc): tx_thread_suspension_sequence
    <986>   DW_AT_decl_file   : 4
    <987>   DW_AT_decl_line   : 517
    <989>   DW_AT_decl_column : 25
    <98a>   DW_AT_type        : <0x6c0>
    <98e>   DW_AT_data_member_location: 172
 <2><98f>: Abbrev Number: 0
 <1><990>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <991>   DW_AT_byte_size   : 4
    <992>   DW_AT_type        : <0x76d>
 <1><996>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <997>   DW_AT_prototyped  : 1
    <997>   DW_AT_sibling     : <0x9a6>
 <2><99b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <99c>   DW_AT_type        : <0x990>
 <2><9a0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <9a1>   DW_AT_type        : <0x6c0>
 <2><9a5>: Abbrev Number: 0
 <1><9a6>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <9a7>   DW_AT_byte_size   : 4
    <9a8>   DW_AT_type        : <0x996>
 <1><9ac>: Abbrev Number: 6 (DW_TAG_structure_type)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x1c3d): TX_MUTEX_STRUCT
    <9b1>   DW_AT_byte_size   : 52
    <9b2>   DW_AT_decl_file   : 4
    <9b3>   DW_AT_decl_line   : 773
    <9b5>   DW_AT_decl_column : 16
    <9b6>   DW_AT_sibling     : <0xa71>
 <2><9ba>: Abbrev Number: 7 (DW_TAG_member)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x4aa4): tx_mutex_id
    <9bf>   DW_AT_decl_file   : 4
    <9c0>   DW_AT_decl_line   : 777
    <9c2>   DW_AT_decl_column : 25
    <9c3>   DW_AT_type        : <0x6c0>
    <9c7>   DW_AT_data_member_location: 0
 <2><9c8>: Abbrev Number: 7 (DW_TAG_member)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x71b3): tx_mutex_name
    <9cd>   DW_AT_decl_file   : 4
    <9ce>   DW_AT_decl_line   : 780
    <9d0>   DW_AT_decl_column : 26
    <9d1>   DW_AT_type        : <0x767>
    <9d5>   DW_AT_data_member_location: 4
 <2><9d6>: Abbrev Number: 7 (DW_TAG_member)
    <9d7>   DW_AT_name        : (indirect string, offset: 0xfc9): tx_mutex_ownership_count
    <9db>   DW_AT_decl_file   : 4
    <9dc>   DW_AT_decl_line   : 783
    <9de>   DW_AT_decl_column : 25
    <9df>   DW_AT_type        : <0x6b4>
    <9e3>   DW_AT_data_member_location: 8
 <2><9e4>: Abbrev Number: 7 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x562e): tx_mutex_owner
    <9e9>   DW_AT_decl_file   : 4
    <9ea>   DW_AT_decl_line   : 787
    <9ec>   DW_AT_decl_column : 26
    <9ed>   DW_AT_type        : <0xb62>
    <9f1>   DW_AT_data_member_location: 12
 <2><9f2>: Abbrev Number: 7 (DW_TAG_member)
    <9f3>   DW_AT_name        : (indirect string, offset: 0xa409): tx_mutex_inherit
    <9f7>   DW_AT_decl_file   : 4
    <9f8>   DW_AT_decl_line   : 791
    <9fa>   DW_AT_decl_column : 25
    <9fb>   DW_AT_type        : <0x6b4>
    <9ff>   DW_AT_data_member_location: 16
 <2><a00>: Abbrev Number: 7 (DW_TAG_member)
    <a01>   DW_AT_name        : (indirect string, offset: 0x63ba): tx_mutex_original_priority
    <a05>   DW_AT_decl_file   : 4
    <a06>   DW_AT_decl_line   : 794
    <a08>   DW_AT_decl_column : 25
    <a09>   DW_AT_type        : <0x6b4>
    <a0d>   DW_AT_data_member_location: 20
 <2><a0e>: Abbrev Number: 7 (DW_TAG_member)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x15eb): tx_mutex_suspension_list
    <a13>   DW_AT_decl_file   : 4
    <a14>   DW_AT_decl_line   : 799
    <a16>   DW_AT_decl_column : 26
    <a17>   DW_AT_type        : <0x990>
    <a1b>   DW_AT_data_member_location: 24
 <2><a1c>: Abbrev Number: 7 (DW_TAG_member)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x78a8): tx_mutex_suspended_count
    <a21>   DW_AT_decl_file   : 4
    <a22>   DW_AT_decl_line   : 800
    <a24>   DW_AT_decl_column : 25
    <a25>   DW_AT_type        : <0x6b4>
    <a29>   DW_AT_data_member_location: 28
 <2><a2a>: Abbrev Number: 7 (DW_TAG_member)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x8268): tx_mutex_created_next
    <a2f>   DW_AT_decl_file   : 4
    <a30>   DW_AT_decl_line   : 804
    <a32>   DW_AT_decl_column : 26
    <a33>   DW_AT_type        : <0xa71>
    <a37>   DW_AT_data_member_location: 32
 <2><a38>: Abbrev Number: 7 (DW_TAG_member)
    <a39>   DW_AT_name        : (indirect string, offset: 0x7ba): tx_mutex_created_previous
    <a3d>   DW_AT_decl_file   : 4
    <a3e>   DW_AT_decl_line   : 805
    <a40>   DW_AT_decl_column : 26
    <a41>   DW_AT_type        : <0xa71>
    <a45>   DW_AT_data_member_location: 36
 <2><a46>: Abbrev Number: 7 (DW_TAG_member)
    <a47>   DW_AT_name        : (indirect string, offset: 0x21e7): tx_mutex_highest_priority_waiting
    <a4b>   DW_AT_decl_file   : 4
    <a4c>   DW_AT_decl_line   : 809
    <a4e>   DW_AT_decl_column : 25
    <a4f>   DW_AT_type        : <0x6b4>
    <a53>   DW_AT_data_member_location: 40
 <2><a54>: Abbrev Number: 7 (DW_TAG_member)
    <a55>   DW_AT_name        : (indirect string, offset: 0x942e): tx_mutex_owned_next
    <a59>   DW_AT_decl_file   : 4
    <a5a>   DW_AT_decl_line   : 813
    <a5c>   DW_AT_decl_column : 26
    <a5d>   DW_AT_type        : <0xa71>
    <a61>   DW_AT_data_member_location: 44
 <2><a62>: Abbrev Number: 7 (DW_TAG_member)
    <a63>   DW_AT_name        : (indirect string, offset: 0xa22b): tx_mutex_owned_previous
    <a67>   DW_AT_decl_file   : 4
    <a68>   DW_AT_decl_line   : 814
    <a6a>   DW_AT_decl_column : 26
    <a6b>   DW_AT_type        : <0xa71>
    <a6f>   DW_AT_data_member_location: 48
 <2><a70>: Abbrev Number: 0
 <1><a71>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <a72>   DW_AT_byte_size   : 4
    <a73>   DW_AT_type        : <0x9ac>
 <1><a77>: Abbrev Number: 11 (DW_TAG_typedef)
    <a78>   DW_AT_name        : (indirect string, offset: 0x6dfd): TX_THREAD
    <a7c>   DW_AT_decl_file   : 4
    <a7d>   DW_AT_decl_line   : 525
    <a7f>   DW_AT_decl_column : 3
    <a80>   DW_AT_type        : <0x76d>
 <1><a84>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <a85>   DW_AT_byte_size   : 4
    <a86>   DW_AT_type        : <0x6a8>
 <1><a8a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x4857): TX_BYTE_POOL_STRUCT
    <a8f>   DW_AT_byte_size   : 52
    <a90>   DW_AT_decl_file   : 4
    <a91>   DW_AT_decl_line   : 608
    <a93>   DW_AT_decl_column : 16
    <a94>   DW_AT_sibling     : <0xb4f>
 <2><a98>: Abbrev Number: 7 (DW_TAG_member)
    <a99>   DW_AT_name        : (indirect string, offset: 0x1741): tx_byte_pool_id
    <a9d>   DW_AT_decl_file   : 4
    <a9e>   DW_AT_decl_line   : 612
    <aa0>   DW_AT_decl_column : 25
    <aa1>   DW_AT_type        : <0x6c0>
    <aa5>   DW_AT_data_member_location: 0
 <2><aa6>: Abbrev Number: 7 (DW_TAG_member)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x6421): tx_byte_pool_name
    <aab>   DW_AT_decl_file   : 4
    <aac>   DW_AT_decl_line   : 615
    <aae>   DW_AT_decl_column : 26
    <aaf>   DW_AT_type        : <0x767>
    <ab3>   DW_AT_data_member_location: 4
 <2><ab4>: Abbrev Number: 7 (DW_TAG_member)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x7d4): tx_byte_pool_available
    <ab9>   DW_AT_decl_file   : 4
    <aba>   DW_AT_decl_line   : 618
    <abc>   DW_AT_decl_column : 25
    <abd>   DW_AT_type        : <0x6c0>
    <ac1>   DW_AT_data_member_location: 8
 <2><ac2>: Abbrev Number: 7 (DW_TAG_member)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x7cf3): tx_byte_pool_fragments
    <ac7>   DW_AT_decl_file   : 4
    <ac8>   DW_AT_decl_line   : 621
    <aca>   DW_AT_decl_column : 25
    <acb>   DW_AT_type        : <0x6b4>
    <acf>   DW_AT_data_member_location: 12
 <2><ad0>: Abbrev Number: 7 (DW_TAG_member)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x4204): tx_byte_pool_list
    <ad5>   DW_AT_decl_file   : 4
    <ad6>   DW_AT_decl_line   : 624
    <ad8>   DW_AT_decl_column : 26
    <ad9>   DW_AT_type        : <0xa84>
    <add>   DW_AT_data_member_location: 16
 <2><ade>: Abbrev Number: 7 (DW_TAG_member)
    <adf>   DW_AT_name        : (indirect string, offset: 0x6d13): tx_byte_pool_search
    <ae3>   DW_AT_decl_file   : 4
    <ae4>   DW_AT_decl_line   : 628
    <ae6>   DW_AT_decl_column : 26
    <ae7>   DW_AT_type        : <0xa84>
    <aeb>   DW_AT_data_member_location: 20
 <2><aec>: Abbrev Number: 7 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0x7ce0): tx_byte_pool_start
    <af1>   DW_AT_decl_file   : 4
    <af2>   DW_AT_decl_line   : 631
    <af4>   DW_AT_decl_column : 26
    <af5>   DW_AT_type        : <0xa84>
    <af9>   DW_AT_data_member_location: 24
 <2><afa>: Abbrev Number: 7 (DW_TAG_member)
    <afb>   DW_AT_name        : (indirect string, offset: 0x15d9): tx_byte_pool_size
    <aff>   DW_AT_decl_file   : 4
    <b00>   DW_AT_decl_line   : 634
    <b02>   DW_AT_decl_column : 25
    <b03>   DW_AT_type        : <0x6c0>
    <b07>   DW_AT_data_member_location: 28
 <2><b08>: Abbrev Number: 7 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0x41a0): tx_byte_pool_owner
    <b0d>   DW_AT_decl_file   : 4
    <b0e>   DW_AT_decl_line   : 640
    <b10>   DW_AT_decl_column : 26
    <b11>   DW_AT_type        : <0x990>
    <b15>   DW_AT_data_member_location: 32
 <2><b16>: Abbrev Number: 7 (DW_TAG_member)
    <b17>   DW_AT_name        : (indirect string, offset: 0x9183): tx_byte_pool_suspension_list
    <b1b>   DW_AT_decl_file   : 4
    <b1c>   DW_AT_decl_line   : 645
    <b1e>   DW_AT_decl_column : 26
    <b1f>   DW_AT_type        : <0x990>
    <b23>   DW_AT_data_member_location: 36
 <2><b24>: Abbrev Number: 7 (DW_TAG_member)
    <b25>   DW_AT_name        : (indirect string, offset: 0x7797): tx_byte_pool_suspended_count
    <b29>   DW_AT_decl_file   : 4
    <b2a>   DW_AT_decl_line   : 646
    <b2c>   DW_AT_decl_column : 25
    <b2d>   DW_AT_type        : <0x6b4>
    <b31>   DW_AT_data_member_location: 40
 <2><b32>: Abbrev Number: 7 (DW_TAG_member)
    <b33>   DW_AT_name        : (indirect string, offset: 0x66c): tx_byte_pool_created_next
    <b37>   DW_AT_decl_file   : 4
    <b38>   DW_AT_decl_line   : 650
    <b3a>   DW_AT_decl_column : 26
    <b3b>   DW_AT_type        : <0xb4f>
    <b3f>   DW_AT_data_member_location: 44
 <2><b40>: Abbrev Number: 7 (DW_TAG_member)
    <b41>   DW_AT_name        : (indirect string, offset: 0x7d0a): tx_byte_pool_created_previous
    <b45>   DW_AT_decl_file   : 4
    <b46>   DW_AT_decl_line   : 651
    <b48>   DW_AT_decl_column : 26
    <b49>   DW_AT_type        : <0xb4f>
    <b4d>   DW_AT_data_member_location: 48
 <2><b4e>: Abbrev Number: 0
 <1><b4f>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <b50>   DW_AT_byte_size   : 4
    <b51>   DW_AT_type        : <0xa8a>
 <1><b55>: Abbrev Number: 11 (DW_TAG_typedef)
    <b56>   DW_AT_name        : (indirect string, offset: 0x30): TX_BYTE_POOL
    <b5a>   DW_AT_decl_file   : 4
    <b5b>   DW_AT_decl_line   : 682
    <b5d>   DW_AT_decl_column : 3
    <b5e>   DW_AT_type        : <0xa8a>
 <1><b62>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <b63>   DW_AT_byte_size   : 4
    <b64>   DW_AT_type        : <0xa77>
 <1><b68>: Abbrev Number: 4 (DW_TAG_typedef)
    <b69>   DW_AT_name        : (indirect string, offset: 0x46175): uint8_t
    <b6d>   DW_AT_decl_file   : 5
    <b6e>   DW_AT_decl_line   : 24
    <b6f>   DW_AT_decl_column : 19
    <b70>   DW_AT_type        : <0x645>
 <1><b74>: Abbrev Number: 4 (DW_TAG_typedef)
    <b75>   DW_AT_name        : (indirect string, offset: 0xb5aae): uint16_t
    <b79>   DW_AT_decl_file   : 5
    <b7a>   DW_AT_decl_line   : 36
    <b7b>   DW_AT_decl_column : 20
    <b7c>   DW_AT_type        : <0x65f>
 <1><b80>: Abbrev Number: 4 (DW_TAG_typedef)
    <b81>   DW_AT_name        : (indirect string, offset: 0x90596): uint32_t
    <b85>   DW_AT_decl_file   : 5
    <b86>   DW_AT_decl_line   : 48
    <b87>   DW_AT_decl_column : 20
    <b88>   DW_AT_type        : <0x679>
 <1><b8c>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <b8d>   DW_AT_type        : <0xb80>
 <1><b91>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b92>   DW_AT_byte_size   : 44
    <b93>   DW_AT_decl_file   : 6
    <b94>   DW_AT_decl_line   : 494
    <b96>   DW_AT_decl_column : 9
    <b97>   DW_AT_sibling     : <0xc28>
 <2><b9b>: Abbrev Number: 7 (DW_TAG_member)
    <b9c>   DW_AT_name        : (indirect string, offset: 0xc30a): MODER
    <ba0>   DW_AT_decl_file   : 6
    <ba1>   DW_AT_decl_line   : 496
    <ba3>   DW_AT_decl_column : 17
    <ba4>   DW_AT_type        : <0xb8c>
    <ba8>   DW_AT_data_member_location: 0
 <2><ba9>: Abbrev Number: 7 (DW_TAG_member)
    <baa>   DW_AT_name        : (indirect string, offset: 0xacc6b): OTYPER
    <bae>   DW_AT_decl_file   : 6
    <baf>   DW_AT_decl_line   : 497
    <bb1>   DW_AT_decl_column : 17
    <bb2>   DW_AT_type        : <0xb8c>
    <bb6>   DW_AT_data_member_location: 4
 <2><bb7>: Abbrev Number: 7 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0xc0962): OSPEEDR
    <bbc>   DW_AT_decl_file   : 6
    <bbd>   DW_AT_decl_line   : 498
    <bbf>   DW_AT_decl_column : 17
    <bc0>   DW_AT_type        : <0xb8c>
    <bc4>   DW_AT_data_member_location: 8
 <2><bc5>: Abbrev Number: 7 (DW_TAG_member)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x9283b): PUPDR
    <bca>   DW_AT_decl_file   : 6
    <bcb>   DW_AT_decl_line   : 499
    <bcd>   DW_AT_decl_column : 17
    <bce>   DW_AT_type        : <0xb8c>
    <bd2>   DW_AT_data_member_location: 12
 <2><bd3>: Abbrev Number: 14 (DW_TAG_member)
    <bd4>   DW_AT_name        : IDR
    <bd8>   DW_AT_decl_file   : 6
    <bd9>   DW_AT_decl_line   : 500
    <bdb>   DW_AT_decl_column : 17
    <bdc>   DW_AT_type        : <0xb8c>
    <be0>   DW_AT_data_member_location: 16
 <2><be1>: Abbrev Number: 14 (DW_TAG_member)
    <be2>   DW_AT_name        : ODR
    <be6>   DW_AT_decl_file   : 6
    <be7>   DW_AT_decl_line   : 501
    <be9>   DW_AT_decl_column : 17
    <bea>   DW_AT_type        : <0xb8c>
    <bee>   DW_AT_data_member_location: 20
 <2><bef>: Abbrev Number: 7 (DW_TAG_member)
    <bf0>   DW_AT_name        : (indirect string, offset: 0x38a38): BSRR
    <bf4>   DW_AT_decl_file   : 6
    <bf5>   DW_AT_decl_line   : 502
    <bf7>   DW_AT_decl_column : 17
    <bf8>   DW_AT_type        : <0xb8c>
    <bfc>   DW_AT_data_member_location: 24
 <2><bfd>: Abbrev Number: 7 (DW_TAG_member)
    <bfe>   DW_AT_name        : (indirect string, offset: 0xbe07d): LCKR
    <c02>   DW_AT_decl_file   : 6
    <c03>   DW_AT_decl_line   : 503
    <c05>   DW_AT_decl_column : 17
    <c06>   DW_AT_type        : <0xb8c>
    <c0a>   DW_AT_data_member_location: 28
 <2><c0b>: Abbrev Number: 14 (DW_TAG_member)
    <c0c>   DW_AT_name        : AFR
    <c10>   DW_AT_decl_file   : 6
    <c11>   DW_AT_decl_line   : 504
    <c13>   DW_AT_decl_column : 17
    <c14>   DW_AT_type        : <0xc38>
    <c18>   DW_AT_data_member_location: 32
 <2><c19>: Abbrev Number: 14 (DW_TAG_member)
    <c1a>   DW_AT_name        : BRR
    <c1e>   DW_AT_decl_file   : 6
    <c1f>   DW_AT_decl_line   : 505
    <c21>   DW_AT_decl_column : 17
    <c22>   DW_AT_type        : <0xb8c>
    <c26>   DW_AT_data_member_location: 40
 <2><c27>: Abbrev Number: 0
 <1><c28>: Abbrev Number: 15 (DW_TAG_array_type)
    <c29>   DW_AT_type        : <0xb8c>
    <c2d>   DW_AT_sibling     : <0xc38>
 <2><c31>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <c32>   DW_AT_type        : <0x622>
    <c36>   DW_AT_upper_bound : 1
 <2><c37>: Abbrev Number: 0
 <1><c38>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <c39>   DW_AT_type        : <0xc28>
 <1><c3d>: Abbrev Number: 11 (DW_TAG_typedef)
    <c3e>   DW_AT_name        : (indirect string, offset: 0xd61fc): GPIO_TypeDef
    <c42>   DW_AT_decl_file   : 6
    <c43>   DW_AT_decl_line   : 507
    <c45>   DW_AT_decl_column : 3
    <c46>   DW_AT_type        : <0xb91>
 <1><c4a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c4b>   DW_AT_byte_size   : 208
    <c4c>   DW_AT_decl_file   : 6
    <c4d>   DW_AT_decl_line   : 681
    <c4f>   DW_AT_decl_column : 9
    <c50>   DW_AT_sibling     : <0xf29>
 <2><c54>: Abbrev Number: 14 (DW_TAG_member)
    <c55>   DW_AT_name        : TR
    <c58>   DW_AT_decl_file   : 6
    <c59>   DW_AT_decl_line   : 683
    <c5b>   DW_AT_decl_column : 17
    <c5c>   DW_AT_type        : <0xb8c>
    <c60>   DW_AT_data_member_location: 0
 <2><c61>: Abbrev Number: 14 (DW_TAG_member)
    <c62>   DW_AT_name        : DR
    <c65>   DW_AT_decl_file   : 6
    <c66>   DW_AT_decl_line   : 684
    <c68>   DW_AT_decl_column : 17
    <c69>   DW_AT_type        : <0xb8c>
    <c6d>   DW_AT_data_member_location: 4
 <2><c6e>: Abbrev Number: 14 (DW_TAG_member)
    <c6f>   DW_AT_name        : CR
    <c72>   DW_AT_decl_file   : 6
    <c73>   DW_AT_decl_line   : 685
    <c75>   DW_AT_decl_column : 17
    <c76>   DW_AT_type        : <0xb8c>
    <c7a>   DW_AT_data_member_location: 8
 <2><c7b>: Abbrev Number: 14 (DW_TAG_member)
    <c7c>   DW_AT_name        : ISR
    <c80>   DW_AT_decl_file   : 6
    <c81>   DW_AT_decl_line   : 686
    <c83>   DW_AT_decl_column : 17
    <c84>   DW_AT_type        : <0xb8c>
    <c88>   DW_AT_data_member_location: 12
 <2><c89>: Abbrev Number: 7 (DW_TAG_member)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x909c8): PRER
    <c8e>   DW_AT_decl_file   : 6
    <c8f>   DW_AT_decl_line   : 687
    <c91>   DW_AT_decl_column : 17
    <c92>   DW_AT_type        : <0xb8c>
    <c96>   DW_AT_data_member_location: 16
 <2><c97>: Abbrev Number: 7 (DW_TAG_member)
    <c98>   DW_AT_name        : (indirect string, offset: 0x1c80e): WUTR
    <c9c>   DW_AT_decl_file   : 6
    <c9d>   DW_AT_decl_line   : 688
    <c9f>   DW_AT_decl_column : 17
    <ca0>   DW_AT_type        : <0xb8c>
    <ca4>   DW_AT_data_member_location: 20
 <2><ca5>: Abbrev Number: 7 (DW_TAG_member)
    <ca6>   DW_AT_name        : (indirect string, offset: 0xc64fc): reserved
    <caa>   DW_AT_decl_file   : 6
    <cab>   DW_AT_decl_line   : 689
    <cad>   DW_AT_decl_column : 17
    <cae>   DW_AT_type        : <0xb80>
    <cb2>   DW_AT_data_member_location: 24
 <2><cb3>: Abbrev Number: 7 (DW_TAG_member)
    <cb4>   DW_AT_name        : (indirect string, offset: 0x5a381): ALRMAR
    <cb8>   DW_AT_decl_file   : 6
    <cb9>   DW_AT_decl_line   : 690
    <cbb>   DW_AT_decl_column : 17
    <cbc>   DW_AT_type        : <0xb8c>
    <cc0>   DW_AT_data_member_location: 28
 <2><cc1>: Abbrev Number: 7 (DW_TAG_member)
    <cc2>   DW_AT_name        : (indirect string, offset: 0x5aa7a): ALRMBR
    <cc6>   DW_AT_decl_file   : 6
    <cc7>   DW_AT_decl_line   : 691
    <cc9>   DW_AT_decl_column : 17
    <cca>   DW_AT_type        : <0xb8c>
    <cce>   DW_AT_data_member_location: 32
 <2><ccf>: Abbrev Number: 14 (DW_TAG_member)
    <cd0>   DW_AT_name        : WPR
    <cd4>   DW_AT_decl_file   : 6
    <cd5>   DW_AT_decl_line   : 692
    <cd7>   DW_AT_decl_column : 17
    <cd8>   DW_AT_type        : <0xb8c>
    <cdc>   DW_AT_data_member_location: 36
 <2><cdd>: Abbrev Number: 14 (DW_TAG_member)
    <cde>   DW_AT_name        : SSR
    <ce2>   DW_AT_decl_file   : 6
    <ce3>   DW_AT_decl_line   : 693
    <ce5>   DW_AT_decl_column : 17
    <ce6>   DW_AT_type        : <0xb8c>
    <cea>   DW_AT_data_member_location: 40
 <2><ceb>: Abbrev Number: 7 (DW_TAG_member)
    <cec>   DW_AT_name        : (indirect string, offset: 0x6138d): SHIFTR
    <cf0>   DW_AT_decl_file   : 6
    <cf1>   DW_AT_decl_line   : 694
    <cf3>   DW_AT_decl_column : 17
    <cf4>   DW_AT_type        : <0xb8c>
    <cf8>   DW_AT_data_member_location: 44
 <2><cf9>: Abbrev Number: 7 (DW_TAG_member)
    <cfa>   DW_AT_name        : (indirect string, offset: 0x7bdf3): TSTR
    <cfe>   DW_AT_decl_file   : 6
    <cff>   DW_AT_decl_line   : 695
    <d01>   DW_AT_decl_column : 17
    <d02>   DW_AT_type        : <0xb8c>
    <d06>   DW_AT_data_member_location: 48
 <2><d07>: Abbrev Number: 7 (DW_TAG_member)
    <d08>   DW_AT_name        : (indirect string, offset: 0x756f8): TSDR
    <d0c>   DW_AT_decl_file   : 6
    <d0d>   DW_AT_decl_line   : 696
    <d0f>   DW_AT_decl_column : 17
    <d10>   DW_AT_type        : <0xb8c>
    <d14>   DW_AT_data_member_location: 52
 <2><d15>: Abbrev Number: 7 (DW_TAG_member)
    <d16>   DW_AT_name        : (indirect string, offset: 0x12c10): TSSSR
    <d1a>   DW_AT_decl_file   : 6
    <d1b>   DW_AT_decl_line   : 697
    <d1d>   DW_AT_decl_column : 17
    <d1e>   DW_AT_type        : <0xb8c>
    <d22>   DW_AT_data_member_location: 56
 <2><d23>: Abbrev Number: 7 (DW_TAG_member)
    <d24>   DW_AT_name        : (indirect string, offset: 0xcddbf): CALR
    <d28>   DW_AT_decl_file   : 6
    <d29>   DW_AT_decl_line   : 698
    <d2b>   DW_AT_decl_column : 17
    <d2c>   DW_AT_type        : <0xb8c>
    <d30>   DW_AT_data_member_location: 60
 <2><d31>: Abbrev Number: 7 (DW_TAG_member)
    <d32>   DW_AT_name        : (indirect string, offset: 0x9cff5): TAMPCR
    <d36>   DW_AT_decl_file   : 6
    <d37>   DW_AT_decl_line   : 699
    <d39>   DW_AT_decl_column : 17
    <d3a>   DW_AT_type        : <0xb8c>
    <d3e>   DW_AT_data_member_location: 64
 <2><d3f>: Abbrev Number: 7 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0x47375): ALRMASSR
    <d44>   DW_AT_decl_file   : 6
    <d45>   DW_AT_decl_line   : 700
    <d47>   DW_AT_decl_column : 17
    <d48>   DW_AT_type        : <0xb8c>
    <d4c>   DW_AT_data_member_location: 68
 <2><d4d>: Abbrev Number: 7 (DW_TAG_member)
    <d4e>   DW_AT_name        : (indirect string, offset: 0x84e96): ALRMBSSR
    <d52>   DW_AT_decl_file   : 6
    <d53>   DW_AT_decl_line   : 701
    <d55>   DW_AT_decl_column : 17
    <d56>   DW_AT_type        : <0xb8c>
    <d5a>   DW_AT_data_member_location: 72
 <2><d5b>: Abbrev Number: 14 (DW_TAG_member)
    <d5c>   DW_AT_name        : OR
    <d5f>   DW_AT_decl_file   : 6
    <d60>   DW_AT_decl_line   : 702
    <d62>   DW_AT_decl_column : 17
    <d63>   DW_AT_type        : <0xb8c>
    <d67>   DW_AT_data_member_location: 76
 <2><d68>: Abbrev Number: 7 (DW_TAG_member)
    <d69>   DW_AT_name        : (indirect string, offset: 0x52d2e): BKP0R
    <d6d>   DW_AT_decl_file   : 6
    <d6e>   DW_AT_decl_line   : 703
    <d70>   DW_AT_decl_column : 17
    <d71>   DW_AT_type        : <0xb8c>
    <d75>   DW_AT_data_member_location: 80
 <2><d76>: Abbrev Number: 7 (DW_TAG_member)
    <d77>   DW_AT_name        : (indirect string, offset: 0x532a1): BKP1R
    <d7b>   DW_AT_decl_file   : 6
    <d7c>   DW_AT_decl_line   : 704
    <d7e>   DW_AT_decl_column : 17
    <d7f>   DW_AT_type        : <0xb8c>
    <d83>   DW_AT_data_member_location: 84
 <2><d84>: Abbrev Number: 7 (DW_TAG_member)
    <d85>   DW_AT_name        : (indirect string, offset: 0xce194): BKP2R
    <d89>   DW_AT_decl_file   : 6
    <d8a>   DW_AT_decl_line   : 705
    <d8c>   DW_AT_decl_column : 17
    <d8d>   DW_AT_type        : <0xb8c>
    <d91>   DW_AT_data_member_location: 88
 <2><d92>: Abbrev Number: 7 (DW_TAG_member)
    <d93>   DW_AT_name        : (indirect string, offset: 0x53ebd): BKP3R
    <d97>   DW_AT_decl_file   : 6
    <d98>   DW_AT_decl_line   : 706
    <d9a>   DW_AT_decl_column : 17
    <d9b>   DW_AT_type        : <0xb8c>
    <d9f>   DW_AT_data_member_location: 92
 <2><da0>: Abbrev Number: 7 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0xcfe4b): BKP4R
    <da5>   DW_AT_decl_file   : 6
    <da6>   DW_AT_decl_line   : 707
    <da8>   DW_AT_decl_column : 17
    <da9>   DW_AT_type        : <0xb8c>
    <dad>   DW_AT_data_member_location: 96
 <2><dae>: Abbrev Number: 7 (DW_TAG_member)
    <daf>   DW_AT_name        : (indirect string, offset: 0xd0e6a): BKP5R
    <db3>   DW_AT_decl_file   : 6
    <db4>   DW_AT_decl_line   : 708
    <db6>   DW_AT_decl_column : 17
    <db7>   DW_AT_type        : <0xb8c>
    <dbb>   DW_AT_data_member_location: 100
 <2><dbc>: Abbrev Number: 7 (DW_TAG_member)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x55650): BKP6R
    <dc1>   DW_AT_decl_file   : 6
    <dc2>   DW_AT_decl_line   : 709
    <dc4>   DW_AT_decl_column : 17
    <dc5>   DW_AT_type        : <0xb8c>
    <dc9>   DW_AT_data_member_location: 104
 <2><dca>: Abbrev Number: 7 (DW_TAG_member)
    <dcb>   DW_AT_name        : (indirect string, offset: 0x55ccd): BKP7R
    <dcf>   DW_AT_decl_file   : 6
    <dd0>   DW_AT_decl_line   : 710
    <dd2>   DW_AT_decl_column : 17
    <dd3>   DW_AT_type        : <0xb8c>
    <dd7>   DW_AT_data_member_location: 108
 <2><dd8>: Abbrev Number: 7 (DW_TAG_member)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x56664): BKP8R
    <ddd>   DW_AT_decl_file   : 6
    <dde>   DW_AT_decl_line   : 711
    <de0>   DW_AT_decl_column : 17
    <de1>   DW_AT_type        : <0xb8c>
    <de5>   DW_AT_data_member_location: 112
 <2><de6>: Abbrev Number: 7 (DW_TAG_member)
    <de7>   DW_AT_name        : (indirect string, offset: 0x56f8e): BKP9R
    <deb>   DW_AT_decl_file   : 6
    <dec>   DW_AT_decl_line   : 712
    <dee>   DW_AT_decl_column : 17
    <def>   DW_AT_type        : <0xb8c>
    <df3>   DW_AT_data_member_location: 116
 <2><df4>: Abbrev Number: 7 (DW_TAG_member)
    <df5>   DW_AT_name        : (indirect string, offset: 0xb71ee): BKP10R
    <df9>   DW_AT_decl_file   : 6
    <dfa>   DW_AT_decl_line   : 713
    <dfc>   DW_AT_decl_column : 17
    <dfd>   DW_AT_type        : <0xb8c>
    <e01>   DW_AT_data_member_location: 120
 <2><e02>: Abbrev Number: 7 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0x3a7c7): BKP11R
    <e07>   DW_AT_decl_file   : 6
    <e08>   DW_AT_decl_line   : 714
    <e0a>   DW_AT_decl_column : 17
    <e0b>   DW_AT_type        : <0xb8c>
    <e0f>   DW_AT_data_member_location: 124
 <2><e10>: Abbrev Number: 7 (DW_TAG_member)
    <e11>   DW_AT_name        : (indirect string, offset: 0xb8ba3): BKP12R
    <e15>   DW_AT_decl_file   : 6
    <e16>   DW_AT_decl_line   : 715
    <e18>   DW_AT_decl_column : 17
    <e19>   DW_AT_type        : <0xb8c>
    <e1d>   DW_AT_data_member_location: 128
 <2><e1e>: Abbrev Number: 7 (DW_TAG_member)
    <e1f>   DW_AT_name        : (indirect string, offset: 0x3b517): BKP13R
    <e23>   DW_AT_decl_file   : 6
    <e24>   DW_AT_decl_line   : 716
    <e26>   DW_AT_decl_column : 17
    <e27>   DW_AT_type        : <0xb8c>
    <e2b>   DW_AT_data_member_location: 132
 <2><e2c>: Abbrev Number: 7 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0x12abf): BKP14R
    <e31>   DW_AT_decl_file   : 6
    <e32>   DW_AT_decl_line   : 717
    <e34>   DW_AT_decl_column : 17
    <e35>   DW_AT_type        : <0xb8c>
    <e39>   DW_AT_data_member_location: 136
 <2><e3a>: Abbrev Number: 7 (DW_TAG_member)
    <e3b>   DW_AT_name        : (indirect string, offset: 0xbb39f): BKP15R
    <e3f>   DW_AT_decl_file   : 6
    <e40>   DW_AT_decl_line   : 718
    <e42>   DW_AT_decl_column : 17
    <e43>   DW_AT_type        : <0xb8c>
    <e47>   DW_AT_data_member_location: 140
 <2><e48>: Abbrev Number: 7 (DW_TAG_member)
    <e49>   DW_AT_name        : (indirect string, offset: 0xbc18b): BKP16R
    <e4d>   DW_AT_decl_file   : 6
    <e4e>   DW_AT_decl_line   : 719
    <e50>   DW_AT_decl_column : 17
    <e51>   DW_AT_type        : <0xb8c>
    <e55>   DW_AT_data_member_location: 144
 <2><e56>: Abbrev Number: 7 (DW_TAG_member)
    <e57>   DW_AT_name        : (indirect string, offset: 0x3d00a): BKP17R
    <e5b>   DW_AT_decl_file   : 6
    <e5c>   DW_AT_decl_line   : 720
    <e5e>   DW_AT_decl_column : 17
    <e5f>   DW_AT_type        : <0xb8c>
    <e63>   DW_AT_data_member_location: 148
 <2><e64>: Abbrev Number: 7 (DW_TAG_member)
    <e65>   DW_AT_name        : (indirect string, offset: 0x3d5ad): BKP18R
    <e69>   DW_AT_decl_file   : 6
    <e6a>   DW_AT_decl_line   : 721
    <e6c>   DW_AT_decl_column : 17
    <e6d>   DW_AT_type        : <0xb8c>
    <e71>   DW_AT_data_member_location: 152
 <2><e72>: Abbrev Number: 7 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0x3dc4c): BKP19R
    <e77>   DW_AT_decl_file   : 6
    <e78>   DW_AT_decl_line   : 722
    <e7a>   DW_AT_decl_column : 17
    <e7b>   DW_AT_type        : <0xb8c>
    <e7f>   DW_AT_data_member_location: 156
 <2><e80>: Abbrev Number: 7 (DW_TAG_member)
    <e81>   DW_AT_name        : (indirect string, offset: 0x56fdf): BKP20R
    <e85>   DW_AT_decl_file   : 6
    <e86>   DW_AT_decl_line   : 723
    <e88>   DW_AT_decl_column : 17
    <e89>   DW_AT_type        : <0xb8c>
    <e8d>   DW_AT_data_member_location: 160
 <2><e8e>: Abbrev Number: 7 (DW_TAG_member)
    <e8f>   DW_AT_name        : (indirect string, offset: 0x57708): BKP21R
    <e93>   DW_AT_decl_file   : 6
    <e94>   DW_AT_decl_line   : 724
    <e96>   DW_AT_decl_column : 17
    <e97>   DW_AT_type        : <0xb8c>
    <e9b>   DW_AT_data_member_location: 164
 <2><e9c>: Abbrev Number: 7 (DW_TAG_member)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x57dca): BKP22R
    <ea1>   DW_AT_decl_file   : 6
    <ea2>   DW_AT_decl_line   : 725
    <ea4>   DW_AT_decl_column : 17
    <ea5>   DW_AT_type        : <0xb8c>
    <ea9>   DW_AT_data_member_location: 168
 <2><eaa>: Abbrev Number: 7 (DW_TAG_member)
    <eab>   DW_AT_name        : (indirect string, offset: 0x58516): BKP23R
    <eaf>   DW_AT_decl_file   : 6
    <eb0>   DW_AT_decl_line   : 726
    <eb2>   DW_AT_decl_column : 17
    <eb3>   DW_AT_type        : <0xb8c>
    <eb7>   DW_AT_data_member_location: 172
 <2><eb8>: Abbrev Number: 7 (DW_TAG_member)
    <eb9>   DW_AT_name        : (indirect string, offset: 0x58bcc): BKP24R
    <ebd>   DW_AT_decl_file   : 6
    <ebe>   DW_AT_decl_line   : 727
    <ec0>   DW_AT_decl_column : 17
    <ec1>   DW_AT_type        : <0xb8c>
    <ec5>   DW_AT_data_member_location: 176
 <2><ec6>: Abbrev Number: 7 (DW_TAG_member)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x591c3): BKP25R
    <ecb>   DW_AT_decl_file   : 6
    <ecc>   DW_AT_decl_line   : 728
    <ece>   DW_AT_decl_column : 17
    <ecf>   DW_AT_type        : <0xb8c>
    <ed3>   DW_AT_data_member_location: 180
 <2><ed4>: Abbrev Number: 7 (DW_TAG_member)
    <ed5>   DW_AT_name        : (indirect string, offset: 0x59af1): BKP26R
    <ed9>   DW_AT_decl_file   : 6
    <eda>   DW_AT_decl_line   : 729
    <edc>   DW_AT_decl_column : 17
    <edd>   DW_AT_type        : <0xb8c>
    <ee1>   DW_AT_data_member_location: 184
 <2><ee2>: Abbrev Number: 7 (DW_TAG_member)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x5a209): BKP27R
    <ee7>   DW_AT_decl_file   : 6
    <ee8>   DW_AT_decl_line   : 730
    <eea>   DW_AT_decl_column : 17
    <eeb>   DW_AT_type        : <0xb8c>
    <eef>   DW_AT_data_member_location: 188
 <2><ef0>: Abbrev Number: 7 (DW_TAG_member)
    <ef1>   DW_AT_name        : (indirect string, offset: 0x5a8c9): BKP28R
    <ef5>   DW_AT_decl_file   : 6
    <ef6>   DW_AT_decl_line   : 731
    <ef8>   DW_AT_decl_column : 17
    <ef9>   DW_AT_type        : <0xb8c>
    <efd>   DW_AT_data_member_location: 192
 <2><efe>: Abbrev Number: 7 (DW_TAG_member)
    <eff>   DW_AT_name        : (indirect string, offset: 0x5b033): BKP29R
    <f03>   DW_AT_decl_file   : 6
    <f04>   DW_AT_decl_line   : 732
    <f06>   DW_AT_decl_column : 17
    <f07>   DW_AT_type        : <0xb8c>
    <f0b>   DW_AT_data_member_location: 196
 <2><f0c>: Abbrev Number: 7 (DW_TAG_member)
    <f0d>   DW_AT_name        : (indirect string, offset: 0x5770f): BKP30R
    <f11>   DW_AT_decl_file   : 6
    <f12>   DW_AT_decl_line   : 733
    <f14>   DW_AT_decl_column : 17
    <f15>   DW_AT_type        : <0xb8c>
    <f19>   DW_AT_data_member_location: 200
 <2><f1a>: Abbrev Number: 7 (DW_TAG_member)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x75c7f): BKP31R
    <f1f>   DW_AT_decl_file   : 6
    <f20>   DW_AT_decl_line   : 734
    <f22>   DW_AT_decl_column : 17
    <f23>   DW_AT_type        : <0xb8c>
    <f27>   DW_AT_data_member_location: 204
 <2><f28>: Abbrev Number: 0
 <1><f29>: Abbrev Number: 11 (DW_TAG_typedef)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x1580a): RTC_TypeDef
    <f2e>   DW_AT_decl_file   : 6
    <f2f>   DW_AT_decl_line   : 735
    <f31>   DW_AT_decl_column : 3
    <f32>   DW_AT_type        : <0xc4a>
 <1><f36>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <f37>   DW_AT_encoding    : 7	(unsigned)
    <f38>   DW_AT_byte_size   : 1
    <f39>   DW_AT_type        : <0x651>
    <f3d>   DW_AT_decl_file   : 7
    <f3e>   DW_AT_decl_line   : 39
    <f3f>   DW_AT_decl_column : 1
    <f40>   DW_AT_sibling     : <0xf5d>
 <2><f44>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f45>   DW_AT_name        : (indirect string, offset: 0x50380): HAL_OK
    <f49>   DW_AT_const_value : 0
 <2><f4a>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f4b>   DW_AT_name        : (indirect string, offset: 0x8db50): HAL_ERROR
    <f4f>   DW_AT_const_value : 1
 <2><f50>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f51>   DW_AT_name        : (indirect string, offset: 0x2f278): HAL_BUSY
    <f55>   DW_AT_const_value : 2
 <2><f56>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f57>   DW_AT_name        : (indirect string, offset: 0x46773): HAL_TIMEOUT
    <f5b>   DW_AT_const_value : 3
 <2><f5c>: Abbrev Number: 0
 <1><f5d>: Abbrev Number: 4 (DW_TAG_typedef)
    <f5e>   DW_AT_name        : (indirect string, offset: 0xd608): HAL_StatusTypeDef
    <f62>   DW_AT_decl_file   : 7
    <f63>   DW_AT_decl_line   : 44
    <f64>   DW_AT_decl_column : 3
    <f65>   DW_AT_type        : <0xf36>
 <1><f69>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <f6a>   DW_AT_encoding    : 7	(unsigned)
    <f6b>   DW_AT_byte_size   : 1
    <f6c>   DW_AT_type        : <0x651>
    <f70>   DW_AT_decl_file   : 7
    <f71>   DW_AT_decl_line   : 50
    <f72>   DW_AT_decl_column : 1
    <f73>   DW_AT_sibling     : <0xf84>
 <2><f77>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f78>   DW_AT_name        : (indirect string, offset: 0xa52e3): HAL_UNLOCKED
    <f7c>   DW_AT_const_value : 0
 <2><f7d>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f7e>   DW_AT_name        : (indirect string, offset: 0xdbfcc): HAL_LOCKED
    <f82>   DW_AT_const_value : 1
 <2><f83>: Abbrev Number: 0
 <1><f84>: Abbrev Number: 4 (DW_TAG_typedef)
    <f85>   DW_AT_name        : (indirect string, offset: 0x861bc): HAL_LockTypeDef
    <f89>   DW_AT_decl_file   : 7
    <f8a>   DW_AT_decl_line   : 53
    <f8b>   DW_AT_decl_column : 3
    <f8c>   DW_AT_type        : <0xf69>
 <1><f90>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <f91>   DW_AT_encoding    : 7	(unsigned)
    <f92>   DW_AT_byte_size   : 1
    <f93>   DW_AT_type        : <0x651>
    <f97>   DW_AT_decl_file   : 8
    <f98>   DW_AT_decl_line   : 68
    <f99>   DW_AT_decl_column : 1
    <f9a>   DW_AT_sibling     : <0xfab>
 <2><f9e>: Abbrev Number: 18 (DW_TAG_enumerator)
    <f9f>   DW_AT_name        : (indirect string, offset: 0x353e1): GPIO_PIN_RESET
    <fa3>   DW_AT_const_value : 0
 <2><fa4>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x3e2cd): GPIO_PIN_SET
    <fa9>   DW_AT_const_value : 1
 <2><faa>: Abbrev Number: 0
 <1><fab>: Abbrev Number: 4 (DW_TAG_typedef)
    <fac>   DW_AT_name        : (indirect string, offset: 0xd8a0e): GPIO_PinState
    <fb0>   DW_AT_decl_file   : 8
    <fb1>   DW_AT_decl_line   : 71
    <fb2>   DW_AT_decl_column : 3
    <fb3>   DW_AT_type        : <0xf90>
 <1><fb7>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <fb8>   DW_AT_encoding    : 7	(unsigned)
    <fb9>   DW_AT_byte_size   : 1
    <fba>   DW_AT_type        : <0x651>
    <fbe>   DW_AT_decl_file   : 9
    <fbf>   DW_AT_decl_line   : 47
    <fc0>   DW_AT_decl_column : 1
    <fc1>   DW_AT_sibling     : <0xfe4>
 <2><fc5>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xa8be7): HAL_RTC_STATE_RESET
    <fca>   DW_AT_const_value : 0
 <2><fcb>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fcc>   DW_AT_name        : (indirect string, offset: 0x44b79): HAL_RTC_STATE_READY
    <fd0>   DW_AT_const_value : 1
 <2><fd1>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xb37c): HAL_RTC_STATE_BUSY
    <fd6>   DW_AT_const_value : 2
 <2><fd7>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fd8>   DW_AT_name        : (indirect string, offset: 0x7c73c): HAL_RTC_STATE_TIMEOUT
    <fdc>   DW_AT_const_value : 3
 <2><fdd>: Abbrev Number: 18 (DW_TAG_enumerator)
    <fde>   DW_AT_name        : (indirect string, offset: 0x157f6): HAL_RTC_STATE_ERROR
    <fe2>   DW_AT_const_value : 4
 <2><fe3>: Abbrev Number: 0
 <1><fe4>: Abbrev Number: 4 (DW_TAG_typedef)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x799aa): HAL_RTCStateTypeDef
    <fe9>   DW_AT_decl_file   : 9
    <fea>   DW_AT_decl_line   : 54
    <feb>   DW_AT_decl_column : 3
    <fec>   DW_AT_type        : <0xfb7>
 <1><ff0>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ff1>   DW_AT_type        : <0xfe4>
 <1><ff5>: Abbrev Number: 19 (DW_TAG_structure_type)
    <ff6>   DW_AT_byte_size   : 28
    <ff7>   DW_AT_decl_file   : 9
    <ff8>   DW_AT_decl_line   : 59
    <ff9>   DW_AT_decl_column : 9
    <ffa>   DW_AT_sibling     : <0x105a>
 <2><ffe>: Abbrev Number: 20 (DW_TAG_member)
    <fff>   DW_AT_name        : (indirect string, offset: 0x7395e): HourFormat
    <1003>   DW_AT_decl_file   : 9
    <1004>   DW_AT_decl_line   : 61
    <1005>   DW_AT_decl_column : 12
    <1006>   DW_AT_type        : <0xb80>
    <100a>   DW_AT_data_member_location: 0
 <2><100b>: Abbrev Number: 20 (DW_TAG_member)
    <100c>   DW_AT_name        : (indirect string, offset: 0xc1c02): AsynchPrediv
    <1010>   DW_AT_decl_file   : 9
    <1011>   DW_AT_decl_line   : 64
    <1012>   DW_AT_decl_column : 12
    <1013>   DW_AT_type        : <0xb80>
    <1017>   DW_AT_data_member_location: 4
 <2><1018>: Abbrev Number: 20 (DW_TAG_member)
    <1019>   DW_AT_name        : (indirect string, offset: 0xd8192): SynchPrediv
    <101d>   DW_AT_decl_file   : 9
    <101e>   DW_AT_decl_line   : 67
    <101f>   DW_AT_decl_column : 12
    <1020>   DW_AT_type        : <0xb80>
    <1024>   DW_AT_data_member_location: 8
 <2><1025>: Abbrev Number: 20 (DW_TAG_member)
    <1026>   DW_AT_name        : (indirect string, offset: 0xe00a9): OutPut
    <102a>   DW_AT_decl_file   : 9
    <102b>   DW_AT_decl_line   : 70
    <102c>   DW_AT_decl_column : 12
    <102d>   DW_AT_type        : <0xb80>
    <1031>   DW_AT_data_member_location: 12
 <2><1032>: Abbrev Number: 20 (DW_TAG_member)
    <1033>   DW_AT_name        : (indirect string, offset: 0xb4a15): OutPutRemap
    <1037>   DW_AT_decl_file   : 9
    <1038>   DW_AT_decl_line   : 73
    <1039>   DW_AT_decl_column : 12
    <103a>   DW_AT_type        : <0xb80>
    <103e>   DW_AT_data_member_location: 16
 <2><103f>: Abbrev Number: 20 (DW_TAG_member)
    <1040>   DW_AT_name        : (indirect string, offset: 0x94510): OutPutPolarity
    <1044>   DW_AT_decl_file   : 9
    <1045>   DW_AT_decl_line   : 76
    <1046>   DW_AT_decl_column : 12
    <1047>   DW_AT_type        : <0xb80>
    <104b>   DW_AT_data_member_location: 20
 <2><104c>: Abbrev Number: 20 (DW_TAG_member)
    <104d>   DW_AT_name        : (indirect string, offset: 0x7eafa): OutPutType
    <1051>   DW_AT_decl_file   : 9
    <1052>   DW_AT_decl_line   : 79
    <1053>   DW_AT_decl_column : 12
    <1054>   DW_AT_type        : <0xb80>
    <1058>   DW_AT_data_member_location: 24
 <2><1059>: Abbrev Number: 0
 <1><105a>: Abbrev Number: 4 (DW_TAG_typedef)
    <105b>   DW_AT_name        : (indirect string, offset: 0x43958): RTC_InitTypeDef
    <105f>   DW_AT_decl_file   : 9
    <1060>   DW_AT_decl_line   : 93
    <1061>   DW_AT_decl_column : 3
    <1062>   DW_AT_type        : <0xff5>
 <1><1066>: Abbrev Number: 19 (DW_TAG_structure_type)
    <1067>   DW_AT_byte_size   : 36
    <1068>   DW_AT_decl_file   : 9
    <1069>   DW_AT_decl_line   : 200
    <106a>   DW_AT_decl_column : 9
    <106b>   DW_AT_sibling     : <0x10a4>
 <2><106f>: Abbrev Number: 20 (DW_TAG_member)
    <1070>   DW_AT_name        : (indirect string, offset: 0xb582e): Instance
    <1074>   DW_AT_decl_file   : 9
    <1075>   DW_AT_decl_line   : 203
    <1076>   DW_AT_decl_column : 30
    <1077>   DW_AT_type        : <0x10a4>
    <107b>   DW_AT_data_member_location: 0
 <2><107c>: Abbrev Number: 20 (DW_TAG_member)
    <107d>   DW_AT_name        : (indirect string, offset: 0xdfa4b): Init
    <1081>   DW_AT_decl_file   : 9
    <1082>   DW_AT_decl_line   : 208
    <1083>   DW_AT_decl_column : 29
    <1084>   DW_AT_type        : <0x105a>
    <1088>   DW_AT_data_member_location: 4
 <2><1089>: Abbrev Number: 20 (DW_TAG_member)
    <108a>   DW_AT_name        : (indirect string, offset: 0x9fa62): Lock
    <108e>   DW_AT_decl_file   : 9
    <108f>   DW_AT_decl_line   : 210
    <1090>   DW_AT_decl_column : 29
    <1091>   DW_AT_type        : <0xf84>
    <1095>   DW_AT_data_member_location: 32
 <2><1096>: Abbrev Number: 20 (DW_TAG_member)
    <1097>   DW_AT_name        : (indirect string, offset: 0xe1364): State
    <109b>   DW_AT_decl_file   : 9
    <109c>   DW_AT_decl_line   : 212
    <109d>   DW_AT_decl_column : 29
    <109e>   DW_AT_type        : <0xff0>
    <10a2>   DW_AT_data_member_location: 33
 <2><10a3>: Abbrev Number: 0
 <1><10a4>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <10a5>   DW_AT_byte_size   : 4
    <10a6>   DW_AT_type        : <0xf29>
 <1><10aa>: Abbrev Number: 4 (DW_TAG_typedef)
    <10ab>   DW_AT_name        : (indirect string, offset: 0x15552): RTC_HandleTypeDef
    <10af>   DW_AT_decl_file   : 9
    <10b0>   DW_AT_decl_line   : 233
    <10b1>   DW_AT_decl_column : 3
    <10b2>   DW_AT_type        : <0x1066>
 <1><10b6>: Abbrev Number: 21 (DW_TAG_variable)
    <10b7>   DW_AT_name        : (indirect string, offset: 0x7a5c7): hrtc
    <10bb>   DW_AT_decl_file   : 1
    <10bc>   DW_AT_decl_line   : 47
    <10bd>   DW_AT_decl_column : 26
    <10be>   DW_AT_type        : <0x10aa>
    <10c2>   DW_AT_external    : 1
    <10c2>   DW_AT_declaration : 1
 <1><10c2>: Abbrev Number: 15 (DW_TAG_array_type)
    <10c3>   DW_AT_type        : <0xb68>
    <10c7>   DW_AT_sibling     : <0x10d3>
 <2><10cb>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <10cc>   DW_AT_type        : <0x622>
    <10d0>   DW_AT_upper_bound : 1023
 <2><10d2>: Abbrev Number: 0
 <1><10d3>: Abbrev Number: 23 (DW_TAG_variable)
    <10d4>   DW_AT_name        : (indirect string, offset: 0x20183): thread_stack
    <10d8>   DW_AT_decl_file   : 1
    <10d9>   DW_AT_decl_line   : 48
    <10da>   DW_AT_decl_column : 9
    <10db>   DW_AT_type        : <0x10c2>
    <10df>   DW_AT_external    : 1
    <10df>   DW_AT_location    : 5 byte block: 3 60 4 0 20 	(DW_OP_addr: 20000460)
 <1><10e5>: Abbrev Number: 23 (DW_TAG_variable)
    <10e6>   DW_AT_name        : (indirect string, offset: 0xe38b7): thread_ptr
    <10ea>   DW_AT_decl_file   : 1
    <10eb>   DW_AT_decl_line   : 49
    <10ec>   DW_AT_decl_column : 11
    <10ed>   DW_AT_type        : <0xa77>
    <10f1>   DW_AT_external    : 1
    <10f1>   DW_AT_location    : 5 byte block: 3 60 8 0 20 	(DW_OP_addr: 20000860)
 <1><10f7>: Abbrev Number: 23 (DW_TAG_variable)
    <10f8>   DW_AT_name        : (indirect string, offset: 0x8c722): g_stop_ticks
    <10fc>   DW_AT_decl_file   : 1
    <10fd>   DW_AT_decl_line   : 50
    <10fe>   DW_AT_decl_column : 7
    <10ff>   DW_AT_type        : <0x6c0>
    <1103>   DW_AT_external    : 1
    <1103>   DW_AT_location    : 5 byte block: 3 10 9 0 20 	(DW_OP_addr: 20000910)
 <1><1109>: Abbrev Number: 24 (DW_TAG_subprogram)
    <110a>   DW_AT_external    : 1
    <110a>   DW_AT_name        : (indirect string, offset: 0x3c8a): _tx_thread_sleep
    <110e>   DW_AT_decl_file   : 4
    <110f>   DW_AT_decl_line   : 1654
    <1111>   DW_AT_decl_column : 13
    <1112>   DW_AT_prototyped  : 1
    <1112>   DW_AT_type        : <0x6b4>
    <1116>   DW_AT_declaration : 1
