Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x5f5 (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x5afe): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x2500): ../AZURE_RTOS/App/app_azure_rtos.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x613): D:/githubs/Nucleo-L452_Azure_RTOS/02_tracex/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 4
    <2b>   DW_AT_encoding    : 7	(unsigned)
    <2c>   DW_AT_name        : (indirect string, offset: 0x26aa): unsigned int
 <1><30>: Abbrev Number: 3 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 4
    <32>   DW_AT_encoding    : 5	(signed)
    <33>   DW_AT_name        : int
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 8
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5e15): long long int
 <1><3e>: Abbrev Number: 2 (DW_TAG_base_type)
    <3f>   DW_AT_byte_size   : 8
    <40>   DW_AT_encoding    : 4	(float)
    <41>   DW_AT_name        : (indirect string, offset: 0x39c): long double
 <1><45>: Abbrev Number: 2 (DW_TAG_base_type)
    <46>   DW_AT_byte_size   : 1
    <47>   DW_AT_encoding    : 6	(signed char)
    <48>   DW_AT_name        : (indirect string, offset: 0x9aa): signed char
 <1><4c>: Abbrev Number: 2 (DW_TAG_base_type)
    <4d>   DW_AT_byte_size   : 1
    <4e>   DW_AT_encoding    : 8	(unsigned char)
    <4f>   DW_AT_name        : (indirect string, offset: 0x3af6): unsigned char
 <1><53>: Abbrev Number: 2 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 2
    <55>   DW_AT_encoding    : 5	(signed)
    <56>   DW_AT_name        : (indirect string, offset: 0xc1d): short int
 <1><5a>: Abbrev Number: 2 (DW_TAG_base_type)
    <5b>   DW_AT_byte_size   : 2
    <5c>   DW_AT_encoding    : 7	(unsigned)
    <5d>   DW_AT_name        : (indirect string, offset: 0x7ac9): short unsigned int
 <1><61>: Abbrev Number: 2 (DW_TAG_base_type)
    <62>   DW_AT_byte_size   : 4
    <63>   DW_AT_encoding    : 5	(signed)
    <64>   DW_AT_name        : (indirect string, offset: 0x7ede): long int
 <1><68>: Abbrev Number: 2 (DW_TAG_base_type)
    <69>   DW_AT_byte_size   : 4
    <6a>   DW_AT_encoding    : 7	(unsigned)
    <6b>   DW_AT_name        : (indirect string, offset: 0x1d7f): long unsigned int
 <1><6f>: Abbrev Number: 2 (DW_TAG_base_type)
    <70>   DW_AT_byte_size   : 8
    <71>   DW_AT_encoding    : 7	(unsigned)
    <72>   DW_AT_name        : (indirect string, offset: 0x2235): long long unsigned int
 <1><76>: Abbrev Number: 4 (DW_TAG_pointer_type)
    <77>   DW_AT_byte_size   : 4
 <1><78>: Abbrev Number: 2 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 1
    <7a>   DW_AT_encoding    : 8	(unsigned char)
    <7b>   DW_AT_name        : (indirect string, offset: 0x9b1): char
 <1><7f>: Abbrev Number: 5 (DW_TAG_typedef)
    <80>   DW_AT_name        : (indirect string, offset: 0x9fa4): CHAR
    <84>   DW_AT_decl_file   : 2
    <85>   DW_AT_decl_line   : 103
    <86>   DW_AT_decl_column : 49
    <87>   DW_AT_type        : <0x78>
 <1><8b>: Abbrev Number: 5 (DW_TAG_typedef)
    <8c>   DW_AT_name        : (indirect string, offset: 0x9fa3): UCHAR
    <90>   DW_AT_decl_file   : 2
    <91>   DW_AT_decl_line   : 104
    <92>   DW_AT_decl_column : 49
    <93>   DW_AT_type        : <0x4c>
 <1><97>: Abbrev Number: 5 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indirect string, offset: 0x6dc7): UINT
    <9c>   DW_AT_decl_file   : 2
    <9d>   DW_AT_decl_line   : 106
    <9e>   DW_AT_decl_column : 49
    <9f>   DW_AT_type        : <0x29>
 <1><a3>: Abbrev Number: 5 (DW_TAG_typedef)
    <a4>   DW_AT_name        : (indirect string, offset: 0x412b): ULONG
    <a8>   DW_AT_decl_file   : 2
    <a9>   DW_AT_decl_line   : 108
    <aa>   DW_AT_decl_column : 49
    <ab>   DW_AT_type        : <0x68>
 <1><af>: Abbrev Number: 6 (DW_TAG_structure_type)
    <b0>   DW_AT_name        : (indirect string, offset: 0x3a7a): TX_TIMER_INTERNAL_STRUCT
    <b4>   DW_AT_byte_size   : 28
    <b5>   DW_AT_decl_file   : 3
    <b6>   DW_AT_decl_line   : 271
    <b8>   DW_AT_decl_column : 16
    <b9>   DW_AT_sibling     : <0x120>
 <2><bd>: Abbrev Number: 7 (DW_TAG_member)
    <be>   DW_AT_name        : (indirect string, offset: 0x5d27): tx_timer_internal_remaining_ticks
    <c2>   DW_AT_decl_file   : 3
    <c3>   DW_AT_decl_line   : 275
    <c5>   DW_AT_decl_column : 25
    <c6>   DW_AT_type        : <0xa3>
    <ca>   DW_AT_data_member_location: 0
 <2><cb>: Abbrev Number: 7 (DW_TAG_member)
    <cc>   DW_AT_name        : (indirect string, offset: 0xa7e1): tx_timer_internal_re_initialize_ticks
    <d0>   DW_AT_decl_file   : 3
    <d1>   DW_AT_decl_line   : 276
    <d3>   DW_AT_decl_column : 25
    <d4>   DW_AT_type        : <0xa3>
    <d8>   DW_AT_data_member_location: 4
 <2><d9>: Abbrev Number: 7 (DW_TAG_member)
    <da>   DW_AT_name        : (indirect string, offset: 0x645d): tx_timer_internal_timeout_function
    <de>   DW_AT_decl_file   : 3
    <df>   DW_AT_decl_line   : 279
    <e1>   DW_AT_decl_column : 27
    <e2>   DW_AT_type        : <0x12b>
    <e6>   DW_AT_data_member_location: 8
 <2><e7>: Abbrev Number: 7 (DW_TAG_member)
    <e8>   DW_AT_name        : (indirect string, offset: 0x953d): tx_timer_internal_timeout_param
    <ec>   DW_AT_decl_file   : 3
    <ed>   DW_AT_decl_line   : 280
    <ef>   DW_AT_decl_column : 25
    <f0>   DW_AT_type        : <0xa3>
    <f4>   DW_AT_data_member_location: 12
 <2><f5>: Abbrev Number: 7 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0x1147): tx_timer_internal_active_next
    <fa>   DW_AT_decl_file   : 3
    <fb>   DW_AT_decl_line   : 286
    <fd>   DW_AT_decl_column : 26
    <fe>   DW_AT_type        : <0x131>
    <102>   DW_AT_data_member_location: 16
 <2><103>: Abbrev Number: 7 (DW_TAG_member)
    <104>   DW_AT_name        : (indirect string, offset: 0xa3b9): tx_timer_internal_active_previous
    <108>   DW_AT_decl_file   : 3
    <109>   DW_AT_decl_line   : 287
    <10b>   DW_AT_decl_column : 26
    <10c>   DW_AT_type        : <0x131>
    <110>   DW_AT_data_member_location: 20
 <2><111>: Abbrev Number: 7 (DW_TAG_member)
    <112>   DW_AT_name        : (indirect string, offset: 0x543c): tx_timer_internal_list_head
    <116>   DW_AT_decl_file   : 3
    <117>   DW_AT_decl_line   : 291
    <119>   DW_AT_decl_column : 27
    <11a>   DW_AT_type        : <0x137>
    <11e>   DW_AT_data_member_location: 24
 <2><11f>: Abbrev Number: 0
 <1><120>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <121>   DW_AT_prototyped  : 1
    <121>   DW_AT_sibling     : <0x12b>
 <2><125>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <126>   DW_AT_type        : <0xa3>
 <2><12a>: Abbrev Number: 0
 <1><12b>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <12c>   DW_AT_byte_size   : 4
    <12d>   DW_AT_type        : <0x120>
 <1><131>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <132>   DW_AT_byte_size   : 4
    <133>   DW_AT_type        : <0xaf>
 <1><137>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <138>   DW_AT_byte_size   : 4
    <139>   DW_AT_type        : <0x131>
 <1><13d>: Abbrev Number: 11 (DW_TAG_typedef)
    <13e>   DW_AT_name        : (indirect string, offset: 0x8d64): TX_TIMER_INTERNAL
    <142>   DW_AT_decl_file   : 3
    <143>   DW_AT_decl_line   : 296
    <145>   DW_AT_decl_column : 3
    <146>   DW_AT_type        : <0xaf>
 <1><14a>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <14b>   DW_AT_byte_size   : 4
    <14c>   DW_AT_type        : <0x7f>
 <1><150>: Abbrev Number: 6 (DW_TAG_structure_type)
    <151>   DW_AT_name        : (indirect string, offset: 0x7580): TX_THREAD_STRUCT
    <155>   DW_AT_byte_size   : 176
    <156>   DW_AT_decl_file   : 3
    <157>   DW_AT_decl_line   : 355
    <159>   DW_AT_decl_column : 16
    <15a>   DW_AT_sibling     : <0x373>
 <2><15e>: Abbrev Number: 7 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x4071): tx_thread_id
    <163>   DW_AT_decl_file   : 3
    <164>   DW_AT_decl_line   : 362
    <166>   DW_AT_decl_column : 25
    <167>   DW_AT_type        : <0xa3>
    <16b>   DW_AT_data_member_location: 0
 <2><16c>: Abbrev Number: 7 (DW_TAG_member)
    <16d>   DW_AT_name        : (indirect string, offset: 0x7501): tx_thread_run_count
    <171>   DW_AT_decl_file   : 3
    <172>   DW_AT_decl_line   : 363
    <174>   DW_AT_decl_column : 25
    <175>   DW_AT_type        : <0xa3>
    <179>   DW_AT_data_member_location: 4
 <2><17a>: Abbrev Number: 7 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x2c7f): tx_thread_stack_ptr
    <17f>   DW_AT_decl_file   : 3
    <180>   DW_AT_decl_line   : 364
    <182>   DW_AT_decl_column : 26
    <183>   DW_AT_type        : <0x76>
    <187>   DW_AT_data_member_location: 8
 <2><188>: Abbrev Number: 7 (DW_TAG_member)
    <189>   DW_AT_name        : (indirect string, offset: 0x6fa2): tx_thread_stack_start
    <18d>   DW_AT_decl_file   : 3
    <18e>   DW_AT_decl_line   : 365
    <190>   DW_AT_decl_column : 26
    <191>   DW_AT_type        : <0x76>
    <195>   DW_AT_data_member_location: 12
 <2><196>: Abbrev Number: 7 (DW_TAG_member)
    <197>   DW_AT_name        : (indirect string, offset: 0x9061): tx_thread_stack_end
    <19b>   DW_AT_decl_file   : 3
    <19c>   DW_AT_decl_line   : 366
    <19e>   DW_AT_decl_column : 26
    <19f>   DW_AT_type        : <0x76>
    <1a3>   DW_AT_data_member_location: 16
 <2><1a4>: Abbrev Number: 7 (DW_TAG_member)
    <1a5>   DW_AT_name        : (indirect string, offset: 0x9103): tx_thread_stack_size
    <1a9>   DW_AT_decl_file   : 3
    <1aa>   DW_AT_decl_line   : 367
    <1ac>   DW_AT_decl_column : 25
    <1ad>   DW_AT_type        : <0xa3>
    <1b1>   DW_AT_data_member_location: 20
 <2><1b2>: Abbrev Number: 7 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0xded5c): tx_thread_time_slice
    <1b7>   DW_AT_decl_file   : 3
    <1b8>   DW_AT_decl_line   : 368
    <1ba>   DW_AT_decl_column : 25
    <1bb>   DW_AT_type        : <0xa3>
    <1bf>   DW_AT_data_member_location: 24
 <2><1c0>: Abbrev Number: 7 (DW_TAG_member)
    <1c1>   DW_AT_name        : (indirect string, offset: 0x3d04): tx_thread_new_time_slice
    <1c5>   DW_AT_decl_file   : 3
    <1c6>   DW_AT_decl_line   : 369
    <1c8>   DW_AT_decl_column : 25
    <1c9>   DW_AT_type        : <0xa3>
    <1cd>   DW_AT_data_member_location: 28
 <2><1ce>: Abbrev Number: 7 (DW_TAG_member)
    <1cf>   DW_AT_name        : (indirect string, offset: 0x6c07): tx_thread_ready_next
    <1d3>   DW_AT_decl_file   : 3
    <1d4>   DW_AT_decl_line   : 373
    <1d6>   DW_AT_decl_column : 26
    <1d7>   DW_AT_type        : <0x373>
    <1db>   DW_AT_data_member_location: 32
 <2><1dc>: Abbrev Number: 7 (DW_TAG_member)
    <1dd>   DW_AT_name        : (indirect string, offset: 0xbe6): tx_thread_ready_previous
    <1e1>   DW_AT_decl_file   : 3
    <1e2>   DW_AT_decl_line   : 374
    <1e4>   DW_AT_decl_column : 26
    <1e5>   DW_AT_type        : <0x373>
    <1e9>   DW_AT_data_member_location: 36
 <2><1ea>: Abbrev Number: 7 (DW_TAG_member)
    <1eb>   DW_AT_name        : (indirect string, offset: 0x7cec): tx_thread_name
    <1ef>   DW_AT_decl_file   : 3
    <1f0>   DW_AT_decl_line   : 382
    <1f2>   DW_AT_decl_column : 26
    <1f3>   DW_AT_type        : <0x14a>
    <1f7>   DW_AT_data_member_location: 40
 <2><1f8>: Abbrev Number: 7 (DW_TAG_member)
    <1f9>   DW_AT_name        : (indirect string, offset: 0x389c): tx_thread_priority
    <1fd>   DW_AT_decl_file   : 3
    <1fe>   DW_AT_decl_line   : 383
    <200>   DW_AT_decl_column : 25
    <201>   DW_AT_type        : <0x97>
    <205>   DW_AT_data_member_location: 44
 <2><206>: Abbrev Number: 7 (DW_TAG_member)
    <207>   DW_AT_name        : (indirect string, offset: 0x127a): tx_thread_state
    <20b>   DW_AT_decl_file   : 3
    <20c>   DW_AT_decl_line   : 384
    <20e>   DW_AT_decl_column : 25
    <20f>   DW_AT_type        : <0x97>
    <213>   DW_AT_data_member_location: 48
 <2><214>: Abbrev Number: 7 (DW_TAG_member)
    <215>   DW_AT_name        : (indirect string, offset: 0x9661): tx_thread_delayed_suspend
    <219>   DW_AT_decl_file   : 3
    <21a>   DW_AT_decl_line   : 385
    <21c>   DW_AT_decl_column : 25
    <21d>   DW_AT_type        : <0x97>
    <221>   DW_AT_data_member_location: 52
 <2><222>: Abbrev Number: 7 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x66e1): tx_thread_suspending
    <227>   DW_AT_decl_file   : 3
    <228>   DW_AT_decl_line   : 386
    <22a>   DW_AT_decl_column : 25
    <22b>   DW_AT_type        : <0x97>
    <22f>   DW_AT_data_member_location: 56
 <2><230>: Abbrev Number: 7 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x2755): tx_thread_preempt_threshold
    <235>   DW_AT_decl_file   : 3
    <236>   DW_AT_decl_line   : 387
    <238>   DW_AT_decl_column : 25
    <239>   DW_AT_type        : <0x97>
    <23d>   DW_AT_data_member_location: 60
 <2><23e>: Abbrev Number: 7 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x51a3): tx_thread_schedule_hook
    <243>   DW_AT_decl_file   : 3
    <244>   DW_AT_decl_line   : 392
    <246>   DW_AT_decl_column : 27
    <247>   DW_AT_type        : <0x389>
    <24b>   DW_AT_data_member_location: 64
 <2><24c>: Abbrev Number: 7 (DW_TAG_member)
    <24d>   DW_AT_name        : (indirect string, offset: 0x364): tx_thread_entry
    <251>   DW_AT_decl_file   : 3
    <252>   DW_AT_decl_line   : 400
    <254>   DW_AT_decl_column : 27
    <255>   DW_AT_type        : <0x12b>
    <259>   DW_AT_data_member_location: 68
 <2><25a>: Abbrev Number: 7 (DW_TAG_member)
    <25b>   DW_AT_name        : (indirect string, offset: 0xe9c): tx_thread_entry_parameter
    <25f>   DW_AT_decl_file   : 3
    <260>   DW_AT_decl_line   : 401
    <262>   DW_AT_decl_column : 25
    <263>   DW_AT_type        : <0xa3>
    <267>   DW_AT_data_member_location: 72
 <2><268>: Abbrev Number: 7 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x3a6a): tx_thread_timer
    <26d>   DW_AT_decl_file   : 3
    <26e>   DW_AT_decl_line   : 405
    <270>   DW_AT_decl_column : 25
    <271>   DW_AT_type        : <0x13d>
    <275>   DW_AT_data_member_location: 76
 <2><276>: Abbrev Number: 7 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x7179): tx_thread_suspend_cleanup
    <27b>   DW_AT_decl_file   : 3
    <27c>   DW_AT_decl_line   : 411
    <27e>   DW_AT_decl_column : 27
    <27f>   DW_AT_type        : <0x389>
    <283>   DW_AT_data_member_location: 104
 <2><284>: Abbrev Number: 7 (DW_TAG_member)
    <285>   DW_AT_name        : (indirect string, offset: 0x7023): tx_thread_suspend_control_block
    <289>   DW_AT_decl_file   : 3
    <28a>   DW_AT_decl_line   : 412
    <28c>   DW_AT_decl_column : 26
    <28d>   DW_AT_type        : <0x76>
    <291>   DW_AT_data_member_location: 108
 <2><292>: Abbrev Number: 7 (DW_TAG_member)
    <293>   DW_AT_name        : (indirect string, offset: 0x6bee): tx_thread_suspended_next
    <297>   DW_AT_decl_file   : 3
    <298>   DW_AT_decl_line   : 414
    <29a>   DW_AT_decl_column : 26
    <29b>   DW_AT_type        : <0x373>
    <29f>   DW_AT_data_member_location: 112
 <2><2a0>: Abbrev Number: 7 (DW_TAG_member)
    <2a1>   DW_AT_name        : (indirect string, offset: 0x4202): tx_thread_suspended_previous
    <2a5>   DW_AT_decl_file   : 3
    <2a6>   DW_AT_decl_line   : 415
    <2a8>   DW_AT_decl_column : 26
    <2a9>   DW_AT_type        : <0x373>
    <2ad>   DW_AT_data_member_location: 116
 <2><2ae>: Abbrev Number: 7 (DW_TAG_member)
    <2af>   DW_AT_name        : (indirect string, offset: 0x76a1): tx_thread_suspend_info
    <2b3>   DW_AT_decl_file   : 3
    <2b4>   DW_AT_decl_line   : 416
    <2b6>   DW_AT_decl_column : 25
    <2b7>   DW_AT_type        : <0xa3>
    <2bb>   DW_AT_data_member_location: 120
 <2><2bc>: Abbrev Number: 7 (DW_TAG_member)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x7e81): tx_thread_additional_suspend_info
    <2c1>   DW_AT_decl_file   : 3
    <2c2>   DW_AT_decl_line   : 417
    <2c4>   DW_AT_decl_column : 26
    <2c5>   DW_AT_type        : <0x76>
    <2c9>   DW_AT_data_member_location: 124
 <2><2ca>: Abbrev Number: 7 (DW_TAG_member)
    <2cb>   DW_AT_name        : (indirect string, offset: 0x239e): tx_thread_suspend_option
    <2cf>   DW_AT_decl_file   : 3
    <2d0>   DW_AT_decl_line   : 418
    <2d2>   DW_AT_decl_column : 25
    <2d3>   DW_AT_type        : <0x97>
    <2d7>   DW_AT_data_member_location: 128
 <2><2d8>: Abbrev Number: 7 (DW_TAG_member)
    <2d9>   DW_AT_name        : (indirect string, offset: 0x2136): tx_thread_suspend_status
    <2dd>   DW_AT_decl_file   : 3
    <2de>   DW_AT_decl_line   : 419
    <2e0>   DW_AT_decl_column : 25
    <2e1>   DW_AT_type        : <0x97>
    <2e5>   DW_AT_data_member_location: 132
 <2><2e6>: Abbrev Number: 7 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0xc27): tx_thread_created_next
    <2eb>   DW_AT_decl_file   : 3
    <2ec>   DW_AT_decl_line   : 428
    <2ee>   DW_AT_decl_column : 26
    <2ef>   DW_AT_type        : <0x373>
    <2f3>   DW_AT_data_member_location: 136
 <2><2f4>: Abbrev Number: 7 (DW_TAG_member)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x3933): tx_thread_created_previous
    <2f9>   DW_AT_decl_file   : 3
    <2fa>   DW_AT_decl_line   : 429
    <2fc>   DW_AT_decl_column : 26
    <2fd>   DW_AT_type        : <0x373>
    <301>   DW_AT_data_member_location: 140
 <2><302>: Abbrev Number: 7 (DW_TAG_member)
    <303>   DW_AT_name        : (indirect string, offset: 0x1942): tx_thread_filex_ptr
    <307>   DW_AT_decl_file   : 3
    <308>   DW_AT_decl_line   : 437
    <30a>   DW_AT_decl_column : 26
    <30b>   DW_AT_type        : <0x76>
    <30f>   DW_AT_data_member_location: 144
 <2><310>: Abbrev Number: 7 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0x37a8): tx_thread_user_priority
    <315>   DW_AT_decl_file   : 3
    <316>   DW_AT_decl_line   : 443
    <318>   DW_AT_decl_column : 25
    <319>   DW_AT_type        : <0x97>
    <31d>   DW_AT_data_member_location: 148
 <2><31e>: Abbrev Number: 7 (DW_TAG_member)
    <31f>   DW_AT_name        : (indirect string, offset: 0xfd): tx_thread_user_preempt_threshold
    <323>   DW_AT_decl_file   : 3
    <324>   DW_AT_decl_line   : 444
    <326>   DW_AT_decl_column : 25
    <327>   DW_AT_type        : <0x97>
    <32b>   DW_AT_data_member_location: 152
 <2><32c>: Abbrev Number: 7 (DW_TAG_member)
    <32d>   DW_AT_name        : (indirect string, offset: 0x6082): tx_thread_inherit_priority
    <331>   DW_AT_decl_file   : 3
    <332>   DW_AT_decl_line   : 445
    <334>   DW_AT_decl_column : 25
    <335>   DW_AT_type        : <0x97>
    <339>   DW_AT_data_member_location: 156
 <2><33a>: Abbrev Number: 7 (DW_TAG_member)
    <33b>   DW_AT_name        : (indirect string, offset: 0x1831): tx_thread_owned_mutex_count
    <33f>   DW_AT_decl_file   : 3
    <340>   DW_AT_decl_line   : 448
    <342>   DW_AT_decl_column : 25
    <343>   DW_AT_type        : <0x97>
    <347>   DW_AT_data_member_location: 160
 <2><348>: Abbrev Number: 7 (DW_TAG_member)
    <349>   DW_AT_name        : (indirect string, offset: 0x53f1): tx_thread_owned_mutex_list
    <34d>   DW_AT_decl_file   : 3
    <34e>   DW_AT_decl_line   : 450
    <350>   DW_AT_decl_column : 26
    <351>   DW_AT_type        : <0x454>
    <355>   DW_AT_data_member_location: 164
 <2><356>: Abbrev Number: 7 (DW_TAG_member)
    <357>   DW_AT_name        : (indirect string, offset: 0x2523): tx_thread_stack_highest_ptr
    <35b>   DW_AT_decl_file   : 3
    <35c>   DW_AT_decl_line   : 490
    <35e>   DW_AT_decl_column : 26
    <35f>   DW_AT_type        : <0x76>
    <363>   DW_AT_data_member_location: 168
 <2><364>: Abbrev Number: 7 (DW_TAG_member)
    <365>   DW_AT_name        : (indirect string, offset: 0x15dc): tx_thread_suspension_sequence
    <369>   DW_AT_decl_file   : 3
    <36a>   DW_AT_decl_line   : 517
    <36c>   DW_AT_decl_column : 25
    <36d>   DW_AT_type        : <0xa3>
    <371>   DW_AT_data_member_location: 172
 <2><372>: Abbrev Number: 0
 <1><373>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <374>   DW_AT_byte_size   : 4
    <375>   DW_AT_type        : <0x150>
 <1><379>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <37a>   DW_AT_prototyped  : 1
    <37a>   DW_AT_sibling     : <0x389>
 <2><37e>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <37f>   DW_AT_type        : <0x373>
 <2><383>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <384>   DW_AT_type        : <0xa3>
 <2><388>: Abbrev Number: 0
 <1><389>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <38a>   DW_AT_byte_size   : 4
    <38b>   DW_AT_type        : <0x379>
 <1><38f>: Abbrev Number: 6 (DW_TAG_structure_type)
    <390>   DW_AT_name        : (indirect string, offset: 0x1d1d): TX_MUTEX_STRUCT
    <394>   DW_AT_byte_size   : 52
    <395>   DW_AT_decl_file   : 3
    <396>   DW_AT_decl_line   : 773
    <398>   DW_AT_decl_column : 16
    <399>   DW_AT_sibling     : <0x454>
 <2><39d>: Abbrev Number: 7 (DW_TAG_member)
    <39e>   DW_AT_name        : (indirect string, offset: 0x4af3): tx_mutex_id
    <3a2>   DW_AT_decl_file   : 3
    <3a3>   DW_AT_decl_line   : 777
    <3a5>   DW_AT_decl_column : 25
    <3a6>   DW_AT_type        : <0xa3>
    <3aa>   DW_AT_data_member_location: 0
 <2><3ab>: Abbrev Number: 7 (DW_TAG_member)
    <3ac>   DW_AT_name        : (indirect string, offset: 0x719d): tx_mutex_name
    <3b0>   DW_AT_decl_file   : 3
    <3b1>   DW_AT_decl_line   : 780
    <3b3>   DW_AT_decl_column : 26
    <3b4>   DW_AT_type        : <0x14a>
    <3b8>   DW_AT_data_member_location: 4
 <2><3b9>: Abbrev Number: 7 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0x10a9): tx_mutex_ownership_count
    <3be>   DW_AT_decl_file   : 3
    <3bf>   DW_AT_decl_line   : 783
    <3c1>   DW_AT_decl_column : 25
    <3c2>   DW_AT_type        : <0x97>
    <3c6>   DW_AT_data_member_location: 8
 <2><3c7>: Abbrev Number: 7 (DW_TAG_member)
    <3c8>   DW_AT_name        : (indirect string, offset: 0x5662): tx_mutex_owner
    <3cc>   DW_AT_decl_file   : 3
    <3cd>   DW_AT_decl_line   : 787
    <3cf>   DW_AT_decl_column : 26
    <3d0>   DW_AT_type        : <0x545>
    <3d4>   DW_AT_data_member_location: 12
 <2><3d5>: Abbrev Number: 7 (DW_TAG_member)
    <3d6>   DW_AT_name        : (indirect string, offset: 0xa2f3): tx_mutex_inherit
    <3da>   DW_AT_decl_file   : 3
    <3db>   DW_AT_decl_line   : 791
    <3dd>   DW_AT_decl_column : 25
    <3de>   DW_AT_type        : <0x97>
    <3e2>   DW_AT_data_member_location: 16
 <2><3e3>: Abbrev Number: 7 (DW_TAG_member)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x63d6): tx_mutex_original_priority
    <3e8>   DW_AT_decl_file   : 3
    <3e9>   DW_AT_decl_line   : 794
    <3eb>   DW_AT_decl_column : 25
    <3ec>   DW_AT_type        : <0x97>
    <3f0>   DW_AT_data_member_location: 20
 <2><3f1>: Abbrev Number: 7 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x16cb): tx_mutex_suspension_list
    <3f6>   DW_AT_decl_file   : 3
    <3f7>   DW_AT_decl_line   : 799
    <3f9>   DW_AT_decl_column : 26
    <3fa>   DW_AT_type        : <0x373>
    <3fe>   DW_AT_data_member_location: 24
 <2><3ff>: Abbrev Number: 7 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0x7892): tx_mutex_suspended_count
    <404>   DW_AT_decl_file   : 3
    <405>   DW_AT_decl_line   : 800
    <407>   DW_AT_decl_column : 25
    <408>   DW_AT_type        : <0x97>
    <40c>   DW_AT_data_member_location: 28
 <2><40d>: Abbrev Number: 7 (DW_TAG_member)
    <40e>   DW_AT_name        : (indirect string, offset: 0x8283): tx_mutex_created_next
    <412>   DW_AT_decl_file   : 3
    <413>   DW_AT_decl_line   : 804
    <415>   DW_AT_decl_column : 26
    <416>   DW_AT_type        : <0x454>
    <41a>   DW_AT_data_member_location: 32
 <2><41b>: Abbrev Number: 7 (DW_TAG_member)
    <41c>   DW_AT_name        : (indirect string, offset: 0x7a9): tx_mutex_created_previous
    <420>   DW_AT_decl_file   : 3
    <421>   DW_AT_decl_line   : 805
    <423>   DW_AT_decl_column : 26
    <424>   DW_AT_type        : <0x454>
    <428>   DW_AT_data_member_location: 36
 <2><429>: Abbrev Number: 7 (DW_TAG_member)
    <42a>   DW_AT_name        : (indirect string, offset: 0x22c7): tx_mutex_highest_priority_waiting
    <42e>   DW_AT_decl_file   : 3
    <42f>   DW_AT_decl_line   : 809
    <431>   DW_AT_decl_column : 25
    <432>   DW_AT_type        : <0x97>
    <436>   DW_AT_data_member_location: 40
 <2><437>: Abbrev Number: 7 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0x92ef): tx_mutex_owned_next
    <43c>   DW_AT_decl_file   : 3
    <43d>   DW_AT_decl_line   : 813
    <43f>   DW_AT_decl_column : 26
    <440>   DW_AT_type        : <0x454>
    <444>   DW_AT_data_member_location: 44
 <2><445>: Abbrev Number: 7 (DW_TAG_member)
    <446>   DW_AT_name        : (indirect string, offset: 0xa115): tx_mutex_owned_previous
    <44a>   DW_AT_decl_file   : 3
    <44b>   DW_AT_decl_line   : 814
    <44d>   DW_AT_decl_column : 26
    <44e>   DW_AT_type        : <0x454>
    <452>   DW_AT_data_member_location: 48
 <2><453>: Abbrev Number: 0
 <1><454>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <455>   DW_AT_byte_size   : 4
    <456>   DW_AT_type        : <0x38f>
 <1><45a>: Abbrev Number: 11 (DW_TAG_typedef)
    <45b>   DW_AT_name        : (indirect string, offset: 0x6de7): TX_THREAD
    <45f>   DW_AT_decl_file   : 3
    <460>   DW_AT_decl_line   : 525
    <462>   DW_AT_decl_column : 3
    <463>   DW_AT_type        : <0x150>
 <1><467>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <468>   DW_AT_byte_size   : 4
    <469>   DW_AT_type        : <0x8b>
 <1><46d>: Abbrev Number: 6 (DW_TAG_structure_type)
    <46e>   DW_AT_name        : (indirect string, offset: 0x48a6): TX_BYTE_POOL_STRUCT
    <472>   DW_AT_byte_size   : 52
    <473>   DW_AT_decl_file   : 3
    <474>   DW_AT_decl_line   : 608
    <476>   DW_AT_decl_column : 16
    <477>   DW_AT_sibling     : <0x532>
 <2><47b>: Abbrev Number: 7 (DW_TAG_member)
    <47c>   DW_AT_name        : (indirect string, offset: 0x1821): tx_byte_pool_id
    <480>   DW_AT_decl_file   : 3
    <481>   DW_AT_decl_line   : 612
    <483>   DW_AT_decl_column : 25
    <484>   DW_AT_type        : <0xa3>
    <488>   DW_AT_data_member_location: 0
 <2><489>: Abbrev Number: 7 (DW_TAG_member)
    <48a>   DW_AT_name        : (indirect string, offset: 0x643d): tx_byte_pool_name
    <48e>   DW_AT_decl_file   : 3
    <48f>   DW_AT_decl_line   : 615
    <491>   DW_AT_decl_column : 26
    <492>   DW_AT_type        : <0x14a>
    <496>   DW_AT_data_member_location: 4
 <2><497>: Abbrev Number: 7 (DW_TAG_member)
    <498>   DW_AT_name        : (indirect string, offset: 0x7c3): tx_byte_pool_available
    <49c>   DW_AT_decl_file   : 3
    <49d>   DW_AT_decl_line   : 618
    <49f>   DW_AT_decl_column : 25
    <4a0>   DW_AT_type        : <0xa3>
    <4a4>   DW_AT_data_member_location: 8
 <2><4a5>: Abbrev Number: 7 (DW_TAG_member)
    <4a6>   DW_AT_name        : (indirect string, offset: 0x7d0e): tx_byte_pool_fragments
    <4aa>   DW_AT_decl_file   : 3
    <4ab>   DW_AT_decl_line   : 621
    <4ad>   DW_AT_decl_column : 25
    <4ae>   DW_AT_type        : <0x97>
    <4b2>   DW_AT_data_member_location: 12
 <2><4b3>: Abbrev Number: 7 (DW_TAG_member)
    <4b4>   DW_AT_name        : (indirect string, offset: 0x4253): tx_byte_pool_list
    <4b8>   DW_AT_decl_file   : 3
    <4b9>   DW_AT_decl_line   : 624
    <4bb>   DW_AT_decl_column : 26
    <4bc>   DW_AT_type        : <0x467>
    <4c0>   DW_AT_data_member_location: 16
 <2><4c1>: Abbrev Number: 7 (DW_TAG_member)
    <4c2>   DW_AT_name        : (indirect string, offset: 0x6cfd): tx_byte_pool_search
    <4c6>   DW_AT_decl_file   : 3
    <4c7>   DW_AT_decl_line   : 628
    <4c9>   DW_AT_decl_column : 26
    <4ca>   DW_AT_type        : <0x467>
    <4ce>   DW_AT_data_member_location: 20
 <2><4cf>: Abbrev Number: 7 (DW_TAG_member)
    <4d0>   DW_AT_name        : (indirect string, offset: 0x7cfb): tx_byte_pool_start
    <4d4>   DW_AT_decl_file   : 3
    <4d5>   DW_AT_decl_line   : 631
    <4d7>   DW_AT_decl_column : 26
    <4d8>   DW_AT_type        : <0x467>
    <4dc>   DW_AT_data_member_location: 24
 <2><4dd>: Abbrev Number: 7 (DW_TAG_member)
    <4de>   DW_AT_name        : (indirect string, offset: 0x16b9): tx_byte_pool_size
    <4e2>   DW_AT_decl_file   : 3
    <4e3>   DW_AT_decl_line   : 634
    <4e5>   DW_AT_decl_column : 25
    <4e6>   DW_AT_type        : <0xa3>
    <4ea>   DW_AT_data_member_location: 28
 <2><4eb>: Abbrev Number: 7 (DW_TAG_member)
    <4ec>   DW_AT_name        : (indirect string, offset: 0x41ef): tx_byte_pool_owner
    <4f0>   DW_AT_decl_file   : 3
    <4f1>   DW_AT_decl_line   : 640
    <4f3>   DW_AT_decl_column : 26
    <4f4>   DW_AT_type        : <0x373>
    <4f8>   DW_AT_data_member_location: 32
 <2><4f9>: Abbrev Number: 7 (DW_TAG_member)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x9044): tx_byte_pool_suspension_list
    <4fe>   DW_AT_decl_file   : 3
    <4ff>   DW_AT_decl_line   : 645
    <501>   DW_AT_decl_column : 26
    <502>   DW_AT_type        : <0x373>
    <506>   DW_AT_data_member_location: 36
 <2><507>: Abbrev Number: 7 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0x7781): tx_byte_pool_suspended_count
    <50c>   DW_AT_decl_file   : 3
    <50d>   DW_AT_decl_line   : 646
    <50f>   DW_AT_decl_column : 25
    <510>   DW_AT_type        : <0x97>
    <514>   DW_AT_data_member_location: 40
 <2><515>: Abbrev Number: 7 (DW_TAG_member)
    <516>   DW_AT_name        : (indirect string, offset: 0x65b): tx_byte_pool_created_next
    <51a>   DW_AT_decl_file   : 3
    <51b>   DW_AT_decl_line   : 650
    <51d>   DW_AT_decl_column : 26
    <51e>   DW_AT_type        : <0x532>
    <522>   DW_AT_data_member_location: 44
 <2><523>: Abbrev Number: 7 (DW_TAG_member)
    <524>   DW_AT_name        : (indirect string, offset: 0x7d25): tx_byte_pool_created_previous
    <528>   DW_AT_decl_file   : 3
    <529>   DW_AT_decl_line   : 651
    <52b>   DW_AT_decl_column : 26
    <52c>   DW_AT_type        : <0x532>
    <530>   DW_AT_data_member_location: 48
 <2><531>: Abbrev Number: 0
 <1><532>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <533>   DW_AT_byte_size   : 4
    <534>   DW_AT_type        : <0x46d>
 <1><538>: Abbrev Number: 11 (DW_TAG_typedef)
    <539>   DW_AT_name        : (indirect string, offset: 0x30): TX_BYTE_POOL
    <53d>   DW_AT_decl_file   : 3
    <53e>   DW_AT_decl_line   : 682
    <540>   DW_AT_decl_column : 3
    <541>   DW_AT_type        : <0x46d>
 <1><545>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <546>   DW_AT_byte_size   : 4
    <547>   DW_AT_type        : <0x45a>
 <1><54b>: Abbrev Number: 12 (DW_TAG_array_type)
    <54c>   DW_AT_type        : <0x8b>
    <550>   DW_AT_sibling     : <0x55c>
 <2><554>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <555>   DW_AT_type        : <0x29>
    <559>   DW_AT_upper_bound : 1023
 <2><55b>: Abbrev Number: 0
 <1><55c>: Abbrev Number: 14 (DW_TAG_variable)
    <55d>   DW_AT_name        : (indirect string, offset: 0x9cac): tx_byte_pool_buffer
    <561>   DW_AT_decl_file   : 1
    <562>   DW_AT_decl_line   : 49
    <563>   DW_AT_decl_column : 14
    <564>   DW_AT_type        : <0x54b>
    <568>   DW_AT_location    : 5 byte block: 3 cc f 0 20 	(DW_OP_addr: 20000fcc)
 <1><56e>: Abbrev Number: 14 (DW_TAG_variable)
    <56f>   DW_AT_name        : (indirect string, offset: 0x2011): tx_app_byte_pool
    <573>   DW_AT_decl_file   : 1
    <574>   DW_AT_decl_line   : 50
    <575>   DW_AT_decl_column : 21
    <576>   DW_AT_type        : <0x538>
    <57a>   DW_AT_location    : 5 byte block: 3 cc 13 0 20 	(DW_OP_addr: 200013cc)
 <1><580>: Abbrev Number: 15 (DW_TAG_subprogram)
    <581>   DW_AT_external    : 1
    <581>   DW_AT_name        : (indirect string, offset: 0x6d4a): App_ThreadX_Init
    <585>   DW_AT_decl_file   : 4
    <586>   DW_AT_decl_line   : 52
    <587>   DW_AT_decl_column : 6
    <588>   DW_AT_prototyped  : 1
    <588>   DW_AT_type        : <0x97>
    <58c>   DW_AT_declaration : 1
    <58c>   DW_AT_sibling     : <0x596>
 <2><590>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <591>   DW_AT_type        : <0x76>
 <2><595>: Abbrev Number: 0
 <1><596>: Abbrev Number: 16 (DW_TAG_subprogram)
    <597>   DW_AT_external    : 1
    <597>   DW_AT_name        : (indirect string, offset: 0x6181): _txe_byte_pool_create
    <59b>   DW_AT_decl_file   : 3
    <59c>   DW_AT_decl_line   : 1421
    <59e>   DW_AT_decl_column : 13
    <59f>   DW_AT_prototyped  : 1
    <59f>   DW_AT_type        : <0x97>
    <5a3>   DW_AT_declaration : 1
    <5a3>   DW_AT_sibling     : <0x5c1>
 <2><5a7>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5a8>   DW_AT_type        : <0x5c1>
 <2><5ac>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5ad>   DW_AT_type        : <0x14a>
 <2><5b1>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5b2>   DW_AT_type        : <0x76>
 <2><5b6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5b7>   DW_AT_type        : <0xa3>
 <2><5bb>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <5bc>   DW_AT_type        : <0x97>
 <2><5c0>: Abbrev Number: 0
 <1><5c1>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <5c2>   DW_AT_byte_size   : 4
    <5c3>   DW_AT_type        : <0x538>
 <1><5c7>: Abbrev Number: 17 (DW_TAG_subprogram)
    <5c8>   DW_AT_external    : 1
    <5c8>   DW_AT_name        : (indirect string, offset: 0x4034): tx_application_define
    <5cc>   DW_AT_decl_file   : 1
    <5cd>   DW_AT_decl_line   : 66
    <5ce>   DW_AT_decl_column : 6
    <5cf>   DW_AT_prototyped  : 1
    <5cf>   DW_AT_low_pc      : 0x800071c
    <5d3>   DW_AT_high_pc     : 0x40
    <5d7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5d9>   DW_AT_GNU_all_tail_call_sites: 1
 <2><5d9>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <5da>   DW_AT_name        : (indirect string, offset: 0x972e): first_unused_memory
    <5de>   DW_AT_decl_file   : 1
    <5df>   DW_AT_decl_line   : 66
    <5e0>   DW_AT_decl_column : 34
    <5e1>   DW_AT_type        : <0x76>
    <5e5>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><5e8>: Abbrev Number: 14 (DW_TAG_variable)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x4283): memory_ptr
    <5ed>   DW_AT_decl_file   : 1
    <5ee>   DW_AT_decl_line   : 72
    <5ef>   DW_AT_decl_column : 9
    <5f0>   DW_AT_type        : <0x76>
    <5f4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><5f7>: Abbrev Number: 0
 <1><5f8>: Abbrev Number: 0
  Compilation Unit @ offset 0x5f9:
   Length:        0x7d4 (32-bit)
   Version:       4
   Abbrev Offset: 0x109
   Pointer Size:  4
 <0><604>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <605>   DW_AT_producer    : (indirect string, offset: 0x5afe): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <609>   DW_AT_language    : 12	(ANSI C99)
    <60a>   DW_AT_name        : (indirect string, offset: 0x734b8): ../Core/Src/app_threadx.c
    <60e>   DW_AT_comp_dir    : (indirect string, offset: 0x613): D:/githubs/Nucleo-L452_Azure_RTOS/02_tracex/Debug
    <612>   DW_AT_ranges      : 0x10
    <616>   DW_AT_low_pc      : 0x0
    <61a>   DW_AT_stmt_list   : 0x5ca
    <61e>   DW_AT_GNU_macros  : 0x20d2
 <1><622>: Abbrev Number: 2 (DW_TAG_base_type)
    <623>   DW_AT_byte_size   : 4
    <624>   DW_AT_encoding    : 7	(unsigned)
    <625>   DW_AT_name        : (indirect string, offset: 0x26aa): unsigned int
 <1><629>: Abbrev Number: 3 (DW_TAG_base_type)
    <62a>   DW_AT_byte_size   : 4
    <62b>   DW_AT_encoding    : 5	(signed)
    <62c>   DW_AT_name        : int
 <1><630>: Abbrev Number: 2 (DW_TAG_base_type)
    <631>   DW_AT_byte_size   : 8
    <632>   DW_AT_encoding    : 5	(signed)
    <633>   DW_AT_name        : (indirect string, offset: 0x5e15): long long int
 <1><637>: Abbrev Number: 2 (DW_TAG_base_type)
    <638>   DW_AT_byte_size   : 8
    <639>   DW_AT_encoding    : 4	(float)
    <63a>   DW_AT_name        : (indirect string, offset: 0x39c): long double
 <1><63e>: Abbrev Number: 2 (DW_TAG_base_type)
    <63f>   DW_AT_byte_size   : 1
    <640>   DW_AT_encoding    : 6	(signed char)
    <641>   DW_AT_name        : (indirect string, offset: 0x9aa): signed char
 <1><645>: Abbrev Number: 4 (DW_TAG_typedef)
    <646>   DW_AT_name        : (indirect string, offset: 0x448bf): __uint8_t
    <64a>   DW_AT_decl_file   : 2
    <64b>   DW_AT_decl_line   : 43
    <64c>   DW_AT_decl_column : 24
    <64d>   DW_AT_type        : <0x651>
 <1><651>: Abbrev Number: 2 (DW_TAG_base_type)
    <652>   DW_AT_byte_size   : 1
    <653>   DW_AT_encoding    : 8	(unsigned char)
    <654>   DW_AT_name        : (indirect string, offset: 0x3af6): unsigned char
 <1><658>: Abbrev Number: 2 (DW_TAG_base_type)
    <659>   DW_AT_byte_size   : 2
    <65a>   DW_AT_encoding    : 5	(signed)
    <65b>   DW_AT_name        : (indirect string, offset: 0xc1d): short int
 <1><65f>: Abbrev Number: 4 (DW_TAG_typedef)
    <660>   DW_AT_name        : (indirect string, offset: 0xb0db2): __uint16_t
    <664>   DW_AT_decl_file   : 2
    <665>   DW_AT_decl_line   : 57
    <666>   DW_AT_decl_column : 25
    <667>   DW_AT_type        : <0x66b>
 <1><66b>: Abbrev Number: 2 (DW_TAG_base_type)
    <66c>   DW_AT_byte_size   : 2
    <66d>   DW_AT_encoding    : 7	(unsigned)
    <66e>   DW_AT_name        : (indirect string, offset: 0x7ac9): short unsigned int
 <1><672>: Abbrev Number: 2 (DW_TAG_base_type)
    <673>   DW_AT_byte_size   : 4
    <674>   DW_AT_encoding    : 5	(signed)
    <675>   DW_AT_name        : (indirect string, offset: 0x7ede): long int
 <1><679>: Abbrev Number: 4 (DW_TAG_typedef)
    <67a>   DW_AT_name        : (indirect string, offset: 0x8c760): __uint32_t
    <67e>   DW_AT_decl_file   : 2
    <67f>   DW_AT_decl_line   : 79
    <680>   DW_AT_decl_column : 25
    <681>   DW_AT_type        : <0x685>
 <1><685>: Abbrev Number: 2 (DW_TAG_base_type)
    <686>   DW_AT_byte_size   : 4
    <687>   DW_AT_encoding    : 7	(unsigned)
    <688>   DW_AT_name        : (indirect string, offset: 0x1d7f): long unsigned int
 <1><68c>: Abbrev Number: 2 (DW_TAG_base_type)
    <68d>   DW_AT_byte_size   : 8
    <68e>   DW_AT_encoding    : 7	(unsigned)
    <68f>   DW_AT_name        : (indirect string, offset: 0x2235): long long unsigned int
 <1><693>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <694>   DW_AT_byte_size   : 4
 <1><695>: Abbrev Number: 2 (DW_TAG_base_type)
    <696>   DW_AT_byte_size   : 1
    <697>   DW_AT_encoding    : 8	(unsigned char)
    <698>   DW_AT_name        : (indirect string, offset: 0x9b1): char
 <1><69c>: Abbrev Number: 4 (DW_TAG_typedef)
    <69d>   DW_AT_name        : (indirect string, offset: 0x9fa4): CHAR
    <6a1>   DW_AT_decl_file   : 3
    <6a2>   DW_AT_decl_line   : 103
    <6a3>   DW_AT_decl_column : 49
    <6a4>   DW_AT_type        : <0x695>
 <1><6a8>: Abbrev Number: 4 (DW_TAG_typedef)
    <6a9>   DW_AT_name        : (indirect string, offset: 0x9fa3): UCHAR
    <6ad>   DW_AT_decl_file   : 3
    <6ae>   DW_AT_decl_line   : 104
    <6af>   DW_AT_decl_column : 49
    <6b0>   DW_AT_type        : <0x651>
 <1><6b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <6b5>   DW_AT_name        : (indirect string, offset: 0x6dc7): UINT
    <6b9>   DW_AT_decl_file   : 3
    <6ba>   DW_AT_decl_line   : 106
    <6bb>   DW_AT_decl_column : 49
    <6bc>   DW_AT_type        : <0x622>
 <1><6c0>: Abbrev Number: 4 (DW_TAG_typedef)
    <6c1>   DW_AT_name        : (indirect string, offset: 0x412b): ULONG
    <6c5>   DW_AT_decl_file   : 3
    <6c6>   DW_AT_decl_line   : 108
    <6c7>   DW_AT_decl_column : 49
    <6c8>   DW_AT_type        : <0x685>
 <1><6cc>: Abbrev Number: 6 (DW_TAG_structure_type)
    <6cd>   DW_AT_name        : (indirect string, offset: 0x3a7a): TX_TIMER_INTERNAL_STRUCT
    <6d1>   DW_AT_byte_size   : 28
    <6d2>   DW_AT_decl_file   : 4
    <6d3>   DW_AT_decl_line   : 271
    <6d5>   DW_AT_decl_column : 16
    <6d6>   DW_AT_sibling     : <0x73d>
 <2><6da>: Abbrev Number: 7 (DW_TAG_member)
    <6db>   DW_AT_name        : (indirect string, offset: 0x5d27): tx_timer_internal_remaining_ticks
    <6df>   DW_AT_decl_file   : 4
    <6e0>   DW_AT_decl_line   : 275
    <6e2>   DW_AT_decl_column : 25
    <6e3>   DW_AT_type        : <0x6c0>
    <6e7>   DW_AT_data_member_location: 0
 <2><6e8>: Abbrev Number: 7 (DW_TAG_member)
    <6e9>   DW_AT_name        : (indirect string, offset: 0xa7e1): tx_timer_internal_re_initialize_ticks
    <6ed>   DW_AT_decl_file   : 4
    <6ee>   DW_AT_decl_line   : 276
    <6f0>   DW_AT_decl_column : 25
    <6f1>   DW_AT_type        : <0x6c0>
    <6f5>   DW_AT_data_member_location: 4
 <2><6f6>: Abbrev Number: 7 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0x645d): tx_timer_internal_timeout_function
    <6fb>   DW_AT_decl_file   : 4
    <6fc>   DW_AT_decl_line   : 279
    <6fe>   DW_AT_decl_column : 27
    <6ff>   DW_AT_type        : <0x748>
    <703>   DW_AT_data_member_location: 8
 <2><704>: Abbrev Number: 7 (DW_TAG_member)
    <705>   DW_AT_name        : (indirect string, offset: 0x953d): tx_timer_internal_timeout_param
    <709>   DW_AT_decl_file   : 4
    <70a>   DW_AT_decl_line   : 280
    <70c>   DW_AT_decl_column : 25
    <70d>   DW_AT_type        : <0x6c0>
    <711>   DW_AT_data_member_location: 12
 <2><712>: Abbrev Number: 7 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0x1147): tx_timer_internal_active_next
    <717>   DW_AT_decl_file   : 4
    <718>   DW_AT_decl_line   : 286
    <71a>   DW_AT_decl_column : 26
    <71b>   DW_AT_type        : <0x74e>
    <71f>   DW_AT_data_member_location: 16
 <2><720>: Abbrev Number: 7 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0xa3b9): tx_timer_internal_active_previous
    <725>   DW_AT_decl_file   : 4
    <726>   DW_AT_decl_line   : 287
    <728>   DW_AT_decl_column : 26
    <729>   DW_AT_type        : <0x74e>
    <72d>   DW_AT_data_member_location: 20
 <2><72e>: Abbrev Number: 7 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x543c): tx_timer_internal_list_head
    <733>   DW_AT_decl_file   : 4
    <734>   DW_AT_decl_line   : 291
    <736>   DW_AT_decl_column : 27
    <737>   DW_AT_type        : <0x754>
    <73b>   DW_AT_data_member_location: 24
 <2><73c>: Abbrev Number: 0
 <1><73d>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <73e>   DW_AT_prototyped  : 1
    <73e>   DW_AT_sibling     : <0x748>
 <2><742>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <743>   DW_AT_type        : <0x6c0>
 <2><747>: Abbrev Number: 0
 <1><748>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <749>   DW_AT_byte_size   : 4
    <74a>   DW_AT_type        : <0x73d>
 <1><74e>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <74f>   DW_AT_byte_size   : 4
    <750>   DW_AT_type        : <0x6cc>
 <1><754>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <755>   DW_AT_byte_size   : 4
    <756>   DW_AT_type        : <0x74e>
 <1><75a>: Abbrev Number: 11 (DW_TAG_typedef)
    <75b>   DW_AT_name        : (indirect string, offset: 0x8d64): TX_TIMER_INTERNAL
    <75f>   DW_AT_decl_file   : 4
    <760>   DW_AT_decl_line   : 296
    <762>   DW_AT_decl_column : 3
    <763>   DW_AT_type        : <0x6cc>
 <1><767>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <768>   DW_AT_byte_size   : 4
    <769>   DW_AT_type        : <0x69c>
 <1><76d>: Abbrev Number: 6 (DW_TAG_structure_type)
    <76e>   DW_AT_name        : (indirect string, offset: 0x7580): TX_THREAD_STRUCT
    <772>   DW_AT_byte_size   : 176
    <773>   DW_AT_decl_file   : 4
    <774>   DW_AT_decl_line   : 355
    <776>   DW_AT_decl_column : 16
    <777>   DW_AT_sibling     : <0x990>
 <2><77b>: Abbrev Number: 7 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0x4071): tx_thread_id
    <780>   DW_AT_decl_file   : 4
    <781>   DW_AT_decl_line   : 362
    <783>   DW_AT_decl_column : 25
    <784>   DW_AT_type        : <0x6c0>
    <788>   DW_AT_data_member_location: 0
 <2><789>: Abbrev Number: 7 (DW_TAG_member)
    <78a>   DW_AT_name        : (indirect string, offset: 0x7501): tx_thread_run_count
    <78e>   DW_AT_decl_file   : 4
    <78f>   DW_AT_decl_line   : 363
    <791>   DW_AT_decl_column : 25
    <792>   DW_AT_type        : <0x6c0>
    <796>   DW_AT_data_member_location: 4
 <2><797>: Abbrev Number: 7 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0x2c7f): tx_thread_stack_ptr
    <79c>   DW_AT_decl_file   : 4
    <79d>   DW_AT_decl_line   : 364
    <79f>   DW_AT_decl_column : 26
    <7a0>   DW_AT_type        : <0x693>
    <7a4>   DW_AT_data_member_location: 8
 <2><7a5>: Abbrev Number: 7 (DW_TAG_member)
    <7a6>   DW_AT_name        : (indirect string, offset: 0x6fa2): tx_thread_stack_start
    <7aa>   DW_AT_decl_file   : 4
    <7ab>   DW_AT_decl_line   : 365
    <7ad>   DW_AT_decl_column : 26
    <7ae>   DW_AT_type        : <0x693>
    <7b2>   DW_AT_data_member_location: 12
 <2><7b3>: Abbrev Number: 7 (DW_TAG_member)
    <7b4>   DW_AT_name        : (indirect string, offset: 0x9061): tx_thread_stack_end
    <7b8>   DW_AT_decl_file   : 4
    <7b9>   DW_AT_decl_line   : 366
    <7bb>   DW_AT_decl_column : 26
    <7bc>   DW_AT_type        : <0x693>
    <7c0>   DW_AT_data_member_location: 16
 <2><7c1>: Abbrev Number: 7 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x9103): tx_thread_stack_size
    <7c6>   DW_AT_decl_file   : 4
    <7c7>   DW_AT_decl_line   : 367
    <7c9>   DW_AT_decl_column : 25
    <7ca>   DW_AT_type        : <0x6c0>
    <7ce>   DW_AT_data_member_location: 20
 <2><7cf>: Abbrev Number: 7 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0xded5c): tx_thread_time_slice
    <7d4>   DW_AT_decl_file   : 4
    <7d5>   DW_AT_decl_line   : 368
    <7d7>   DW_AT_decl_column : 25
    <7d8>   DW_AT_type        : <0x6c0>
    <7dc>   DW_AT_data_member_location: 24
 <2><7dd>: Abbrev Number: 7 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0x3d04): tx_thread_new_time_slice
    <7e2>   DW_AT_decl_file   : 4
    <7e3>   DW_AT_decl_line   : 369
    <7e5>   DW_AT_decl_column : 25
    <7e6>   DW_AT_type        : <0x6c0>
    <7ea>   DW_AT_data_member_location: 28
 <2><7eb>: Abbrev Number: 7 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x6c07): tx_thread_ready_next
    <7f0>   DW_AT_decl_file   : 4
    <7f1>   DW_AT_decl_line   : 373
    <7f3>   DW_AT_decl_column : 26
    <7f4>   DW_AT_type        : <0x990>
    <7f8>   DW_AT_data_member_location: 32
 <2><7f9>: Abbrev Number: 7 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0xbe6): tx_thread_ready_previous
    <7fe>   DW_AT_decl_file   : 4
    <7ff>   DW_AT_decl_line   : 374
    <801>   DW_AT_decl_column : 26
    <802>   DW_AT_type        : <0x990>
    <806>   DW_AT_data_member_location: 36
 <2><807>: Abbrev Number: 7 (DW_TAG_member)
    <808>   DW_AT_name        : (indirect string, offset: 0x7cec): tx_thread_name
    <80c>   DW_AT_decl_file   : 4
    <80d>   DW_AT_decl_line   : 382
    <80f>   DW_AT_decl_column : 26
    <810>   DW_AT_type        : <0x767>
    <814>   DW_AT_data_member_location: 40
 <2><815>: Abbrev Number: 7 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x389c): tx_thread_priority
    <81a>   DW_AT_decl_file   : 4
    <81b>   DW_AT_decl_line   : 383
    <81d>   DW_AT_decl_column : 25
    <81e>   DW_AT_type        : <0x6b4>
    <822>   DW_AT_data_member_location: 44
 <2><823>: Abbrev Number: 7 (DW_TAG_member)
    <824>   DW_AT_name        : (indirect string, offset: 0x127a): tx_thread_state
    <828>   DW_AT_decl_file   : 4
    <829>   DW_AT_decl_line   : 384
    <82b>   DW_AT_decl_column : 25
    <82c>   DW_AT_type        : <0x6b4>
    <830>   DW_AT_data_member_location: 48
 <2><831>: Abbrev Number: 7 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x9661): tx_thread_delayed_suspend
    <836>   DW_AT_decl_file   : 4
    <837>   DW_AT_decl_line   : 385
    <839>   DW_AT_decl_column : 25
    <83a>   DW_AT_type        : <0x6b4>
    <83e>   DW_AT_data_member_location: 52
 <2><83f>: Abbrev Number: 7 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x66e1): tx_thread_suspending
    <844>   DW_AT_decl_file   : 4
    <845>   DW_AT_decl_line   : 386
    <847>   DW_AT_decl_column : 25
    <848>   DW_AT_type        : <0x6b4>
    <84c>   DW_AT_data_member_location: 56
 <2><84d>: Abbrev Number: 7 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0x2755): tx_thread_preempt_threshold
    <852>   DW_AT_decl_file   : 4
    <853>   DW_AT_decl_line   : 387
    <855>   DW_AT_decl_column : 25
    <856>   DW_AT_type        : <0x6b4>
    <85a>   DW_AT_data_member_location: 60
 <2><85b>: Abbrev Number: 7 (DW_TAG_member)
    <85c>   DW_AT_name        : (indirect string, offset: 0x51a3): tx_thread_schedule_hook
    <860>   DW_AT_decl_file   : 4
    <861>   DW_AT_decl_line   : 392
    <863>   DW_AT_decl_column : 27
    <864>   DW_AT_type        : <0x9a6>
    <868>   DW_AT_data_member_location: 64
 <2><869>: Abbrev Number: 7 (DW_TAG_member)
    <86a>   DW_AT_name        : (indirect string, offset: 0x364): tx_thread_entry
    <86e>   DW_AT_decl_file   : 4
    <86f>   DW_AT_decl_line   : 400
    <871>   DW_AT_decl_column : 27
    <872>   DW_AT_type        : <0x748>
    <876>   DW_AT_data_member_location: 68
 <2><877>: Abbrev Number: 7 (DW_TAG_member)
    <878>   DW_AT_name        : (indirect string, offset: 0xe9c): tx_thread_entry_parameter
    <87c>   DW_AT_decl_file   : 4
    <87d>   DW_AT_decl_line   : 401
    <87f>   DW_AT_decl_column : 25
    <880>   DW_AT_type        : <0x6c0>
    <884>   DW_AT_data_member_location: 72
 <2><885>: Abbrev Number: 7 (DW_TAG_member)
    <886>   DW_AT_name        : (indirect string, offset: 0x3a6a): tx_thread_timer
    <88a>   DW_AT_decl_file   : 4
    <88b>   DW_AT_decl_line   : 405
    <88d>   DW_AT_decl_column : 25
    <88e>   DW_AT_type        : <0x75a>
    <892>   DW_AT_data_member_location: 76
 <2><893>: Abbrev Number: 7 (DW_TAG_member)
    <894>   DW_AT_name        : (indirect string, offset: 0x7179): tx_thread_suspend_cleanup
    <898>   DW_AT_decl_file   : 4
    <899>   DW_AT_decl_line   : 411
    <89b>   DW_AT_decl_column : 27
    <89c>   DW_AT_type        : <0x9a6>
    <8a0>   DW_AT_data_member_location: 104
 <2><8a1>: Abbrev Number: 7 (DW_TAG_member)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x7023): tx_thread_suspend_control_block
    <8a6>   DW_AT_decl_file   : 4
    <8a7>   DW_AT_decl_line   : 412
    <8a9>   DW_AT_decl_column : 26
    <8aa>   DW_AT_type        : <0x693>
    <8ae>   DW_AT_data_member_location: 108
 <2><8af>: Abbrev Number: 7 (DW_TAG_member)
    <8b0>   DW_AT_name        : (indirect string, offset: 0x6bee): tx_thread_suspended_next
    <8b4>   DW_AT_decl_file   : 4
    <8b5>   DW_AT_decl_line   : 414
    <8b7>   DW_AT_decl_column : 26
    <8b8>   DW_AT_type        : <0x990>
    <8bc>   DW_AT_data_member_location: 112
 <2><8bd>: Abbrev Number: 7 (DW_TAG_member)
    <8be>   DW_AT_name        : (indirect string, offset: 0x4202): tx_thread_suspended_previous
    <8c2>   DW_AT_decl_file   : 4
    <8c3>   DW_AT_decl_line   : 415
    <8c5>   DW_AT_decl_column : 26
    <8c6>   DW_AT_type        : <0x990>
    <8ca>   DW_AT_data_member_location: 116
 <2><8cb>: Abbrev Number: 7 (DW_TAG_member)
    <8cc>   DW_AT_name        : (indirect string, offset: 0x76a1): tx_thread_suspend_info
    <8d0>   DW_AT_decl_file   : 4
    <8d1>   DW_AT_decl_line   : 416
    <8d3>   DW_AT_decl_column : 25
    <8d4>   DW_AT_type        : <0x6c0>
    <8d8>   DW_AT_data_member_location: 120
 <2><8d9>: Abbrev Number: 7 (DW_TAG_member)
    <8da>   DW_AT_name        : (indirect string, offset: 0x7e81): tx_thread_additional_suspend_info
    <8de>   DW_AT_decl_file   : 4
    <8df>   DW_AT_decl_line   : 417
    <8e1>   DW_AT_decl_column : 26
    <8e2>   DW_AT_type        : <0x693>
    <8e6>   DW_AT_data_member_location: 124
 <2><8e7>: Abbrev Number: 7 (DW_TAG_member)
    <8e8>   DW_AT_name        : (indirect string, offset: 0x239e): tx_thread_suspend_option
    <8ec>   DW_AT_decl_file   : 4
    <8ed>   DW_AT_decl_line   : 418
    <8ef>   DW_AT_decl_column : 25
    <8f0>   DW_AT_type        : <0x6b4>
    <8f4>   DW_AT_data_member_location: 128
 <2><8f5>: Abbrev Number: 7 (DW_TAG_member)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x2136): tx_thread_suspend_status
    <8fa>   DW_AT_decl_file   : 4
    <8fb>   DW_AT_decl_line   : 419
    <8fd>   DW_AT_decl_column : 25
    <8fe>   DW_AT_type        : <0x6b4>
    <902>   DW_AT_data_member_location: 132
 <2><903>: Abbrev Number: 7 (DW_TAG_member)
    <904>   DW_AT_name        : (indirect string, offset: 0xc27): tx_thread_created_next
    <908>   DW_AT_decl_file   : 4
    <909>   DW_AT_decl_line   : 428
    <90b>   DW_AT_decl_column : 26
    <90c>   DW_AT_type        : <0x990>
    <910>   DW_AT_data_member_location: 136
 <2><911>: Abbrev Number: 7 (DW_TAG_member)
    <912>   DW_AT_name        : (indirect string, offset: 0x3933): tx_thread_created_previous
    <916>   DW_AT_decl_file   : 4
    <917>   DW_AT_decl_line   : 429
    <919>   DW_AT_decl_column : 26
    <91a>   DW_AT_type        : <0x990>
    <91e>   DW_AT_data_member_location: 140
 <2><91f>: Abbrev Number: 7 (DW_TAG_member)
    <920>   DW_AT_name        : (indirect string, offset: 0x1942): tx_thread_filex_ptr
    <924>   DW_AT_decl_file   : 4
    <925>   DW_AT_decl_line   : 437
    <927>   DW_AT_decl_column : 26
    <928>   DW_AT_type        : <0x693>
    <92c>   DW_AT_data_member_location: 144
 <2><92d>: Abbrev Number: 7 (DW_TAG_member)
    <92e>   DW_AT_name        : (indirect string, offset: 0x37a8): tx_thread_user_priority
    <932>   DW_AT_decl_file   : 4
    <933>   DW_AT_decl_line   : 443
    <935>   DW_AT_decl_column : 25
    <936>   DW_AT_type        : <0x6b4>
    <93a>   DW_AT_data_member_location: 148
 <2><93b>: Abbrev Number: 7 (DW_TAG_member)
    <93c>   DW_AT_name        : (indirect string, offset: 0xfd): tx_thread_user_preempt_threshold
    <940>   DW_AT_decl_file   : 4
    <941>   DW_AT_decl_line   : 444
    <943>   DW_AT_decl_column : 25
    <944>   DW_AT_type        : <0x6b4>
    <948>   DW_AT_data_member_location: 152
 <2><949>: Abbrev Number: 7 (DW_TAG_member)
    <94a>   DW_AT_name        : (indirect string, offset: 0x6082): tx_thread_inherit_priority
    <94e>   DW_AT_decl_file   : 4
    <94f>   DW_AT_decl_line   : 445
    <951>   DW_AT_decl_column : 25
    <952>   DW_AT_type        : <0x6b4>
    <956>   DW_AT_data_member_location: 156
 <2><957>: Abbrev Number: 7 (DW_TAG_member)
    <958>   DW_AT_name        : (indirect string, offset: 0x1831): tx_thread_owned_mutex_count
    <95c>   DW_AT_decl_file   : 4
    <95d>   DW_AT_decl_line   : 448
    <95f>   DW_AT_decl_column : 25
    <960>   DW_AT_type        : <0x6b4>
    <964>   DW_AT_data_member_location: 160
 <2><965>: Abbrev Number: 7 (DW_TAG_member)
    <966>   DW_AT_name        : (indirect string, offset: 0x53f1): tx_thread_owned_mutex_list
    <96a>   DW_AT_decl_file   : 4
    <96b>   DW_AT_decl_line   : 450
    <96d>   DW_AT_decl_column : 26
    <96e>   DW_AT_type        : <0xa71>
    <972>   DW_AT_data_member_location: 164
 <2><973>: Abbrev Number: 7 (DW_TAG_member)
    <974>   DW_AT_name        : (indirect string, offset: 0x2523): tx_thread_stack_highest_ptr
    <978>   DW_AT_decl_file   : 4
    <979>   DW_AT_decl_line   : 490
    <97b>   DW_AT_decl_column : 26
    <97c>   DW_AT_type        : <0x693>
    <980>   DW_AT_data_member_location: 168
 <2><981>: Abbrev Number: 7 (DW_TAG_member)
    <982>   DW_AT_name        : (indirect string, offset: 0x15dc): tx_thread_suspension_sequence
    <986>   DW_AT_decl_file   : 4
    <987>   DW_AT_decl_line   : 517
    <989>   DW_AT_decl_column : 25
    <98a>   DW_AT_type        : <0x6c0>
    <98e>   DW_AT_data_member_location: 172
 <2><98f>: Abbrev Number: 0
 <1><990>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <991>   DW_AT_byte_size   : 4
    <992>   DW_AT_type        : <0x76d>
 <1><996>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <997>   DW_AT_prototyped  : 1
    <997>   DW_AT_sibling     : <0x9a6>
 <2><99b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <99c>   DW_AT_type        : <0x990>
 <2><9a0>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <9a1>   DW_AT_type        : <0x6c0>
 <2><9a5>: Abbrev Number: 0
 <1><9a6>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <9a7>   DW_AT_byte_size   : 4
    <9a8>   DW_AT_type        : <0x996>
 <1><9ac>: Abbrev Number: 6 (DW_TAG_structure_type)
    <9ad>   DW_AT_name        : (indirect string, offset: 0x1d1d): TX_MUTEX_STRUCT
    <9b1>   DW_AT_byte_size   : 52
    <9b2>   DW_AT_decl_file   : 4
    <9b3>   DW_AT_decl_line   : 773
    <9b5>   DW_AT_decl_column : 16
    <9b6>   DW_AT_sibling     : <0xa71>
 <2><9ba>: Abbrev Number: 7 (DW_TAG_member)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x4af3): tx_mutex_id
    <9bf>   DW_AT_decl_file   : 4
    <9c0>   DW_AT_decl_line   : 777
    <9c2>   DW_AT_decl_column : 25
    <9c3>   DW_AT_type        : <0x6c0>
    <9c7>   DW_AT_data_member_location: 0
 <2><9c8>: Abbrev Number: 7 (DW_TAG_member)
    <9c9>   DW_AT_name        : (indirect string, offset: 0x719d): tx_mutex_name
    <9cd>   DW_AT_decl_file   : 4
    <9ce>   DW_AT_decl_line   : 780
    <9d0>   DW_AT_decl_column : 26
    <9d1>   DW_AT_type        : <0x767>
    <9d5>   DW_AT_data_member_location: 4
 <2><9d6>: Abbrev Number: 7 (DW_TAG_member)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x10a9): tx_mutex_ownership_count
    <9db>   DW_AT_decl_file   : 4
    <9dc>   DW_AT_decl_line   : 783
    <9de>   DW_AT_decl_column : 25
    <9df>   DW_AT_type        : <0x6b4>
    <9e3>   DW_AT_data_member_location: 8
 <2><9e4>: Abbrev Number: 7 (DW_TAG_member)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x5662): tx_mutex_owner
    <9e9>   DW_AT_decl_file   : 4
    <9ea>   DW_AT_decl_line   : 787
    <9ec>   DW_AT_decl_column : 26
    <9ed>   DW_AT_type        : <0xb62>
    <9f1>   DW_AT_data_member_location: 12
 <2><9f2>: Abbrev Number: 7 (DW_TAG_member)
    <9f3>   DW_AT_name        : (indirect string, offset: 0xa2f3): tx_mutex_inherit
    <9f7>   DW_AT_decl_file   : 4
    <9f8>   DW_AT_decl_line   : 791
    <9fa>   DW_AT_decl_column : 25
    <9fb>   DW_AT_type        : <0x6b4>
    <9ff>   DW_AT_data_member_location: 16
 <2><a00>: Abbrev Number: 7 (DW_TAG_member)
    <a01>   DW_AT_name        : (indirect string, offset: 0x63d6): tx_mutex_original_priority
    <a05>   DW_AT_decl_file   : 4
    <a06>   DW_AT_decl_line   : 794
    <a08>   DW_AT_decl_column : 25
    <a09>   DW_AT_type        : <0x6b4>
    <a0d>   DW_AT_data_member_location: 20
 <2><a0e>: Abbrev Number: 7 (DW_TAG_member)
    <a0f>   DW_AT_name        : (indirect string, offset: 0x16cb): tx_mutex_suspension_list
    <a13>   DW_AT_decl_file   : 4
    <a14>   DW_AT_decl_line   : 799
    <a16>   DW_AT_decl_column : 26
    <a17>   DW_AT_type        : <0x990>
    <a1b>   DW_AT_data_member_location: 24
 <2><a1c>: Abbrev Number: 7 (DW_TAG_member)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x7892): tx_mutex_suspended_count
    <a21>   DW_AT_decl_file   : 4
    <a22>   DW_AT_decl_line   : 800
    <a24>   DW_AT_decl_column : 25
    <a25>   DW_AT_type        : <0x6b4>
    <a29>   DW_AT_data_member_location: 28
 <2><a2a>: Abbrev Number: 7 (DW_TAG_member)
    <a2b>   DW_AT_name        : (indirect string, offset: 0x8283): tx_mutex_created_next
    <a2f>   DW_AT_decl_file   : 4
    <a30>   DW_AT_decl_line   : 804
    <a32>   DW_AT_decl_column : 26
    <a33>   DW_AT_type        : <0xa71>
    <a37>   DW_AT_data_member_location: 32
 <2><a38>: Abbrev Number: 7 (DW_TAG_member)
    <a39>   DW_AT_name        : (indirect string, offset: 0x7a9): tx_mutex_created_previous
    <a3d>   DW_AT_decl_file   : 4
    <a3e>   DW_AT_decl_line   : 805
    <a40>   DW_AT_decl_column : 26
    <a41>   DW_AT_type        : <0xa71>
    <a45>   DW_AT_data_member_location: 36
 <2><a46>: Abbrev Number: 7 (DW_TAG_member)
    <a47>   DW_AT_name        : (indirect string, offset: 0x22c7): tx_mutex_highest_priority_waiting
    <a4b>   DW_AT_decl_file   : 4
    <a4c>   DW_AT_decl_line   : 809
    <a4e>   DW_AT_decl_column : 25
    <a4f>   DW_AT_type        : <0x6b4>
    <a53>   DW_AT_data_member_location: 40
 <2><a54>: Abbrev Number: 7 (DW_TAG_member)
    <a55>   DW_AT_name        : (indirect string, offset: 0x92ef): tx_mutex_owned_next
    <a59>   DW_AT_decl_file   : 4
    <a5a>   DW_AT_decl_line   : 813
    <a5c>   DW_AT_decl_column : 26
    <a5d>   DW_AT_type        : <0xa71>
    <a61>   DW_AT_data_member_location: 44
 <2><a62>: Abbrev Number: 7 (DW_TAG_member)
    <a63>   DW_AT_name        : (indirect string, offset: 0xa115): tx_mutex_owned_previous
    <a67>   DW_AT_decl_file   : 4
    <a68>   DW_AT_decl_line   : 814
    <a6a>   DW_AT_decl_column : 26
    <a6b>   DW_AT_type        : <0xa71>
    <a6f>   DW_AT_data_member_location: 48
 <2><a70>: Abbrev Number: 0
 <1><a71>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <a72>   DW_AT_byte_size   : 4
    <a73>   DW_AT_type        : <0x9ac>
 <1><a77>: Abbrev Number: 11 (DW_TAG_typedef)
    <a78>   DW_AT_name        : (indirect string, offset: 0x6de7): TX_THREAD
    <a7c>   DW_AT_decl_file   : 4
    <a7d>   DW_AT_decl_line   : 525
    <a7f>   DW_AT_decl_column : 3
    <a80>   DW_AT_type        : <0x76d>
 <1><a84>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <a85>   DW_AT_byte_size   : 4
    <a86>   DW_AT_type        : <0x6a8>
 <1><a8a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a8b>   DW_AT_name        : (indirect string, offset: 0x48a6): TX_BYTE_POOL_STRUCT
    <a8f>   DW_AT_byte_size   : 52
    <a90>   DW_AT_decl_file   : 4
    <a91>   DW_AT_decl_line   : 608
    <a93>   DW_AT_decl_column : 16
    <a94>   DW_AT_sibling     : <0xb4f>
 <2><a98>: Abbrev Number: 7 (DW_TAG_member)
    <a99>   DW_AT_name        : (indirect string, offset: 0x1821): tx_byte_pool_id
    <a9d>   DW_AT_decl_file   : 4
    <a9e>   DW_AT_decl_line   : 612
    <aa0>   DW_AT_decl_column : 25
    <aa1>   DW_AT_type        : <0x6c0>
    <aa5>   DW_AT_data_member_location: 0
 <2><aa6>: Abbrev Number: 7 (DW_TAG_member)
    <aa7>   DW_AT_name        : (indirect string, offset: 0x643d): tx_byte_pool_name
    <aab>   DW_AT_decl_file   : 4
    <aac>   DW_AT_decl_line   : 615
    <aae>   DW_AT_decl_column : 26
    <aaf>   DW_AT_type        : <0x767>
    <ab3>   DW_AT_data_member_location: 4
 <2><ab4>: Abbrev Number: 7 (DW_TAG_member)
    <ab5>   DW_AT_name        : (indirect string, offset: 0x7c3): tx_byte_pool_available
    <ab9>   DW_AT_decl_file   : 4
    <aba>   DW_AT_decl_line   : 618
    <abc>   DW_AT_decl_column : 25
    <abd>   DW_AT_type        : <0x6c0>
    <ac1>   DW_AT_data_member_location: 8
 <2><ac2>: Abbrev Number: 7 (DW_TAG_member)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x7d0e): tx_byte_pool_fragments
    <ac7>   DW_AT_decl_file   : 4
    <ac8>   DW_AT_decl_line   : 621
    <aca>   DW_AT_decl_column : 25
    <acb>   DW_AT_type        : <0x6b4>
    <acf>   DW_AT_data_member_location: 12
 <2><ad0>: Abbrev Number: 7 (DW_TAG_member)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x4253): tx_byte_pool_list
    <ad5>   DW_AT_decl_file   : 4
    <ad6>   DW_AT_decl_line   : 624
    <ad8>   DW_AT_decl_column : 26
    <ad9>   DW_AT_type        : <0xa84>
    <add>   DW_AT_data_member_location: 16
 <2><ade>: Abbrev Number: 7 (DW_TAG_member)
    <adf>   DW_AT_name        : (indirect string, offset: 0x6cfd): tx_byte_pool_search
    <ae3>   DW_AT_decl_file   : 4
    <ae4>   DW_AT_decl_line   : 628
    <ae6>   DW_AT_decl_column : 26
    <ae7>   DW_AT_type        : <0xa84>
    <aeb>   DW_AT_data_member_location: 20
 <2><aec>: Abbrev Number: 7 (DW_TAG_member)
    <aed>   DW_AT_name        : (indirect string, offset: 0x7cfb): tx_byte_pool_start
    <af1>   DW_AT_decl_file   : 4
    <af2>   DW_AT_decl_line   : 631
    <af4>   DW_AT_decl_column : 26
    <af5>   DW_AT_type        : <0xa84>
    <af9>   DW_AT_data_member_location: 24
 <2><afa>: Abbrev Number: 7 (DW_TAG_member)
    <afb>   DW_AT_name        : (indirect string, offset: 0x16b9): tx_byte_pool_size
    <aff>   DW_AT_decl_file   : 4
    <b00>   DW_AT_decl_line   : 634
    <b02>   DW_AT_decl_column : 25
    <b03>   DW_AT_type        : <0x6c0>
    <b07>   DW_AT_data_member_location: 28
 <2><b08>: Abbrev Number: 7 (DW_TAG_member)
    <b09>   DW_AT_name        : (indirect string, offset: 0x41ef): tx_byte_pool_owner
    <b0d>   DW_AT_decl_file   : 4
    <b0e>   DW_AT_decl_line   : 640
    <b10>   DW_AT_decl_column : 26
    <b11>   DW_AT_type        : <0x990>
    <b15>   DW_AT_data_member_location: 32
 <2><b16>: Abbrev Number: 7 (DW_TAG_member)
    <b17>   DW_AT_name        : (indirect string, offset: 0x9044): tx_byte_pool_suspension_list
    <b1b>   DW_AT_decl_file   : 4
    <b1c>   DW_AT_decl_line   : 645
    <b1e>   DW_AT_decl_column : 26
    <b1f>   DW_AT_type        : <0x990>
    <b23>   DW_AT_data_member_location: 36
 <2><b24>: Abbrev Number: 7 (DW_TAG_member)
    <b25>   DW_AT_name        : (indirect string, offset: 0x7781): tx_byte_pool_suspended_count
    <b29>   DW_AT_decl_file   : 4
    <b2a>   DW_AT_decl_line   : 646
    <b2c>   DW_AT_decl_column : 25
    <b2d>   DW_AT_type        : <0x6b4>
    <b31>   DW_AT_data_member_location: 40
 <2><b32>: Abbrev Number: 7 (DW_TAG_member)
    <b33>   DW_AT_name        : (indirect string, offset: 0x65b): tx_byte_pool_created_next
    <b37>   DW_AT_decl_file   : 4
    <b38>   DW_AT_decl_line   : 650
    <b3a>   DW_AT_decl_column : 26
    <b3b>   DW_AT_type        : <0xb4f>
    <b3f>   DW_AT_data_member_location: 44
 <2><b40>: Abbrev Number: 7 (DW_TAG_member)
    <b41>   DW_AT_name        : (indirect string, offset: 0x7d25): tx_byte_pool_created_previous
    <b45>   DW_AT_decl_file   : 4
    <b46>   DW_AT_decl_line   : 651
    <b48>   DW_AT_decl_column : 26
    <b49>   DW_AT_type        : <0xb4f>
    <b4d>   DW_AT_data_member_location: 48
 <2><b4e>: Abbrev Number: 0
 <1><b4f>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <b50>   DW_AT_byte_size   : 4
    <b51>   DW_AT_type        : <0xa8a>
 <1><b55>: Abbrev Number: 11 (DW_TAG_typedef)
    <b56>   DW_AT_name        : (indirect string, offset: 0x30): TX_BYTE_POOL
    <b5a>   DW_AT_decl_file   : 4
    <b5b>   DW_AT_decl_line   : 682
    <b5d>   DW_AT_decl_column : 3
    <b5e>   DW_AT_type        : <0xa8a>
 <1><b62>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <b63>   DW_AT_byte_size   : 4
    <b64>   DW_AT_type        : <0xa77>
 <1><b68>: Abbrev Number: 4 (DW_TAG_typedef)
    <b69>   DW_AT_name        : (indirect string, offset: 0x448c1): uint8_t
    <b6d>   DW_AT_decl_file   : 5
    <b6e>   DW_AT_decl_line   : 24
    <b6f>   DW_AT_decl_column : 19
    <b70>   DW_AT_type        : <0x645>
 <1><b74>: Abbrev Number: 4 (DW_TAG_typedef)
    <b75>   DW_AT_name        : (indirect string, offset: 0xb0db4): uint16_t
    <b79>   DW_AT_decl_file   : 5
    <b7a>   DW_AT_decl_line   : 36
    <b7b>   DW_AT_decl_column : 20
    <b7c>   DW_AT_type        : <0x65f>
 <1><b80>: Abbrev Number: 4 (DW_TAG_typedef)
    <b81>   DW_AT_name        : (indirect string, offset: 0x8c762): uint32_t
    <b85>   DW_AT_decl_file   : 5
    <b86>   DW_AT_decl_line   : 48
    <b87>   DW_AT_decl_column : 20
    <b88>   DW_AT_type        : <0x679>
 <1><b8c>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <b8d>   DW_AT_type        : <0xb80>
 <1><b91>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b92>   DW_AT_byte_size   : 44
    <b93>   DW_AT_decl_file   : 6
    <b94>   DW_AT_decl_line   : 494
    <b96>   DW_AT_decl_column : 9
    <b97>   DW_AT_sibling     : <0xc28>
 <2><b9b>: Abbrev Number: 7 (DW_TAG_member)
    <b9c>   DW_AT_name        : (indirect string, offset: 0xc0a7): MODER
    <ba0>   DW_AT_decl_file   : 6
    <ba1>   DW_AT_decl_line   : 496
    <ba3>   DW_AT_decl_column : 17
    <ba4>   DW_AT_type        : <0xb8c>
    <ba8>   DW_AT_data_member_location: 0
 <2><ba9>: Abbrev Number: 7 (DW_TAG_member)
    <baa>   DW_AT_name        : (indirect string, offset: 0xa8167): OTYPER
    <bae>   DW_AT_decl_file   : 6
    <baf>   DW_AT_decl_line   : 497
    <bb1>   DW_AT_decl_column : 17
    <bb2>   DW_AT_type        : <0xb8c>
    <bb6>   DW_AT_data_member_location: 4
 <2><bb7>: Abbrev Number: 7 (DW_TAG_member)
    <bb8>   DW_AT_name        : (indirect string, offset: 0xbb9b3): OSPEEDR
    <bbc>   DW_AT_decl_file   : 6
    <bbd>   DW_AT_decl_line   : 498
    <bbf>   DW_AT_decl_column : 17
    <bc0>   DW_AT_type        : <0xb8c>
    <bc4>   DW_AT_data_member_location: 8
 <2><bc5>: Abbrev Number: 7 (DW_TAG_member)
    <bc6>   DW_AT_name        : (indirect string, offset: 0x8e9aa): PUPDR
    <bca>   DW_AT_decl_file   : 6
    <bcb>   DW_AT_decl_line   : 499
    <bcd>   DW_AT_decl_column : 17
    <bce>   DW_AT_type        : <0xb8c>
    <bd2>   DW_AT_data_member_location: 12
 <2><bd3>: Abbrev Number: 14 (DW_TAG_member)
    <bd4>   DW_AT_name        : IDR
    <bd8>   DW_AT_decl_file   : 6
    <bd9>   DW_AT_decl_line   : 500
    <bdb>   DW_AT_decl_column : 17
    <bdc>   DW_AT_type        : <0xb8c>
    <be0>   DW_AT_data_member_location: 16
 <2><be1>: Abbrev Number: 14 (DW_TAG_member)
    <be2>   DW_AT_name        : ODR
    <be6>   DW_AT_decl_file   : 6
    <be7>   DW_AT_decl_line   : 501
    <be9>   DW_AT_decl_column : 17
    <bea>   DW_AT_type        : <0xb8c>
    <bee>   DW_AT_data_member_location: 20
 <2><bef>: Abbrev Number: 7 (DW_TAG_member)
    <bf0>   DW_AT_name        : (indirect string, offset: 0x37655): BSRR
    <bf4>   DW_AT_decl_file   : 6
    <bf5>   DW_AT_decl_line   : 502
    <bf7>   DW_AT_decl_column : 17
    <bf8>   DW_AT_type        : <0xb8c>
    <bfc>   DW_AT_data_member_location: 24
 <2><bfd>: Abbrev Number: 7 (DW_TAG_member)
    <bfe>   DW_AT_name        : (indirect string, offset: 0xb91dd): LCKR
    <c02>   DW_AT_decl_file   : 6
    <c03>   DW_AT_decl_line   : 503
    <c05>   DW_AT_decl_column : 17
    <c06>   DW_AT_type        : <0xb8c>
    <c0a>   DW_AT_data_member_location: 28
 <2><c0b>: Abbrev Number: 14 (DW_TAG_member)
    <c0c>   DW_AT_name        : AFR
    <c10>   DW_AT_decl_file   : 6
    <c11>   DW_AT_decl_line   : 504
    <c13>   DW_AT_decl_column : 17
    <c14>   DW_AT_type        : <0xc38>
    <c18>   DW_AT_data_member_location: 32
 <2><c19>: Abbrev Number: 14 (DW_TAG_member)
    <c1a>   DW_AT_name        : BRR
    <c1e>   DW_AT_decl_file   : 6
    <c1f>   DW_AT_decl_line   : 505
    <c21>   DW_AT_decl_column : 17
    <c22>   DW_AT_type        : <0xb8c>
    <c26>   DW_AT_data_member_location: 40
 <2><c27>: Abbrev Number: 0
 <1><c28>: Abbrev Number: 15 (DW_TAG_array_type)
    <c29>   DW_AT_type        : <0xb8c>
    <c2d>   DW_AT_sibling     : <0xc38>
 <2><c31>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <c32>   DW_AT_type        : <0x622>
    <c36>   DW_AT_upper_bound : 1
 <2><c37>: Abbrev Number: 0
 <1><c38>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <c39>   DW_AT_type        : <0xc28>
 <1><c3d>: Abbrev Number: 11 (DW_TAG_typedef)
    <c3e>   DW_AT_name        : (indirect string, offset: 0xd03f7): GPIO_TypeDef
    <c42>   DW_AT_decl_file   : 6
    <c43>   DW_AT_decl_line   : 507
    <c45>   DW_AT_decl_column : 3
    <c46>   DW_AT_type        : <0xb91>
 <1><c4a>: Abbrev Number: 15 (DW_TAG_array_type)
    <c4b>   DW_AT_type        : <0xb68>
    <c4f>   DW_AT_sibling     : <0xc5b>
 <2><c53>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <c54>   DW_AT_type        : <0x622>
    <c58>   DW_AT_upper_bound : 3999
 <2><c5a>: Abbrev Number: 0
 <1><c5b>: Abbrev Number: 18 (DW_TAG_variable)
    <c5c>   DW_AT_name        : (indirect string, offset: 0x75ec9): tracex_buffer
    <c60>   DW_AT_decl_file   : 1
    <c61>   DW_AT_decl_line   : 50
    <c62>   DW_AT_decl_column : 9
    <c63>   DW_AT_type        : <0xc4a>
    <c67>   DW_AT_external    : 1
    <c67>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><c6d>: Abbrev Number: 15 (DW_TAG_array_type)
    <c6e>   DW_AT_type        : <0xb68>
    <c72>   DW_AT_sibling     : <0xc7e>
 <2><c76>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <c77>   DW_AT_type        : <0x622>
    <c7b>   DW_AT_upper_bound : 1023
 <2><c7d>: Abbrev Number: 0
 <1><c7e>: Abbrev Number: 18 (DW_TAG_variable)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x1a1d3): led_thread_stack
    <c83>   DW_AT_decl_file   : 1
    <c84>   DW_AT_decl_line   : 51
    <c85>   DW_AT_decl_column : 9
    <c86>   DW_AT_type        : <0xc6d>
    <c8a>   DW_AT_external    : 1
    <c8a>   DW_AT_location    : 5 byte block: 3 0 14 0 20 	(DW_OP_addr: 20001400)
 <1><c90>: Abbrev Number: 18 (DW_TAG_variable)
    <c91>   DW_AT_name        : (indirect string, offset: 0x70f70): led_thread
    <c95>   DW_AT_decl_file   : 1
    <c96>   DW_AT_decl_line   : 52
    <c97>   DW_AT_decl_column : 11
    <c98>   DW_AT_type        : <0xa77>
    <c9c>   DW_AT_external    : 1
    <c9c>   DW_AT_location    : 5 byte block: 3 0 18 0 20 	(DW_OP_addr: 20001800)
 <1><ca2>: Abbrev Number: 19 (DW_TAG_subprogram)
    <ca3>   DW_AT_external    : 1
    <ca3>   DW_AT_name        : (indirect string, offset: 0x3cd9): _tx_thread_sleep
    <ca7>   DW_AT_decl_file   : 4
    <ca8>   DW_AT_decl_line   : 1654
    <caa>   DW_AT_decl_column : 13
    <cab>   DW_AT_prototyped  : 1
    <cab>   DW_AT_type        : <0x6b4>
    <caf>   DW_AT_declaration : 1
    <caf>   DW_AT_sibling     : <0xcb9>
 <2><cb3>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <cb4>   DW_AT_type        : <0x6c0>
 <2><cb8>: Abbrev Number: 0
 <1><cb9>: Abbrev Number: 20 (DW_TAG_subprogram)
    <cba>   DW_AT_external    : 1
    <cba>   DW_AT_name        : (indirect string, offset: 0x473eb): HAL_GPIO_TogglePin
    <cbe>   DW_AT_decl_file   : 7
    <cbf>   DW_AT_decl_line   : 297
    <cc1>   DW_AT_decl_column : 19
    <cc2>   DW_AT_prototyped  : 1
    <cc2>   DW_AT_declaration : 1
    <cc2>   DW_AT_sibling     : <0xcd1>
 <2><cc6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <cc7>   DW_AT_type        : <0xcd1>
 <2><ccb>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <ccc>   DW_AT_type        : <0xb74>
 <2><cd0>: Abbrev Number: 0
 <1><cd1>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <cd2>   DW_AT_byte_size   : 4
    <cd3>   DW_AT_type        : <0xc3d>
 <1><cd7>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cd8>   DW_AT_external    : 1
    <cd8>   DW_AT_name        : (indirect string, offset: 0x3880): _tx_initialize_kernel_enter
    <cdc>   DW_AT_decl_file   : 4
    <cdd>   DW_AT_decl_line   : 1490
    <cdf>   DW_AT_decl_column : 13
    <ce0>   DW_AT_prototyped  : 1
    <ce0>   DW_AT_declaration : 1
 <1><ce0>: Abbrev Number: 19 (DW_TAG_subprogram)
    <ce1>   DW_AT_external    : 1
    <ce1>   DW_AT_name        : (indirect string, offset: 0x14e0): _tx_trace_enable
    <ce5>   DW_AT_decl_file   : 4
    <ce6>   DW_AT_decl_line   : 1757
    <ce8>   DW_AT_decl_column : 13
    <ce9>   DW_AT_prototyped  : 1
    <ce9>   DW_AT_type        : <0x6b4>
    <ced>   DW_AT_declaration : 1
    <ced>   DW_AT_sibling     : <0xd01>
 <2><cf1>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <cf2>   DW_AT_type        : <0x693>
 <2><cf6>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <cf7>   DW_AT_type        : <0x6c0>
 <2><cfb>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <cfc>   DW_AT_type        : <0x6c0>
 <2><d00>: Abbrev Number: 0
 <1><d01>: Abbrev Number: 19 (DW_TAG_subprogram)
    <d02>   DW_AT_external    : 1
    <d02>   DW_AT_name        : (indirect string, offset: 0x27257): _txe_thread_create
    <d06>   DW_AT_decl_file   : 4
    <d07>   DW_AT_decl_line   : 1665
    <d09>   DW_AT_decl_column : 13
    <d0a>   DW_AT_prototyped  : 1
    <d0a>   DW_AT_type        : <0x6b4>
    <d0e>   DW_AT_declaration : 1
    <d0e>   DW_AT_sibling     : <0xd4a>
 <2><d12>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d13>   DW_AT_type        : <0xb62>
 <2><d17>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d18>   DW_AT_type        : <0x767>
 <2><d1c>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d1d>   DW_AT_type        : <0x748>
 <2><d21>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d22>   DW_AT_type        : <0x6c0>
 <2><d26>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d27>   DW_AT_type        : <0x693>
 <2><d2b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d2c>   DW_AT_type        : <0x6c0>
 <2><d30>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d31>   DW_AT_type        : <0x6b4>
 <2><d35>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d36>   DW_AT_type        : <0x6b4>
 <2><d3a>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d3b>   DW_AT_type        : <0x6c0>
 <2><d3f>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d40>   DW_AT_type        : <0x6b4>
 <2><d44>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <d45>   DW_AT_type        : <0x6b4>
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 22 (DW_TAG_subprogram)
    <d4b>   DW_AT_external    : 1
    <d4b>   DW_AT_name        : (indirect string, offset: 0x3cd4b): led_thread_entry
    <d4f>   DW_AT_decl_file   : 1
    <d50>   DW_AT_decl_line   : 104
    <d51>   DW_AT_decl_column : 6
    <d52>   DW_AT_prototyped  : 1
    <d52>   DW_AT_low_pc      : 0x80007d0
    <d56>   DW_AT_high_pc     : 0x1a
    <d5a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d5c>   DW_AT_GNU_all_tail_call_sites: 1
    <d5c>   DW_AT_sibling     : <0xd70>
 <2><d60>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d61>   DW_AT_name        : (indirect string, offset: 0xbcffd): initial_input
    <d65>   DW_AT_decl_file   : 1
    <d66>   DW_AT_decl_line   : 104
    <d67>   DW_AT_decl_column : 29
    <d68>   DW_AT_type        : <0x6c0>
    <d6c>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><d6f>: Abbrev Number: 0
 <1><d70>: Abbrev Number: 24 (DW_TAG_subprogram)
    <d71>   DW_AT_external    : 1
    <d71>   DW_AT_name        : (indirect string, offset: 0x7baeb): MX_ThreadX_Init
    <d75>   DW_AT_decl_file   : 1
    <d76>   DW_AT_decl_line   : 89
    <d77>   DW_AT_decl_column : 6
    <d78>   DW_AT_prototyped  : 1
    <d78>   DW_AT_low_pc      : 0x80007c4
    <d7c>   DW_AT_high_pc     : 0xc
    <d80>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d82>   DW_AT_GNU_all_tail_call_sites: 1
 <1><d82>: Abbrev Number: 25 (DW_TAG_subprogram)
    <d83>   DW_AT_external    : 1
    <d83>   DW_AT_name        : (indirect string, offset: 0x6d4a): App_ThreadX_Init
    <d87>   DW_AT_decl_file   : 1
    <d88>   DW_AT_decl_line   : 67
    <d89>   DW_AT_decl_column : 6
    <d8a>   DW_AT_prototyped  : 1
    <d8a>   DW_AT_type        : <0x6b4>
    <d8e>   DW_AT_low_pc      : 0x800075c
    <d92>   DW_AT_high_pc     : 0x68
    <d96>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d98>   DW_AT_GNU_all_tail_call_sites: 1
    <d98>   DW_AT_sibling     : <0xdca>
 <2><d9c>: Abbrev Number: 23 (DW_TAG_formal_parameter)
    <d9d>   DW_AT_name        : (indirect string, offset: 0x4283): memory_ptr
    <da1>   DW_AT_decl_file   : 1
    <da2>   DW_AT_decl_line   : 67
    <da3>   DW_AT_decl_column : 29
    <da4>   DW_AT_type        : <0x693>
    <da8>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><dab>: Abbrev Number: 26 (DW_TAG_variable)
    <dac>   DW_AT_name        : ret
    <db0>   DW_AT_decl_file   : 1
    <db1>   DW_AT_decl_line   : 69
    <db2>   DW_AT_decl_column : 8
    <db3>   DW_AT_type        : <0x6b4>
    <db7>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><dba>: Abbrev Number: 27 (DW_TAG_variable)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x2018): byte_pool
    <dbf>   DW_AT_decl_file   : 1
    <dc0>   DW_AT_decl_line   : 70
    <dc1>   DW_AT_decl_column : 17
    <dc2>   DW_AT_type        : <0xdca>
    <dc6>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><dc9>: Abbrev Number: 0
 <1><dca>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <dcb>   DW_AT_byte_size   : 4
    <dcc>   DW_AT_type        : <0xb55>
 <1><dd0>: Abbrev Number: 0
  Compilation Unit @ offset 0xdd1:
   Length:        0x1173 (32-bit)
   Version:       4
   Abbrev Offset: 0x2b1
   Pointer Size:  4
 <0><ddc>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <ddd>   DW_AT_producer    : (indirect string, offset: 0x5afe): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <de1>   DW_AT_language    : 12	(ANSI C99)
    <de2>   DW_AT_name        : (indirect string, offset: 0xd76a1): ../Core/Src/main.c
    <de6>   DW_AT_comp_dir    : (indirect string, offset: 0x613): D:/githubs/Nucleo-L452_Azure_RTOS/02_tracex/Debug
    <dea>   DW_AT_ranges      : 0x30
    <dee>   DW_AT_low_pc      : 0x0
    <df2>   DW_AT_stmt_list   : 0xedf
    <df6>   DW_AT_GNU_macros  : 0x21aa2
 <1><dfa>: Abbrev Number: 2 (DW_TAG_base_type)
    <dfb>   DW_AT_byte_size   : 4
    <dfc>   DW_AT_encoding    : 7	(unsigned)
    <dfd>   DW_AT_name        : (indirect string, offset: 0x26aa): unsigned int
 <1><e01>: Abbrev Number: 3 (DW_TAG_base_type)
    <e02>   DW_AT_byte_size   : 4
    <e03>   DW_AT_encoding    : 5	(signed)
    <e04>   DW_AT_name        : int
 <1><e08>: Abbrev Number: 2 (DW_TAG_base_type)
    <e09>   DW_AT_byte_size   : 8
    <e0a>   DW_AT_encoding    : 5	(signed)
    <e0b>   DW_AT_name        : (indirect string, offset: 0x5e15): long long int
 <1><e0f>: Abbrev Number: 2 (DW_TAG_base_type)
    <e10>   DW_AT_byte_size   : 8
    <e11>   DW_AT_encoding    : 4	(float)
    <e12>   DW_AT_name        : (indirect string, offset: 0x39c): long double
 <1><e16>: Abbrev Number: 2 (DW_TAG_base_type)
    <e17>   DW_AT_byte_size   : 1
    <e18>   DW_AT_encoding    : 6	(signed char)
    <e19>   DW_AT_name        : (indirect string, offset: 0x9aa): signed char
 <1><e1d>: Abbrev Number: 4 (DW_TAG_typedef)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x448bf): __uint8_t
    <e22>   DW_AT_decl_file   : 3
    <e23>   DW_AT_decl_line   : 43
    <e24>   DW_AT_decl_column : 24
    <e25>   DW_AT_type        : <0xe29>
 <1><e29>: Abbrev Number: 2 (DW_TAG_base_type)
    <e2a>   DW_AT_byte_size   : 1
    <e2b>   DW_AT_encoding    : 8	(unsigned char)
    <e2c>   DW_AT_name        : (indirect string, offset: 0x3af6): unsigned char
 <1><e30>: Abbrev Number: 2 (DW_TAG_base_type)
    <e31>   DW_AT_byte_size   : 2
    <e32>   DW_AT_encoding    : 5	(signed)
    <e33>   DW_AT_name        : (indirect string, offset: 0xc1d): short int
 <1><e37>: Abbrev Number: 4 (DW_TAG_typedef)
    <e38>   DW_AT_name        : (indirect string, offset: 0xb0db2): __uint16_t
    <e3c>   DW_AT_decl_file   : 3
    <e3d>   DW_AT_decl_line   : 57
    <e3e>   DW_AT_decl_column : 25
    <e3f>   DW_AT_type        : <0xe43>
 <1><e43>: Abbrev Number: 2 (DW_TAG_base_type)
    <e44>   DW_AT_byte_size   : 2
    <e45>   DW_AT_encoding    : 7	(unsigned)
    <e46>   DW_AT_name        : (indirect string, offset: 0x7ac9): short unsigned int
 <1><e4a>: Abbrev Number: 2 (DW_TAG_base_type)
    <e4b>   DW_AT_byte_size   : 4
    <e4c>   DW_AT_encoding    : 5	(signed)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x7ede): long int
 <1><e51>: Abbrev Number: 4 (DW_TAG_typedef)
    <e52>   DW_AT_name        : (indirect string, offset: 0x8c760): __uint32_t
    <e56>   DW_AT_decl_file   : 3
    <e57>   DW_AT_decl_line   : 79
    <e58>   DW_AT_decl_column : 25
    <e59>   DW_AT_type        : <0xe5d>
 <1><e5d>: Abbrev Number: 2 (DW_TAG_base_type)
    <e5e>   DW_AT_byte_size   : 4
    <e5f>   DW_AT_encoding    : 7	(unsigned)
    <e60>   DW_AT_name        : (indirect string, offset: 0x1d7f): long unsigned int
 <1><e64>: Abbrev Number: 2 (DW_TAG_base_type)
    <e65>   DW_AT_byte_size   : 8
    <e66>   DW_AT_encoding    : 7	(unsigned)
    <e67>   DW_AT_name        : (indirect string, offset: 0x2235): long long unsigned int
 <1><e6b>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <e6c>   DW_AT_byte_size   : 4
 <1><e6d>: Abbrev Number: 2 (DW_TAG_base_type)
    <e6e>   DW_AT_byte_size   : 1
    <e6f>   DW_AT_encoding    : 8	(unsigned char)
    <e70>   DW_AT_name        : (indirect string, offset: 0x9b1): char
 <1><e74>: Abbrev Number: 4 (DW_TAG_typedef)
    <e75>   DW_AT_name        : (indirect string, offset: 0x448c1): uint8_t
    <e79>   DW_AT_decl_file   : 4
    <e7a>   DW_AT_decl_line   : 24
    <e7b>   DW_AT_decl_column : 19
    <e7c>   DW_AT_type        : <0xe1d>
 <1><e80>: Abbrev Number: 6 (DW_TAG_const_type)
    <e81>   DW_AT_type        : <0xe74>
 <1><e85>: Abbrev Number: 4 (DW_TAG_typedef)
    <e86>   DW_AT_name        : (indirect string, offset: 0xb0db4): uint16_t
    <e8a>   DW_AT_decl_file   : 4
    <e8b>   DW_AT_decl_line   : 36
    <e8c>   DW_AT_decl_column : 20
    <e8d>   DW_AT_type        : <0xe37>
 <1><e91>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <e92>   DW_AT_type        : <0xe85>
 <1><e96>: Abbrev Number: 4 (DW_TAG_typedef)
    <e97>   DW_AT_name        : (indirect string, offset: 0x8c762): uint32_t
    <e9b>   DW_AT_decl_file   : 4
    <e9c>   DW_AT_decl_line   : 48
    <e9d>   DW_AT_decl_column : 20
    <e9e>   DW_AT_type        : <0xe51>
 <1><ea2>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <ea3>   DW_AT_type        : <0xe96>
 <1><ea7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ea8>   DW_AT_byte_size   : 16
    <ea9>   DW_AT_decl_file   : 5
    <eaa>   DW_AT_decl_line   : 403
    <eac>   DW_AT_decl_column : 9
    <ead>   DW_AT_sibling     : <0xeea>
 <2><eb1>: Abbrev Number: 9 (DW_TAG_member)
    <eb2>   DW_AT_name        : CCR
    <eb6>   DW_AT_decl_file   : 5
    <eb7>   DW_AT_decl_line   : 405
    <eb9>   DW_AT_decl_column : 17
    <eba>   DW_AT_type        : <0xea2>
    <ebe>   DW_AT_data_member_location: 0
 <2><ebf>: Abbrev Number: 10 (DW_TAG_member)
    <ec0>   DW_AT_name        : (indirect string, offset: 0xd6fd9): CNDTR
    <ec4>   DW_AT_decl_file   : 5
    <ec5>   DW_AT_decl_line   : 406
    <ec7>   DW_AT_decl_column : 17
    <ec8>   DW_AT_type        : <0xea2>
    <ecc>   DW_AT_data_member_location: 4
 <2><ecd>: Abbrev Number: 10 (DW_TAG_member)
    <ece>   DW_AT_name        : (indirect string, offset: 0xd77ad): CPAR
    <ed2>   DW_AT_decl_file   : 5
    <ed3>   DW_AT_decl_line   : 407
    <ed5>   DW_AT_decl_column : 17
    <ed6>   DW_AT_type        : <0xea2>
    <eda>   DW_AT_data_member_location: 8
 <2><edb>: Abbrev Number: 10 (DW_TAG_member)
    <edc>   DW_AT_name        : (indirect string, offset: 0xd7239): CMAR
    <ee0>   DW_AT_decl_file   : 5
    <ee1>   DW_AT_decl_line   : 408
    <ee3>   DW_AT_decl_column : 17
    <ee4>   DW_AT_type        : <0xea2>
    <ee8>   DW_AT_data_member_location: 12
 <2><ee9>: Abbrev Number: 0
 <1><eea>: Abbrev Number: 11 (DW_TAG_typedef)
    <eeb>   DW_AT_name        : (indirect string, offset: 0xd778d): DMA_Channel_TypeDef
    <eef>   DW_AT_decl_file   : 5
    <ef0>   DW_AT_decl_line   : 409
    <ef2>   DW_AT_decl_column : 3
    <ef3>   DW_AT_type        : <0xea7>
 <1><ef7>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ef8>   DW_AT_byte_size   : 8
    <ef9>   DW_AT_decl_file   : 5
    <efa>   DW_AT_decl_line   : 411
    <efc>   DW_AT_decl_column : 9
    <efd>   DW_AT_sibling     : <0xf1e>
 <2><f01>: Abbrev Number: 9 (DW_TAG_member)
    <f02>   DW_AT_name        : ISR
    <f06>   DW_AT_decl_file   : 5
    <f07>   DW_AT_decl_line   : 413
    <f09>   DW_AT_decl_column : 17
    <f0a>   DW_AT_type        : <0xea2>
    <f0e>   DW_AT_data_member_location: 0
 <2><f0f>: Abbrev Number: 10 (DW_TAG_member)
    <f10>   DW_AT_name        : (indirect string, offset: 0xd7475): IFCR
    <f14>   DW_AT_decl_file   : 5
    <f15>   DW_AT_decl_line   : 414
    <f17>   DW_AT_decl_column : 17
    <f18>   DW_AT_type        : <0xea2>
    <f1c>   DW_AT_data_member_location: 4
 <2><f1d>: Abbrev Number: 0
 <1><f1e>: Abbrev Number: 11 (DW_TAG_typedef)
    <f1f>   DW_AT_name        : (indirect string, offset: 0xd707e): DMA_TypeDef
    <f23>   DW_AT_decl_file   : 5
    <f24>   DW_AT_decl_line   : 415
    <f26>   DW_AT_decl_column : 3
    <f27>   DW_AT_type        : <0xef7>
 <1><f2b>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f2c>   DW_AT_byte_size   : 44
    <f2d>   DW_AT_decl_file   : 5
    <f2e>   DW_AT_decl_line   : 494
    <f30>   DW_AT_decl_column : 9
    <f31>   DW_AT_sibling     : <0xfc2>
 <2><f35>: Abbrev Number: 10 (DW_TAG_member)
    <f36>   DW_AT_name        : (indirect string, offset: 0xc0a7): MODER
    <f3a>   DW_AT_decl_file   : 5
    <f3b>   DW_AT_decl_line   : 496
    <f3d>   DW_AT_decl_column : 17
    <f3e>   DW_AT_type        : <0xea2>
    <f42>   DW_AT_data_member_location: 0
 <2><f43>: Abbrev Number: 10 (DW_TAG_member)
    <f44>   DW_AT_name        : (indirect string, offset: 0xa8167): OTYPER
    <f48>   DW_AT_decl_file   : 5
    <f49>   DW_AT_decl_line   : 497
    <f4b>   DW_AT_decl_column : 17
    <f4c>   DW_AT_type        : <0xea2>
    <f50>   DW_AT_data_member_location: 4
 <2><f51>: Abbrev Number: 10 (DW_TAG_member)
    <f52>   DW_AT_name        : (indirect string, offset: 0xbb9b3): OSPEEDR
    <f56>   DW_AT_decl_file   : 5
    <f57>   DW_AT_decl_line   : 498
    <f59>   DW_AT_decl_column : 17
    <f5a>   DW_AT_type        : <0xea2>
    <f5e>   DW_AT_data_member_location: 8
 <2><f5f>: Abbrev Number: 10 (DW_TAG_member)
    <f60>   DW_AT_name        : (indirect string, offset: 0x8e9aa): PUPDR
    <f64>   DW_AT_decl_file   : 5
    <f65>   DW_AT_decl_line   : 499
    <f67>   DW_AT_decl_column : 17
    <f68>   DW_AT_type        : <0xea2>
    <f6c>   DW_AT_data_member_location: 12
 <2><f6d>: Abbrev Number: 9 (DW_TAG_member)
    <f6e>   DW_AT_name        : IDR
    <f72>   DW_AT_decl_file   : 5
    <f73>   DW_AT_decl_line   : 500
    <f75>   DW_AT_decl_column : 17
    <f76>   DW_AT_type        : <0xea2>
    <f7a>   DW_AT_data_member_location: 16
 <2><f7b>: Abbrev Number: 9 (DW_TAG_member)
    <f7c>   DW_AT_name        : ODR
    <f80>   DW_AT_decl_file   : 5
    <f81>   DW_AT_decl_line   : 501
    <f83>   DW_AT_decl_column : 17
    <f84>   DW_AT_type        : <0xea2>
    <f88>   DW_AT_data_member_location: 20
 <2><f89>: Abbrev Number: 10 (DW_TAG_member)
    <f8a>   DW_AT_name        : (indirect string, offset: 0x37655): BSRR
    <f8e>   DW_AT_decl_file   : 5
    <f8f>   DW_AT_decl_line   : 502
    <f91>   DW_AT_decl_column : 17
    <f92>   DW_AT_type        : <0xea2>
    <f96>   DW_AT_data_member_location: 24
 <2><f97>: Abbrev Number: 10 (DW_TAG_member)
    <f98>   DW_AT_name        : (indirect string, offset: 0xb91dd): LCKR
    <f9c>   DW_AT_decl_file   : 5
    <f9d>   DW_AT_decl_line   : 503
    <f9f>   DW_AT_decl_column : 17
    <fa0>   DW_AT_type        : <0xea2>
    <fa4>   DW_AT_data_member_location: 28
 <2><fa5>: Abbrev Number: 9 (DW_TAG_member)
    <fa6>   DW_AT_name        : AFR
    <faa>   DW_AT_decl_file   : 5
    <fab>   DW_AT_decl_line   : 504
    <fad>   DW_AT_decl_column : 17
    <fae>   DW_AT_type        : <0xfd2>
    <fb2>   DW_AT_data_member_location: 32
 <2><fb3>: Abbrev Number: 9 (DW_TAG_member)
    <fb4>   DW_AT_name        : BRR
    <fb8>   DW_AT_decl_file   : 5
    <fb9>   DW_AT_decl_line   : 505
    <fbb>   DW_AT_decl_column : 17
    <fbc>   DW_AT_type        : <0xea2>
    <fc0>   DW_AT_data_member_location: 40
 <2><fc1>: Abbrev Number: 0
 <1><fc2>: Abbrev Number: 12 (DW_TAG_array_type)
    <fc3>   DW_AT_type        : <0xea2>
    <fc7>   DW_AT_sibling     : <0xfd2>
 <2><fcb>: Abbrev Number: 13 (DW_TAG_subrange_type)
    <fcc>   DW_AT_type        : <0xdfa>
    <fd0>   DW_AT_upper_bound : 1
 <2><fd1>: Abbrev Number: 0
 <1><fd2>: Abbrev Number: 7 (DW_TAG_volatile_type)
    <fd3>   DW_AT_type        : <0xfc2>
 <1><fd7>: Abbrev Number: 11 (DW_TAG_typedef)
    <fd8>   DW_AT_name        : (indirect string, offset: 0xd03f7): GPIO_TypeDef
    <fdc>   DW_AT_decl_file   : 5
    <fdd>   DW_AT_decl_line   : 507
    <fdf>   DW_AT_decl_column : 3
    <fe0>   DW_AT_type        : <0xf2b>
 <1><fe4>: Abbrev Number: 8 (DW_TAG_structure_type)
    <fe5>   DW_AT_byte_size   : 160
    <fe6>   DW_AT_decl_file   : 5
    <fe7>   DW_AT_decl_line   : 633
    <fe9>   DW_AT_decl_column : 9
    <fea>   DW_AT_sibling     : <0x121e>
 <2><fee>: Abbrev Number: 9 (DW_TAG_member)
    <fef>   DW_AT_name        : CR
    <ff2>   DW_AT_decl_file   : 5
    <ff3>   DW_AT_decl_line   : 635
    <ff5>   DW_AT_decl_column : 17
    <ff6>   DW_AT_type        : <0xea2>
    <ffa>   DW_AT_data_member_location: 0
 <2><ffb>: Abbrev Number: 10 (DW_TAG_member)
    <ffc>   DW_AT_name        : (indirect string, offset: 0xd7419): ICSCR
    <1000>   DW_AT_decl_file   : 5
    <1001>   DW_AT_decl_line   : 636
    <1003>   DW_AT_decl_column : 17
    <1004>   DW_AT_type        : <0xea2>
    <1008>   DW_AT_data_member_location: 4
 <2><1009>: Abbrev Number: 10 (DW_TAG_member)
    <100a>   DW_AT_name        : (indirect string, offset: 0xd703f): CFGR
    <100e>   DW_AT_decl_file   : 5
    <100f>   DW_AT_decl_line   : 637
    <1011>   DW_AT_decl_column : 17
    <1012>   DW_AT_type        : <0xea2>
    <1016>   DW_AT_data_member_location: 8
 <2><1017>: Abbrev Number: 10 (DW_TAG_member)
    <1018>   DW_AT_name        : (indirect string, offset: 0xd748c): PLLCFGR
    <101c>   DW_AT_decl_file   : 5
    <101d>   DW_AT_decl_line   : 638
    <101f>   DW_AT_decl_column : 17
    <1020>   DW_AT_type        : <0xea2>
    <1024>   DW_AT_data_member_location: 12
 <2><1025>: Abbrev Number: 10 (DW_TAG_member)
    <1026>   DW_AT_name        : (indirect string, offset: 0xd7038): PLLSAI1CFGR
    <102a>   DW_AT_decl_file   : 5
    <102b>   DW_AT_decl_line   : 639
    <102d>   DW_AT_decl_column : 17
    <102e>   DW_AT_type        : <0xea2>
    <1032>   DW_AT_data_member_location: 16
 <2><1033>: Abbrev Number: 10 (DW_TAG_member)
    <1034>   DW_AT_name        : (indirect string, offset: 0x858b7): RESERVED
    <1038>   DW_AT_decl_file   : 5
    <1039>   DW_AT_decl_line   : 640
    <103b>   DW_AT_decl_column : 17
    <103c>   DW_AT_type        : <0xe96>
    <1040>   DW_AT_data_member_location: 20
 <2><1041>: Abbrev Number: 10 (DW_TAG_member)
    <1042>   DW_AT_name        : (indirect string, offset: 0xd6dab): CIER
    <1046>   DW_AT_decl_file   : 5
    <1047>   DW_AT_decl_line   : 641
    <1049>   DW_AT_decl_column : 17
    <104a>   DW_AT_type        : <0xea2>
    <104e>   DW_AT_data_member_location: 24
 <2><104f>: Abbrev Number: 10 (DW_TAG_member)
    <1050>   DW_AT_name        : (indirect string, offset: 0xd6da6): CIFR
    <1054>   DW_AT_decl_file   : 5
    <1055>   DW_AT_decl_line   : 642
    <1057>   DW_AT_decl_column : 17
    <1058>   DW_AT_type        : <0xea2>
    <105c>   DW_AT_data_member_location: 28
 <2><105d>: Abbrev Number: 10 (DW_TAG_member)
    <105e>   DW_AT_name        : (indirect string, offset: 0xd6d8f): CICR
    <1062>   DW_AT_decl_file   : 5
    <1063>   DW_AT_decl_line   : 643
    <1065>   DW_AT_decl_column : 17
    <1066>   DW_AT_type        : <0xea2>
    <106a>   DW_AT_data_member_location: 32
 <2><106b>: Abbrev Number: 10 (DW_TAG_member)
    <106c>   DW_AT_name        : (indirect string, offset: 0xd7747): RESERVED0
    <1070>   DW_AT_decl_file   : 5
    <1071>   DW_AT_decl_line   : 644
    <1073>   DW_AT_decl_column : 17
    <1074>   DW_AT_type        : <0xe96>
    <1078>   DW_AT_data_member_location: 36
 <2><1079>: Abbrev Number: 10 (DW_TAG_member)
    <107a>   DW_AT_name        : (indirect string, offset: 0xd7551): AHB1RSTR
    <107e>   DW_AT_decl_file   : 5
    <107f>   DW_AT_decl_line   : 645
    <1081>   DW_AT_decl_column : 17
    <1082>   DW_AT_type        : <0xea2>
    <1086>   DW_AT_data_member_location: 40
 <2><1087>: Abbrev Number: 10 (DW_TAG_member)
    <1088>   DW_AT_name        : (indirect string, offset: 0xd73d0): AHB2RSTR
    <108c>   DW_AT_decl_file   : 5
    <108d>   DW_AT_decl_line   : 646
    <108f>   DW_AT_decl_column : 17
    <1090>   DW_AT_type        : <0xea2>
    <1094>   DW_AT_data_member_location: 44
 <2><1095>: Abbrev Number: 10 (DW_TAG_member)
    <1096>   DW_AT_name        : (indirect string, offset: 0xd7114): AHB3RSTR
    <109a>   DW_AT_decl_file   : 5
    <109b>   DW_AT_decl_line   : 647
    <109d>   DW_AT_decl_column : 17
    <109e>   DW_AT_type        : <0xea2>
    <10a2>   DW_AT_data_member_location: 48
 <2><10a3>: Abbrev Number: 10 (DW_TAG_member)
    <10a4>   DW_AT_name        : (indirect string, offset: 0xd7751): RESERVED1
    <10a8>   DW_AT_decl_file   : 5
    <10a9>   DW_AT_decl_line   : 648
    <10ab>   DW_AT_decl_column : 17
    <10ac>   DW_AT_type        : <0xe96>
    <10b0>   DW_AT_data_member_location: 52
 <2><10b1>: Abbrev Number: 10 (DW_TAG_member)
    <10b2>   DW_AT_name        : (indirect string, offset: 0xd6eee): APB1RSTR1
    <10b6>   DW_AT_decl_file   : 5
    <10b7>   DW_AT_decl_line   : 649
    <10b9>   DW_AT_decl_column : 17
    <10ba>   DW_AT_type        : <0xea2>
    <10be>   DW_AT_data_member_location: 56
 <2><10bf>: Abbrev Number: 10 (DW_TAG_member)
    <10c0>   DW_AT_name        : (indirect string, offset: 0xd6ef8): APB1RSTR2
    <10c4>   DW_AT_decl_file   : 5
    <10c5>   DW_AT_decl_line   : 650
    <10c7>   DW_AT_decl_column : 17
    <10c8>   DW_AT_type        : <0xea2>
    <10cc>   DW_AT_data_member_location: 60
 <2><10cd>: Abbrev Number: 10 (DW_TAG_member)
    <10ce>   DW_AT_name        : (indirect string, offset: 0xd710b): APB2RSTR
    <10d2>   DW_AT_decl_file   : 5
    <10d3>   DW_AT_decl_line   : 651
    <10d5>   DW_AT_decl_column : 17
    <10d6>   DW_AT_type        : <0xea2>
    <10da>   DW_AT_data_member_location: 64
 <2><10db>: Abbrev Number: 10 (DW_TAG_member)
    <10dc>   DW_AT_name        : (indirect string, offset: 0xd775b): RESERVED2
    <10e0>   DW_AT_decl_file   : 5
    <10e1>   DW_AT_decl_line   : 652
    <10e3>   DW_AT_decl_column : 17
    <10e4>   DW_AT_type        : <0xe96>
    <10e8>   DW_AT_data_member_location: 68
 <2><10e9>: Abbrev Number: 10 (DW_TAG_member)
    <10ea>   DW_AT_name        : (indirect string, offset: 0xd6e4c): AHB1ENR
    <10ee>   DW_AT_decl_file   : 5
    <10ef>   DW_AT_decl_line   : 653
    <10f1>   DW_AT_decl_column : 17
    <10f2>   DW_AT_type        : <0xea2>
    <10f6>   DW_AT_data_member_location: 72
 <2><10f7>: Abbrev Number: 10 (DW_TAG_member)
    <10f8>   DW_AT_name        : (indirect string, offset: 0xd6f7e): AHB2ENR
    <10fc>   DW_AT_decl_file   : 5
    <10fd>   DW_AT_decl_line   : 654
    <10ff>   DW_AT_decl_column : 17
    <1100>   DW_AT_type        : <0xea2>
    <1104>   DW_AT_data_member_location: 76
 <2><1105>: Abbrev Number: 10 (DW_TAG_member)
    <1106>   DW_AT_name        : (indirect string, offset: 0xd713d): AHB3ENR
    <110a>   DW_AT_decl_file   : 5
    <110b>   DW_AT_decl_line   : 655
    <110d>   DW_AT_decl_column : 17
    <110e>   DW_AT_type        : <0xea2>
    <1112>   DW_AT_data_member_location: 80
 <2><1113>: Abbrev Number: 10 (DW_TAG_member)
    <1114>   DW_AT_name        : (indirect string, offset: 0xd7765): RESERVED3
    <1118>   DW_AT_decl_file   : 5
    <1119>   DW_AT_decl_line   : 656
    <111b>   DW_AT_decl_column : 17
    <111c>   DW_AT_type        : <0xe96>
    <1120>   DW_AT_data_member_location: 84
 <2><1121>: Abbrev Number: 10 (DW_TAG_member)
    <1122>   DW_AT_name        : (indirect string, offset: 0xd6dd5): APB1ENR1
    <1126>   DW_AT_decl_file   : 5
    <1127>   DW_AT_decl_line   : 657
    <1129>   DW_AT_decl_column : 17
